{
    "Name": "Dianne Feinstein",
    "Profile": {
        "Public Office": {
            "Vice Chair of the Senate Intelligence Committee": {
                "In office": "January 3, 2015 – January 3, 2017",
                "Preceded by": "Saxby Chambliss",
                "Succeeded by": "Mark Warner"
            },
            "Chair of the Senate Intelligence Committee": {
                "In office": "January 3, 2009 – January 3, 2015",
                "Preceded by": "Jay Rockefeller",
                "Succeeded by": "Richard Burr"
            },
            "Chair of the Senate Narcotics Caucus": {
                "In office": "January 3, 2009 – January 3, 2015",
                "Preceded by": "Joe Biden",
                "Succeeded by": "Chuck Grassley"
            },
            "Chair of the Senate Rules Committee": {
                "In office": "January 3, 2007 – January 3, 2009",
                "Preceded by": "Trent Lott",
                "Succeeded by": "Chuck Schumer"
            },
            "United States Senatorfrom California": {
                "Incumbent": "Incumbent",
                "Assumed office": "November 4, 1992Serving with Alex Padilla",
                "Preceded by": "John Seymour"
            },
            "38th Mayor of San Francisco": {
                "In office": "December 4, 1978 – January 8, 1988Acting: November 27, 1978 – December 4, 1978",
                "Preceded by": "George Moscone",
                "Succeeded by": "Art Agnos"
            },
            "President of the San Francisco Board of Supervisors": {
                "In office": "January 9, 1978 – December 4, 1978",
                "Preceded by": "Quentin L. Kopp",
                "Succeeded by": "John L. Molinari"
            },
            "Member of the San Francisco Board of Supervisors": {
                "In office": "January 8, 1970 – December 4, 1978",
                "Preceded by": "William Blake",
                "Succeeded by": "Louise Renne",
                "Constituency": "At-large district (1970–1978),2nd district (1978)"
            }
        },
        "Personal Details": {
            "Personal details": {
                "Born": "Dianne Emiel Goldman, (,1933-06-22,) ,June 22, 1933, (age 89),San Francisco, California, U.S.",
                "Political party": "Democratic",
                "Spouse(s)": "Jack Berman, ,, ,,(,m., 1956; ,div., 1959),, ,Bertram Feinstein, ,, ,,(,m., 1962; died 1978),, ,Richard C. Blum, ,, ,,(,m., 1980; died 2022),",
                "Children": "Katherine",
                "Parent": "Leon Goldman",
                "Education": "Stanford University, (,BA,)",
                "Signature": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3b/Dianne_Feinstein_Signature.svg/128px-Dianne_Feinstein_Signature.svg.png",
                "Website": "Senate website"
            }
        }
    },
    "UnusedVotingRecords": [
        {
            "Bill Number": "S.Amdt. 93 (Hawley) to H.R. 3746",
            "First Name": "Dianne Feinstein",
            "Vote": "Not Voting",
            "Bill Number.1": "H.R. 3746",
            "Bill Name": "Fiscal Responsibility Act of 2023",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "S.Amdt. 98 (Lee) to H.R. 3746",
            "First Name": "Dianne Feinstein",
            "Vote": "Nay",
            "Bill Number.1": "H.R. 3746",
            "Bill Name": "Fiscal Responsibility Act of 2023",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "S.Amdt. 101 (Kaine) to H.R. 3746",
            "First Name": "Dianne Feinstein",
            "Vote": "Nay",
            "Bill Number.1": "H.R. 3746",
            "Bill Name": "Fiscal Responsibility Act of 2023",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "S.Amdt. 134 (Budd) to H.R. 3746",
            "First Name": "Dianne Feinstein",
            "Vote": "Nay",
            "Bill Number.1": "H.R. 3746",
            "Bill Name": "Fiscal Responsibility Act of 2023",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "S.Amdt. 106 (Cotton) to H.R. 3746",
            "First Name": "Dianne Feinstein",
            "Vote": "Nay",
            "Bill Number.1": "H.R. 3746",
            "Bill Name": "Fiscal Responsibility Act of 2023",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "S.Amdt. 125 (Sullivan) to H.R. 3746",
            "First Name": "Dianne Feinstein",
            "Vote": "Not Voting",
            "Bill Number.1": "H.R. 3746",
            "Bill Name": "Fiscal Responsibility Act of 2023",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "S. 937 (117th)",
            "First Name": "Dianne Feinstein",
            "Vote": "Yea",
            "Bill Number.1": "S. 937 (117th)",
            "Bill Name": "COVID-19 Hate Crimes Act",
            "Summary": "This bill requires a designated officer or employee of the Department of Justice (DOJ) to facilitate the expedited review of hate crimes and reports of hate crimes.DOJ must issue guidance for state, local, and tribal law enforcement agencies on establishing online hate crime reporting processes, collecting data disaggregated by protected characteristic (e.g., race or national origin), and expanding education campaigns.Additionally, DOJ and the Department of Health and Human Services must issue guidance aimed at raising awareness of hate crimes during the COVID-19 (i.e., coronavirus disease 2019) pandemic.The bill establishes grants for states to create state-run hate crimes reporting hotlines. It also authorizes grants for states and local governments to implement the National Incident-Based Reporting System and to conduct law enforcement activities or crime reduction programs to prevent, address, or respond to hate crimes.Finally, in the case of an individual convicted of a hate crime offense and placed on supervised release, the bill allows a court to order that the individual participate in educational classes or community service as a condition of supervised release.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "S.J.Res. 14 (117th)",
            "First Name": "Dianne Feinstein",
            "Vote": "Yea",
            "Bill Number.1": "S.J.Res. 14 (117th)",
            "Bill Name": "A joint resolution providing for congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the Environmental Protection Agency relating to \\u201cOil and Natural Gas Sector: Emission Standards for N",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "S. 914 (117th)",
            "First Name": "Dianne Feinstein",
            "Vote": "Yea",
            "Bill Number.1": "S. 914 (117th)",
            "Bill Name": "Drinking Water and Wastewater Infrastructure Act of 2021",
            "Summary": "This bill reauthorizes through FY2026 or establishes a variety of programs for water infrastructure. Specifically, it supports programs to provide safe drinking water or treat wastewater, such as sewer overflows or stormwater. For example, the bill reauthorizes and revises the clean water state revolving fund (SRF) and the drinking water SRF.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "S.J.Res. 15 (117th)",
            "First Name": "Dianne Feinstein",
            "Vote": "Yea",
            "Bill Number.1": "S.J.Res. 15 (117th)",
            "Bill Name": "A joint resolution providing for congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the Office of the Comptroller of Currency relating to \\u201cNational Banks and Federal Savings Association",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "S.J.Res. 13 (117th)",
            "First Name": "Dianne Feinstein",
            "Vote": "Yea",
            "Bill Number.1": "S.J.Res. 13 (117th)",
            "Bill Name": "A joint resolution providing for congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the Equal Employment Opportunity Commission relating to \\u201cUpdate of Commission\\u2019s Conciliation Procedur",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "S. 1301",
            "First Name": "Dianne Feinstein",
            "Vote": "Yea",
            "Bill Number.1": "S. 1301",
            "Bill Name": "[Increase of Public Debt Limit]",
            "Summary": "This bill became the vehicle for passage of the public debt limit increase with the House vote on September 29, 2021. Prior to the House vote on that date, the bill was the Promoting Physical Activity for Americans Act, a bill on an unrelated subject.  Last updated Oct 8, 2021.View all GovTrack summaries.The summary below was written by the Congressional Research Service, which is a nonpartisan division of the Library of Congress, and was published on Oct 15, 2021.This bill increases the public debt limit by $480 billion.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "S.J.Res. 29",
            "First Name": "Dianne Feinstein",
            "Vote": "Nay",
            "Bill Number.1": "S.J.Res. 29",
            "Bill Name": "A joint resolution providing for the reappointment of Michael Govan as a citizen regent of the Board of Regents of the Smithsonian Institution.",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "S. 610 (117th)",
            "First Name": "Dianne Feinstein",
            "Vote": "Yea",
            "Bill Number.1": "S. 610 (117th)",
            "Bill Name": "Protecting Medicare and American Farmers from Sequester Cuts Act",
            "Summary": "This bill makes several budgetary, technical, and procedural changes, particularly in relation to Medicare and increasing the debt limit.Specifically, the bill continues to exempt Medicare from sequestration until March 31, 2022. (Sequestration is a process of automatic, usually across-the-board spending reductions under which budgetary resources are permanently cancelled to enforce specific budget policy goals.)The bill also establishes expedited Senate procedures for considering legislation to increase the debt limit. The procedures limit debate, waive points of order, and prohibit amendments. The procedures may only be used once and expire after January 16, 2022.Additionally, the bill (1) temporarily extends other provisions under Medicare, including a payment increase under the physician fee schedule; and (2) requires any debits recorded for FY2022 on the statutory pay-as-you-go (PAYGO) scorecards to be deducted from the scorecards for 2022 and added to the scorecards for 2023.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "S. 1605 (117th)",
            "First Name": "Dianne Feinstein",
            "Vote": "Yea",
            "Bill Number.1": "S. 1605 (117th)",
            "Bill Name": "National Defense Authorization Act for Fiscal Year 2022",
            "Summary": "This bill was previously a companion bill to H.R. 49, but its text was completely replaced with the military spending provisions in the Dec. 7, 2021 House vote, after H.R. 49 was enacted.  Last updated Dec 11, 2021.View all GovTrack summaries.The summary below was written by the Congressional Research Service, which is a nonpartisan division of the Library of Congress, and was published on Jan 26, 2022.National Defense Authorization Act for Fiscal Year 2022This bill authorizes Department of Defense (DOD) activities and programs for FY2022 and addresses various other issues.For example, the bill provides or extends procurement authority for certain helicopters and amphibious shipbuilding programs; imposes various cost and operational limits on the F-35 aircraft program; provides statutory authority related to DOD Science and Technology Reinvention Laboratories, including direct hire authority with respect to advanced degree holders for positions at such laboratories; authorizes DOD to establish a consortium of institutions of higher education to study irregular warfare; establishes pilot programs for using private-sector partnerships to promote technology transition, deploying fifth-generation wireless telecommunications services on military installations, and digitally optimizing organic industrial base maintenance and repair operations; extends and modifies authorities to assist vetted Syrian groups and individuals, provide assistance to counter the Islamic State of Iraq and Syria, and support the activities of the Office of Security Cooperation in Iraq; extends and modifies the Indo-Pacific Maritime Security Initiative and the Pacific Deterrence Initiative; extends a pilot program providing regional cybersecurity training for members of the Army National Guard; establishes a program within the Cybersecurity and Infrastructure Security Agency to continuously monitor cybersecurity risks to critical infrastructure entities that support national critical functions; authorizes a Department of Energy program to improve defense environmental cleanup processes; authorizes the establishment of an Assistant Secretary for International Narcotics and Law Enforcement Affairs within the Department of State; and imposes limits on when the State Department may use a nonstandard design when constructing an embassy or consulate compound.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "S. 5355 (117th)",
            "First Name": "Dianne Feinstein",
            "Vote": "Nay",
            "Bill Number.1": "S. 53",
            "Bill Name": "Combating Global Corruption Act of 2023",
            "Summary": "This bill requires the Department of State to address corruption in foreign governments.The State Department must annually publish a tiered ranking of foreign countries based on their government's efforts to eliminate corruption.The bill outlines the minimum standards that the State Department must consider when creating the ranking, such as whether a country has criminalized corruption, adopted measures to prevent corruption, and complied with the United Nations Convention Against Corruption and other relevant international agreements. Tier one countries meet the standards; tier two countries make some efforts to meet the standards; tier three countries make de minimis or no efforts to meet the standards.If a country is ranked in the second or third tier, the State Department must designate an anti-corruption contact at the U.S. diplomatic post in that country to promote good governance and combat corruption.The State Department must report annually to Congress a list of foreign persons (individuals or entities) (1) who have engaged in significant corruption in a tier three country, and (2) upon whom the President has imposed sanctions pursuant to this bill.",
            "Status": "Enacted"
        }
    ],
    "VotingRecord": [
        {
            "Bill Number": "S.Amdt. 107 (Paul) to H.R. 3746",
            "First Name": "Dianne Feinstein",
            "Vote": "Not Voting",
            "Bill Number.1": "H.R. 3746",
            "Bill Name": "Fiscal Responsibility Act of 2023",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "S.Amdt. 91 (Braun) to H.R. 3746",
            "First Name": "Dianne Feinstein",
            "Vote": "Not Voting",
            "Bill Number.1": "H.R. 3746",
            "Bill Name": "Fiscal Responsibility Act of 2023",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "S.Amdt. 110 (Marshall) to H.R. 3746",
            "First Name": "Dianne Feinstein",
            "Vote": "Not Voting",
            "Bill Number.1": "H.R. 3746",
            "Bill Name": "Fiscal Responsibility Act of 2023",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "S.Amdt. 104 (Kennedy) to H.R. 3746",
            "First Name": "Dianne Feinstein",
            "Vote": "Not Voting",
            "Bill Number.1": "H.R. 3746",
            "Bill Name": "Fiscal Responsibility Act of 2023",
            "Summary": NaN,
            "Status": "Enacted"
        }
    ]
}