{
    "Name": "Aumua Amata  Radewagen",
    "CosponsoredBills": [
        {
            "Bill Number": "H.R. 1150",
            "First Name": "Aumua Amata  Radewagen",
            "Last Name": "cosponsor",
            "Role": "H.R. 1150",
            "Bill Name": "John Lewis Civil Rights Fellowship Act of 2023",
            "Subject Areas": "International Affairs, Area studies and international education, Congressional oversight, Congressional tributes, Employment and training programs, Higher education, Human rights, International exchange and broadcasting",
            "Summary": "This bill establishes the John Lewis Civil Rights Fellowship Program within the J. William Fulbright Educational Exchange Program (commonly referred to as the Fulbright Program).The fellowship program shall honor the legacy of Representative John Lewis and advance U.S. foreign policy priorities by promoting studies, research, and international exchange in the subject of nonviolent civil rights movements around the world.The Fulbright Foreign Scholarship Board shall annually select qualified individuals to serve as fellows in the fellowship program. The Bureau of Educational and Cultural Affairs may determine the number of fellows for each year, with at least 25 fellows each year whenever feasible. Each fellow shall (1) work in an internship or research position with an approved organization in a country with an operational Fulbright U.S. Student Program, and (2) receive an award sufficient to cover the fellow's reasonable costs during the fellowship period and certain travel and lodging expenses related to the program."
        },
        {
            "Bill Number": "H.R. 7939 (117th)",
            "First Name": "Aumua Amata  Radewagen",
            "Last Name": "cosponsor",
            "Role": "H.R. 7939 (117th)",
            "Bill Name": "Veterans Auto and Education Improvement Act of 2022",
            "Subject Areas": "Armed Forces and National Security, Educational facilities and institutions, Educational technology and distance education, Employment and training programs, Higher education, Long-term, rehabilitative, and terminal care, Student aid and college costs, Temporary and part-time employment, Unemployment, Veterans' education, employment, rehabilitation, Veterans' loans, housing, homeless programs",
            "Summary": "This bill provides permanent authority for the application of certain flexibilities to assist veterans with their educational assistance benefits during emergency situations (as declared by the President). Specifically, the bill extends certain program adjustments that were implemented during the COVID-19 emergency to other emergency situations that may arise and have an effect on veterans and their educational assistance benefits.Among other flexibilities, the bill authorizes the Department of Veterans Affairs to continue to provide educational assistance, including monthly housing stipends or subsistence allowances, for programs of education that have been converted to distance learning due to an emergency or health-related situation; ensures that an educational assistance payment will not be charged against any entitlement to educational assistance or counted against the aggregate period in situations where an individual was unable to complete a course or program due to an emergency situation; extends the time limitation for using educational assistance under the Montgomery GI Bill, Post-9/11 GI Bill, or vocational rehabilitation program when institutions are closed due to an emergency situation or executive order; authorizes the payment of work-study allowances during emergency periods; ensures an educational assistance payment shall not be charged against an individual's entitlement if the individual was unable to complete a course or program due to the temporary closure of an educational institution or the temporary termination of a program by reason of an emergency situation; and adjusts the administration of certain benefits for veterans participating in an apprenticeship or other on-job training."
        },
        {
            "Bill Number": "H.R. 8260 (117th)",
            "First Name": "Aumua Amata  Radewagen",
            "Last Name": "cosponsor",
            "Role": "H.R. 8260 (117th)",
            "Bill Name": "Faster Payments to Veterans\\u2019 Survivors Act of 2022",
            "Subject Areas": "Government information and archives, Life, casualty, property insurance, Veterans' pensions and compensation",
            "Summary": NaN
        },
        {
            "Bill Number": "H.R. 2930 (117th)",
            "First Name": "Aumua Amata  Radewagen",
            "Last Name": "cosponsor",
            "Role": "H.R. 2930 (117th)",
            "Bill Name": "Safeguard Tribal Objects of Patrimony Act of 2021",
            "Subject Areas": "Native Americans, Administrative remedies, Advisory bodies, Alaska Natives and Hawaiians, Archaeology and anthropology, Cemeteries and funerals, Charitable contributions, Civil actions and liability, Crimes against property, Criminal procedure and sentencing, Customs enforcement, Department of the Interior, Diplomacy, foreign officials, Americans abroad, Evidence and witnesses, Executive agency funding and structure, Federal-Indian relations, Government information and archives, Historical and cultural resources, Income tax deductions, International organizations and cooperation, Licensing and registrations, Presidents and presidential powers, Vice Presidents, Right of privacy, Smuggling and trafficking, Tax administration and collection, taxpayers, Trade restrictions, User charges and fees",
            "Summary": NaN
        },
        {
            "Bill Number": "H.R. 8876 (117th)",
            "First Name": "Aumua Amata  Radewagen",
            "Last Name": "cosponsor",
            "Role": "H.R. 8876 (117th)",
            "Bill Name": "Jackie Walorski Maternal and Child Home Visiting Reauthorization Act of 2022",
            "Subject Areas": "Health, Appropriations, Census and government statistics, Child care and development, Child health, Child safety and welfare, Computers and information technology, Congressional oversight, Family planning and birth control, Family services, Government information and archives, Government studies and investigations, Health promotion and preventive care, Health technology, devices, supplies, Home and outpatient care, Intergovernmental relations, Performance measurement, Social work, volunteer service, charitable organizations, State and local finance, State and local government operations, Women's health",
            "Summary": "This bill reauthorizes through FY2027, increases funding for, and modifies the Maternal, Infant, and Early Childhood Home Visiting Program. This program supports home visits for expectant and new parents who live in communities that are at-risk for poor maternal and child health outcomes.Changes to the program include setting out requirements for allocating program funds; increasing the percentage of funds reserved for tribal entities; establishing a publicly available dashboard that reports program outcomes; requiring activities to reduce unnecessary data collection, reporting, and other administrative requirements of the program; and allowing for virtual home visits (provided certain conditions are met)."
        },
        {
            "Bill Number": "H.R. 3630 (117th)",
            "First Name": "Aumua Amata  Radewagen",
            "Last Name": "cosponsor",
            "Role": "H.R. 3630 (117th)",
            "Bill Name": "Lymphedema Treatment Act",
            "Subject Areas": "Health, Labor and Employment, Cardiovascular and respiratory health, Health care coverage and access, Immunology and vaccination, Medicare",
            "Summary": "This bill provides for Medicare coverage of lymphedema compression treatment items. Specifically, the bill provides for coverage of standard and custom fitted gradient compression garments and other approved items that are prescribed by a physician or other specified health care professional to treat lymphedema."
        },
        {
            "Bill Number": "H.R. 5577 (117th)",
            "First Name": "Aumua Amata  Radewagen",
            "Last Name": "cosponsor",
            "Role": "H.R. 5577 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 3900 Crown Road Southwest in Atlanta, Georgia, as the \\u201cJohn R. Lewis Post Office Building\\u201d.",
            "Subject Areas": "Government Operations and Politics, Congressional tributes, Georgia, Government buildings, facilities, and property, Postal service",
            "Summary": "This bill designates the facility of the United States Postal Service located at 3900 Crown Road Southwest in Atlanta, Georgia, as the John R. Lewis Post Office Building."
        },
        {
            "Bill Number": "H.R. 7846 (117th)",
            "First Name": "Aumua Amata  Radewagen",
            "Last Name": "cosponsor",
            "Role": "H.R. 7846 (117th)",
            "Bill Name": "Veterans\\u2019 Compensation Cost-of-Living Adjustment Act of 2022",
            "Subject Areas": "Armed Forces and National Security, Administrative law and regulatory procedures, Department of Veterans Affairs, Disability assistance, Inflation and prices, Veterans' pensions and compensation",
            "Summary": NaN
        },
        {
            "Bill Number": "H.R. 8656 (117th)",
            "First Name": "Aumua Amata  Radewagen",
            "Last Name": "cosponsor",
            "Role": "H.R. 8656 (117th)",
            "Bill Name": "To designate the clinic of the Department of Veterans Affairs in Mishawaka, Indiana, as the \\u201cJackie Walorski VA Clinic\\u201d.",
            "Subject Areas": "Armed Forces and National Security, Congressional tributes, Department of Veterans Affairs, Government buildings, facilities, and property, Health facilities and institutions, Indiana, Veterans' medical care",
            "Summary": NaN
        },
        {
            "Bill Number": "H.R. 8198 (117th)",
            "First Name": "Aumua Amata  Radewagen",
            "Last Name": "cosponsor",
            "Role": "H.R. 8198 (117th)",
            "Bill Name": "Ensuring the Best Schools for Veterans Act of 2022",
            "Subject Areas": "Armed Forces and National Security, Higher education, Student aid and college costs, Veterans' education, employment, rehabilitation",
            "Summary": NaN
        },
        {
            "Bill Number": "H.R. 1057 (117th)",
            "First Name": "Aumua Amata  Radewagen",
            "Last Name": "cosponsor",
            "Role": "H.R. 1057 (117th)",
            "Bill Name": "Greatest Generation Commemorative Coin Act",
            "Subject Areas": "Finance and Financial Sector, Conflicts and wars, Currency, Military history, Monuments and memorials, U.S. history, Veterans' organizations and recognition",
            "Summary": "This bill directs the Department of the Treasury to mint and issue up to 50,000 $5 coins, 400,000 $1 silver coins, and 750,000 half-dollar clad coins in commemoration of the National World War II Memorial in the District of Columbia.The design of the coins shall be emblematic of the memorial and the service and sacrifice of American soldiers and civilians during World War II.All surcharges received from the sale of such coins shall be paid to the Friends of the National World War II Memorial to support the National Park Service in maintaining and repairing the memorial, and for educational and commemorative programs."
        },
        {
            "Bill Number": "H.R. 2428 (117th)",
            "First Name": "Aumua Amata  Radewagen",
            "Last Name": "cosponsor",
            "Role": "H.R. 2428 (117th)",
            "Bill Name": "Strengthening Oversight for Veterans Act of 2021",
            "Subject Areas": "Evidence and witnesses, Government employee pay, benefits, personnel management, Government studies and investigations",
            "Summary": "This bill gives the Department of Veterans Affairs Office of Inspector General (VA OIG) the authority to subpoena the attendance and testimony of witnesses as necessary to carry out the duties of the office.The bill prohibits the VA OIG from subpoenaing the attendance and testimony of current federal employees or witnesses as part of any criminal proceeding.Under the bill, the VA OIG must notify the Department of Justice (DOJ) and the intended witness of the intent to issue a subpoena. If DOJ objects to the subpoena because it will interfere with an ongoing investigation, the VA OIG may not issue the subpoena."
        },
        {
            "Bill Number": "H.R. 7073 (117th)",
            "First Name": "Aumua Amata  Radewagen",
            "Last Name": "cosponsor",
            "Role": "H.R. 7073 (117th)",
            "Bill Name": "Into the Light for MMH and SUD Act of 2022",
            "Subject Areas": NaN,
            "Summary": "This bill reauthorizes through FY2028 a program that addresses maternal depression and, among other changes, expands its scope to include mental health and substance use disorders. It also requires the Department of Health and Human Services to maintain a national hotline to provide mental health and substance use disorder resources to pregnant and postpartum women and their families."
        },
        {
            "Bill Number": "H.R. 1842 (117th)",
            "First Name": "Aumua Amata  Radewagen",
            "Last Name": "cosponsor",
            "Role": "H.R. 1842 (117th)",
            "Bill Name": "Harriet Tubman Bicentennial Commemorative Coin Act",
            "Subject Areas": "U.S. history, Women's rights",
            "Summary": "This bill directs the Department of the Treasury to mint and issue 50,000 $5 gold coins, 400,000 $1 silver coins, and 750,000 half-dollar clad coins emblematic of the legacy of Harriet Tubman as an abolitionist.The Secretary may issue coins under this bill only during the period of January 1, 2024, through December 31, 2024.All surcharges received by Treasury from the sale of such coins must be paid equally to the National Underground Railroad Freedom Center in Cincinnati, Ohio, and The Harriet Tubman Home, Inc. in Auburn, New York, for the purpose of accomplishing and advancing their missions."
        },
        {
            "Bill Number": "H.R. 5509 (117th)",
            "First Name": "Aumua Amata  Radewagen",
            "Last Name": "cosponsor",
            "Role": "H.R. 5509 (117th)",
            "Bill Name": "Student Veteran COVID-19 Protection Act of 2021",
            "Subject Areas": NaN,
            "Summary": "This bill addresses the administration of certain Department of Veterans Affairs (VA) educational assistance benefits and home loans, including by authorizing the VA to waive certain enrollment verifications, exempting foreign educational institutions from certain requirements, extending the time limitations on the use of educational assistance benefits, and adjusting certain home loan fees."
        },
        {
            "Bill Number": "H.R. 5142 (117th)",
            "First Name": "Aumua Amata  Radewagen",
            "Last Name": "cosponsor",
            "Role": "H.R. 5142 (117th)",
            "Bill Name": "To award posthumously a Congressional Gold Medal, in commemoration to the servicemembers who perished in Afghanistan on August 26, 2021, during the evacuation of citizens of the United States and Afghan allies at Hamid Karzai Internati",
            "Subject Areas": "Armed Forces and National Security, International Affairs, Afghanistan, Asia, Conflicts and wars, Congressional tributes, Emergency planning and evacuation, Military operations and strategy, Military personnel and dependents, Museums, exhibitions, cultural centers, Smithsonian Institution, Terrorism",
            "Summary": "This bill posthumously provides for the award of a Congressional Gold Medal in commemoration of the 13 service members who died on August 26, 2021, while stationed at Hamid Karzai International Airport in Afghanistan."
        },
        {
            "Bill Number": "H.R. 1448 (117th)",
            "First Name": "Aumua Amata  Radewagen",
            "Last Name": "cosponsor",
            "Role": "H.R. 1448 (117th)",
            "Bill Name": "PAWS for Veterans Therapy Act",
            "Subject Areas": "Armed Forces and National Security, Animal protection and human-animal relationships, Congressional oversight, Disability assistance, Government information and archives, Government studies and investigations, Health programs administration and funding, Mammals, Mental health, Neurological disorders, Service animals, Veterans' education, employment, rehabilitation, Veterans' medical care",
            "Summary": "This bill implements a program and a policy related to service dog therapy for veterans. Specifically, the bill requires the Department of Veterans Affairs (VA) to implement a five-year pilot program to provide canine training to eligible veterans diagnosed with post-traumatic stress disorder as an element of a complementary and integrative health program. Eligible veterans are those who are enrolled in the VA health care system and have been recommended for participation by a qualified mental health care provider or clinical team.The VA must seek to enter agreements containing specified elements with accredited nongovernmental entities that have demonstrated ability to provide canine training.Veterans who participate in the program are authorized to adopt the dog they assisted in training if their health provider determines it is in the best interest of the veteran.The VA must establish processes to document and track the progress of participating veterans with respect to health benefits and improvements. The Government Accountability Office must brief Congress and submit a report on the program.The bill also authorizes the VA to provide service dogs to veterans with mental illnesses, regardless of whether they have a mobility impairment."
        },
        {
            "Bill Number": "H.R. 4436 (117th)",
            "First Name": "Aumua Amata  Radewagen",
            "Last Name": "cosponsor",
            "Role": "H.R. 4436 (117th)",
            "Bill Name": "Daniel Anderl Judicial Security and Privacy Act of 2021",
            "Subject Areas": NaN,
            "Summary": "This bill generally prohibits federal agencies and private businesses from publicly posting the personally identifiable information (e.g., home addresses) of federal judges and their immediate family members. It also (1) requires information to be removed upon written request from the federal judge concerned, (2) prohibits data brokers from purchasing or selling such information, and (3) establishes programs to protect such information at the state and local level and to enhance security for judges."
        },
        {
            "Bill Number": "H.R. 3577 (117th)",
            "First Name": "Aumua Amata  Radewagen",
            "Last Name": "cosponsor",
            "Role": "H.R. 3577 (117th)",
            "Bill Name": "United States Army Rangers Veterans of World War II Congressional Gold Medal Act",
            "Subject Areas": "Armed Forces and National Security, Conflicts and wars, Congressional tributes, Military history, Museums, exhibitions, cultural centers, Smithsonian Institution, Veterans' organizations and recognition",
            "Summary": "This bill provides for the award of a single Congressional Gold Medal to the U.S. Army Rangers Veterans of World War II in recognition of their dedicated service during World War II."
        },
        {
            "Bill Number": "H.R. 707 (117th)",
            "First Name": "Aumua Amata  Radewagen",
            "Last Name": "cosponsor",
            "Role": "H.R. 707 (117th)",
            "Bill Name": "Ghost Army Congressional Gold Medal Act",
            "Subject Areas": "Military operations and strategy, Military personnel and dependents, Museums, exhibitions, cultural centers, Smithsonian Institution",
            "Summary": "This bill directs the Speaker of the House of Representatives and the President pro tempore of the Senate to award a Congressional Gold Medal to the 23rd Headquarters Special Troops and the 3133rd Signal Service Company, known as the Ghost Army, collectively, in recognition of its service during World War II."
        },
        {
            "Bill Number": "H.R. 2252 (117th)",
            "First Name": "Aumua Amata  Radewagen",
            "Last Name": "cosponsor",
            "Role": "H.R. 2252 (117th)",
            "Bill Name": "Emmett Till and Mamie Till-Mobley Congressional Gold Medal Act of 2021",
            "Subject Areas": "Racial and ethnic relations, Smithsonian Institution, U.S. history",
            "Summary": "This bill provides for the posthumous presentation of a Congressional Gold Medal in commemoration of Emmett Till and Mamie Till-Mobley.After the award the medal shall be given to the National Museum of African American History and Culture."
        },
        {
            "Bill Number": "H.R. 1276 (117th)",
            "First Name": "Aumua Amata  Radewagen",
            "Last Name": "cosponsor",
            "Role": "H.R. 1276 (117th)",
            "Bill Name": "Strengthening and Amplifying Vaccination Efforts to Locally Immunize All Veterans and Every Spouse Act",
            "Subject Areas": "Armed Forces and National Security, Cardiovascular and respiratory health, Disability and paralysis, Emergency medical services and trauma care, Hospital care, Immunology and vaccination, Infectious and parasitic diseases, Veterans' medical care",
            "Summary": "This bill authorizes the Department of Veterans Affairs (VA) to furnish a COVID-19 (i.e., coronavirus disease 2019) vaccine to covered individuals during the COVID-19 public health emergency.Under the bill, covered individuals are veterans who are not eligible to enroll in the VA health care system; specified veterans who are eligible for hospital care, medical services, and nursing home care abroad; beneficiaries who are eligible for care due to a specified disability or death of a veteran; family caregivers of veterans who are participating in the VA's Program of Comprehensive Assistance for Family Caregivers; caregivers of veterans participating in the VA's Program of General Caregiver Support Services; caregivers of veterans participating in the VA's Medical Foster Home Program, Bowel and Bladder Program, Home Based Primary Care Program, or Veteran Directed Care Program; and the spouses of veterans. The VA must prioritize the vaccination of (1) veterans who are enrolled in the VA health care system, (2) veterans who fail to enroll but receive hospital care and medical services for specified disabilities in their first 12 months of separation from service, and (3) caregivers accompanying such prioritized veterans.Under the bill, the VA is authorized to determine the timing for offering a vaccine to the spouse of a veteran."
        },
        {
            "Bill Number": "H.R. 1085 (117th)",
            "First Name": "Aumua Amata  Radewagen",
            "Last Name": "cosponsor",
            "Role": "H.R. 1085 (117th)",
            "Bill Name": "To award three congressional gold medals to the United States Capitol Police and those who protected the U.S. Capitol on January 6, 2021.",
            "Subject Areas": "Assault and harassment offenses, Congress, Congressional tributes, Crimes against property, District of Columbia, Government buildings, facilities, and property, Law enforcement officers, Museums, exhibitions, cultural centers, Protest and dissent, Smithsonian Institution, Subversive activities, Terrorism, U.S. Capitol, Violent crime",
            "Summary": "This bill directs the Speaker of the House and the President pro tempore of the Senate to arrange for the award of three Congressional Gold Medals to the U.S. Capitol Police (USCP) and other law enforcement agencies that protected the U.S. Capitol on January 6, 2021.Following the award of these medals, one medal shall be given to the USCP, one medal shall be given to the Metropolitan Police Department of the District of Columbia, and one medal shall be given to the Smithsonian Institution and displayed with a plaque listing all law enforcement agencies that participated in protecting the Capitol on January 6, 2021."
        },
        {
            "Bill Number": "H.R. 1799 (117th)",
            "First Name": "Aumua Amata  Radewagen",
            "Last Name": "cosponsor",
            "Role": "H.R. 1799 (117th)",
            "Bill Name": "PPP Extension Act of 2021",
            "Subject Areas": "Commerce, Business expenses, Cardiovascular and respiratory health, Emergency medical services and trauma care, Government lending and loan guarantees, Infectious and parasitic diseases, Small business, Wages and earnings",
            "Summary": "This bill extends the Paycheck Protection Program, established to support small businesses in response to COVID-19 (i.e., coronavirus disease 2019), through June 30, 2021. Currently, the program is set to expire on March 31, 2021.For the final 30 days of the program (i.e., from June 1 until June 30), the Small Business Administration may only process applications submitted prior to June 1, and it may not accept any new loan applications.The bill excludes the budgetary effects of this bill from PAYGO scorecards under the Statutory Pay-As-You-Go Act of 2010 and from Senate PAYGO scorecards."
        },
        {
            "Bill Number": "H.R. 1179 (117th)",
            "First Name": "Aumua Amata  Radewagen",
            "Last Name": "cosponsor",
            "Role": "H.R. 1179 (117th)",
            "Bill Name": "Iran Hostages Congressional Gold Medal Act",
            "Subject Areas": "International Affairs, Congressional tributes, Detention of persons, Diplomacy, foreign officials, Americans abroad, Iran, Middle East, Museums, exhibitions, cultural centers, Smithsonian Institution",
            "Summary": "This bill requires the Speaker of the House of Representatives and the President pro tempore of the Senate to arrange for the award of a Congressional Gold Medal commemorating the bravery and endurance of the 53 hostages of the Iran Hostage Crisis.Following its award, the medal shall be given to the National Museum of American History of the Smithsonian Institution for display and research.The Department of the Treasury must strike duplicate medals in silver for presentation to a hostage (or the personal representative of a deceased hostage), and Treasury may also strike and sell duplicate medals in bronze."
        },
        {
            "Bill Number": "H.R. 3525 (117th)",
            "First Name": "Aumua Amata  Radewagen",
            "Last Name": "cosponsor",
            "Role": "H.R. 3525 (117th)",
            "Bill Name": "Commission To Study the Potential Creation of a National Museum of Asian Pacific American History and Culture Act",
            "Subject Areas": NaN,
            "Summary": "This bill establishes a Commission to Study the Potential Creation of a National Museum of Asian Pacific American History and Culture.The commission must (1) report recommendations for a plan of action for the establishment and maintenance of a National Museum of Asian Pacific American History and Culture in Washington, DC; (2) develop a fundraising plan to support the establishment, operation, and maintenance of the museum through public contributions; (3) obtain an independent review of this fundraising plan, including an analysis of the resources necessary to fund the construction of the museum and its operations and maintenance in perpetuity without reliance on federal funds; and (4) submit a legislative plan of action to establish and construct the museum.The commission may convene a national conference relating to the museum.The commission shall be solely responsible for acceptance of contributions to it and payment of its expenses.No federal funding may be obligated to carry out this bill."
        },
        {
            "Bill Number": "H.R. 3128 (117th)",
            "First Name": "Aumua Amata  Radewagen",
            "Last Name": "cosponsor",
            "Role": "H.R. 3128 (117th)",
            "Bill Name": "American Fisheries Advisory Committee Act of 2021",
            "Subject Areas": "Marine and coastal resources, fisheries, Marketing and advertising, Research administration and funding, Research and development, Seafood",
            "Summary": "This bill directs the National Oceanic and Atmospheric Administration (NOAA)to establish the American Fisheries Advisory Committee to advise on an existing grant program to address the needs of fishing communities, optimize economic benefits by building and maintaining sustainable fisheries, and increase opportunities to keep working waterfronts viable.NOAA must establish six regions within the committee.The committee must consist of members chosen regionally and across sectors of the fishing industry.Additionally, the committee must (1)identify the needs of the fishing community, (2) develop request for proposals for the grant program, (3)review grant applications, and (4)provide NOAA with grant applications for approval."
        },
        {
            "Bill Number": "H.R. 4702 (117th)",
            "First Name": "Aumua Amata  Radewagen",
            "Last Name": "cosponsor",
            "Role": "H.R. 4702 (117th)",
            "Bill Name": "Military Spouse Tax Act",
            "Subject Areas": "Armed Forces and National Security, Housing finance and home ownership, Military personnel and dependents, Tax treatment of families",
            "Summary": "This bill provides that a spouse of a service member may retain their personal residence or domicile for purposes of taxation.The bill authorizes a service member and the spouse of the member to elect to use the following locations for purposes of taxation: the residence or domicile of the member, the residence or domicile of the spouse, or the permanent duty station of the member."
        },
        {
            "Bill Number": "H.R. 2429 (117th)",
            "First Name": "Aumua Amata  Radewagen",
            "Last Name": "cosponsor",
            "Role": "H.R. 2429 (117th)",
            "Bill Name": "VA Police Improvement and Accountability Act",
            "Subject Areas": "Armed Forces and National Security, Congressional oversight, Criminal justice information and records, Evidence and witnesses, Government employee pay, benefits, personnel management, Government ethics and transparency, public corruption, Government information and archives, Law enforcement officers, Photography and imaging",
            "Summary": "This bill requires the Department of Veterans Affairs (VA) to establish policies and procedures related to the accountability and staffing of its police force.Specifically, the bill requires the VA to publish specified summaries, statistics, and contact information related to the activities of VA police officers from the previous five-year period. The VA must ensure that each of its police forces is able to provide VA employees and members of the public who contact the force with contact information to directly contact the police force regarding the arrest, ticketing, detainment, use of force, or other police matters pertaining to the individual.The bill requires VA police officers to wear body cameras that record and store audio and video. Additionally, the VA's guidance on the use of body cameras must be made publicly available.Under the bill, the VA is required to track and analyze the following information regarding its police force: arrests made and tickets issued; prosecutions, ticketing, and other actions relating to such arrests; the use of force and weapon discharges; and complaints, investigations, and disciplinary actions. The VA must ensure each incident of the use of force is promptly reported to the Assistant Secretary with responsibility for operations, preparedness, security, and law enforcement functions. The Assistant Secretary must review and investigate each incident (including allegations) of the use of force by a VA police officer, including such situations where any person receives medical attention.The VA must develop a plan that establishes minimum standards for police staffing at its facilities."
        },
        {
            "Bill Number": "H.R. 3795 (117th)",
            "First Name": "Aumua Amata  Radewagen",
            "Last Name": "cosponsor",
            "Role": "H.R. 3795 (117th)",
            "Bill Name": "STEM Educator Awards Equity Act",
            "Subject Areas": "Science, Technology, Communications",
            "Summary": "This bill increases from 108 to 110 the number of Presidential Awards for Excellence in Mathematics and Science Teaching the President must award each year. The awards are given to kindergarten through grade 12 school teachers of mathematics and science who have demonstrated outstanding teaching ability.In selecting teachers for an award, the President shall select at least one teacher each from the Commonwealth of the Northern Mariana Islands, American Samoa, the U.S. Virgin Islands, and Guam."
        }
    ]
}