{
    "Name": "Debra  Haaland",
    "CosponsoredBills": [
        {
            "Bill Number": "H.R. 1085 (117th)",
            "First Name": "Debra  Haaland",
            "Last Name": "cosponsor",
            "Role": "H.R. 1085 (117th)",
            "Bill Name": "To award three congressional gold medals to the United States Capitol Police and those who protected the U.S. Capitol on January 6, 2021.",
            "Subject Areas": "Assault and harassment offenses, Congress, Congressional tributes, Crimes against property, District of Columbia, Government buildings, facilities, and property, Law enforcement officers, Museums, exhibitions, cultural centers, Protest and dissent, Smithsonian Institution, Subversive activities, Terrorism, U.S. Capitol, Violent crime",
            "Summary": "This bill directs the Speaker of the House and the President pro tempore of the Senate to arrange for the award of three Congressional Gold Medals to the U.S. Capitol Police (USCP) and other law enforcement agencies that protected the U.S. Capitol on January 6, 2021.Following the award of these medals, one medal shall be given to the USCP, one medal shall be given to the Metropolitan Police Department of the District of Columbia, and one medal shall be given to the Smithsonian Institution and displayed with a plaque listing all law enforcement agencies that participated in protecting the Capitol on January 6, 2021."
        }
    ],
    "VotingRecord": [
        {
            "Bill Number": "H.R. 1319 (117th)",
            "First Name": "Debra Haaland",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1319 (117th)",
            "Bill Name": "American Rescue Plan Act of 2021",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1319 (117th)",
            "First Name": "Debra Haaland",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1319 (117th)",
            "Bill Name": "American Rescue Plan Act of 2021",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1192 (117th)",
            "First Name": "Debra Haaland",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1192 (117th)",
            "Bill Name": "PRRADA",
            "Summary": "This bill requires professionals employed in debt adjustment cases involving Puerto Rico to file verified statements disclosing their connections with interested parties before seeking compensation for their services.The Financial Oversight and Management Board for Puerto Rico must establish a list of such interested parties, which shall include the debtor, creditors, any attorney or accountant of the debtor or creditors, persons employed by the U.S. Trustee Program, persons employed by the board, and any other interested party.Compensation may be denied to such a professional if these disclosures are not filed, are inadequate, or if the professional is found to have certain conflicts of interest.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 208 (117th)",
            "First Name": "Debra Haaland",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 208 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 500 West Main Street, Suite 102 in Tupelo, Mississippi, as the Colonel Carlyle Smitty Harris Post Office.",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 335 (117th)",
            "First Name": "Debra Haaland",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 335 (117th)",
            "Bill Name": "To provide for an exception to a limitation against appointment of persons as Secretary of Defense within seven years of relief from active duty as a regular commissioned officer of the Armed Forces.",
            "Summary": "This bill allows the first person nominated and appointed as Secretary of Defense after 12 p.m. (Eastern Standard Time) on January 20, 2021, to be a person who is, on the date of appointment, at least four years after relief from active duty as a commissioned officer of a regular component of the Armed Forces. Under current law, an individual may not be appointed as Secretary of Defense within seven years after relief from such active duty.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 22 (117th)",
            "First Name": "Debra Haaland",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 22 (117th)",
            "Bill Name": "Congressional Budget Justification Transparency Act of 2021",
            "Summary": "This bill requires federal agencies to make budget justification materials available to the public on a website. The bill also requires the Office of Management and Budget to make certain details regarding the materials available to the public, including a list of the agencies that submit budget justification materials to Congress, the dates that the materials are submitted to Congress and posted online, and links to the materials.",
            "Status": "Enacted"
        }
    ]
}