{
    "Name": "James (Jim)  Moylan",
    "CosponsoredBills": [
        {
            "Bill Number": "H.R. 6056",
            "First Name": "James (Jim)  Moylan",
            "Last Name": "cosponsor",
            "Role": "H.R. 6056",
            "Bill Name": "More Child Care and Jobs for Military Families Act",
            "Subject Areas": "Armed Forces and National Security",
            "Summary": "This bill requires the Department of Defense (DOD) to report on at-home child care programs offered by each military department. Additionally, DOD must study and report on (1) standardizing the requirements of each military department relating to licensing and certification for at-home child care providers, (2) removing barriers to the expansion of at-home child care programs, and (3) supporting the employment of military spouses in at-home child care programs."
        },
        {
            "Bill Number": "H.R. 5377",
            "First Name": "James (Jim)  Moylan",
            "Last Name": "cosponsor",
            "Role": "H.R. 5377",
            "Bill Name": "To amend title 38, United States Code, to extend and modify certain authorities and requirements relating to the Department of Veterans Affairs, and for other purposes.",
            "Subject Areas": "Armed Forces and National Security",
            "Summary": "This bill extends the eligibility or applicability of various Department of Veterans Affairs (VA) programs and benefits.First, the bill extends from three to five years the authority for additional licensed health care professionals (i.e., physician assistants, nurse practitioners, audiologists, and psychologists) to perform medical disability examinations as part of the existing VA pilot program related to the use of contract physicians for disability examinations.Currently, when an individual transfers fewer than 12 credits from a program of education that is closed or disapproved, the individual is deemed to have not received those credits, and no charge from the individual's entitlement to education assistance may be made for that period of enrollment. Under the bill, this period of relief for those affected by a closure or disapproval is extended by two years to apply to programs that close or discontinue before September 30, 2025.The bill extends through FY2028 the authorization for VA emergency preparedness for public health emergencies.The bill also extends the applicability of certain loan fee rates through November 15, 2031, under the VA's home loan program."
        },
        {
            "Bill Number": "H.R. 1096",
            "First Name": "James (Jim)  Moylan",
            "Last Name": "cosponsor",
            "Role": "H.R. 1096",
            "Bill Name": "250th Anniversary of the United States Marine Corps Commemorative Coin Act",
            "Subject Areas": "Military personnel and dependents",
            "Summary": "This bill directs the Department of the Treasury to mint and issue not more than 50,000 $5 gold coins, 400,000 $1 silver coins, and 750,000 half-dollar clad coins emblematic of the 250th anniversary of the United States Marine Corps.All surcharges received by Treasury from the sale of such coins must be paid to the Marine Corps Heritage Foundation and shall only be used for the purposes of supporting the mission of the Marine Corps Heritage Center."
        },
        {
            "Bill Number": "H.R. 1150",
            "First Name": "James (Jim)  Moylan",
            "Last Name": "cosponsor",
            "Role": "H.R. 1150",
            "Bill Name": "John Lewis Civil Rights Fellowship Act of 2023",
            "Subject Areas": "International Affairs, Area studies and international education, Congressional oversight, Congressional tributes, Employment and training programs, Higher education, Human rights, International exchange and broadcasting",
            "Summary": "This bill establishes the John Lewis Civil Rights Fellowship Program within the J. William Fulbright Educational Exchange Program (commonly referred to as the Fulbright Program).The fellowship program shall honor the legacy of Representative John Lewis and advance U.S. foreign policy priorities by promoting studies, research, and international exchange in the subject of nonviolent civil rights movements around the world.The Fulbright Foreign Scholarship Board shall annually select qualified individuals to serve as fellows in the fellowship program. The Bureau of Educational and Cultural Affairs may determine the number of fellows for each year, with at least 25 fellows each year whenever feasible. Each fellow shall (1) work in an internship or research position with an approved organization in a country with an operational Fulbright U.S. Student Program, and (2) receive an award sufficient to cover the fellow's reasonable costs during the fellowship period and certain travel and lodging expenses related to the program."
        },
        {
            "Bill Number": "H.R. 979",
            "First Name": "James (Jim)  Moylan",
            "Last Name": "cosponsor",
            "Role": "H.R. 979",
            "Bill Name": "No Terrorists on U.S. Soil Act of 2023",
            "Subject Areas": NaN,
            "Summary": "This bill extends the prohibition on the use of Department of Defense (DOD) funds for certain purposes related to the U.S. Naval Station in Guantanamo Bay, Cuba.The bill extends through December 31, 2024, the prohibition on using DOD funds to transfer or release to or within the United States (or its territories or possessions) detainees who (1) are not U.S. citizens or members of the U.S. Armed Forces, and (2) are or were held by DOD on or after January 20, 2009, at Guantanamo.The bill also extends through December 31, 2024, the prohibition on the use of DOD funds to construct or modify any facility in the United States (or its territories or possessions) to house any individual transferred from Guantanamo for the purposes of detention or imprisonment by DOD.Additionally, the bill extends to FY2024 funds the prohibition on the use of certain DOD funds to (1) close or abandon Guantanamo, (2) or relinquish control of Guantanamo to Cuba."
        }
    ]
}