{
    "Name": "Jasmine  Crockett",
    "VotingRecord": [
        {
            "Bill Number": "H.R. 2670",
            "First Name": "Jasmine Crockett",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 2670",
            "Bill Name": "National Defense Authorization Act for Fiscal Year 2024",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 6503",
            "First Name": "Jasmine Crockett",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 6503",
            "Bill Name": "Airport and Airway Extension Act of 2023, Part II",
            "Summary": "This bill temporarily extends specific Federal Aviation and Administration (FAA) programs and activities through March 8, 2024.For example, the bill extends the FAA Unmanned Aircraft Systems (UAS) pilot programs (e.g., the UAS Test Site Program and the UAS remote detection and identification pilot program), weather reporting programs, Remote Tower Pilot Program, and Essential Air Service Program. The bill also extends the authorization for the Airport Improvement Program (AIP). (This program provides grants for planning, development, and noise compatibility projects at or associated with certain public-use airports.)Further, the bill extends through March 8, 2024, the FAA's authority for expenditures from the Airport and Airway Trust Fund (AATF) and to collect various taxes and fees to fund the AATF, including taxes on aviation fuel and airline tickets. (The AATF is the primary funding source for all major FAA accounts that fund federal aviation programs, with the remainder coming from general fund appropriations.)",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 6363",
            "First Name": "Jasmine Crockett",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 6363",
            "Bill Name": "Further Continuing Appropriations and Other Extensions Act, 2024",
            "Summary": "This bill provides continuing FY2024 appropriations for federal agencies. The bill also extends several expiring programs and authorities, including programs authorized by the 2018 farm bill and several public health programs.DIVISION A--FURTHER CONTINUING APPROPRIATIONS ACT, 2024Further Continuing Appropriations Act, 2024(Sec. 101) This section provides continuing FY2024 appropriations for federal agencies and extends several expiring programs and authorities.It is known as a continuing resolution (CR) and prevents a government shutdown that would otherwise occur if the FY2024 appropriations bills have not been enacted when the existing CR expires on November 17, 2023.The CR provides funding through January 19, 2024, for agencies and programs that were funded in the following four FY2023 appropriations acts: the Agriculture, Rural Development, Food and Drug Administration, and Related Agencies Appropriations Act, 2023; the Energy and Water Development and Related Agencies Appropriations Act, 2023; the Military Construction, Veterans Affairs, and Related Agencies Appropriations Act, 2023; and the Transportation, Housing and Urban Development, and Related Agencies Appropriations Act, 2023. For most other federal agencies and programs, the CR provides funding through February 2, 2024.The CR generally funds most programs and activities at the FY2023 levels with several exceptions that provide funding flexibility and additional appropriations for various programs. For example, the CR includes exceptions for: the Navy's procurement of one Columbia Class Submarine, activities of the U.S. Secret Service that are related to National Special Security Events and the 2024 Presidential Campaign, and activities of the Department of Education that are necessary to ensure the continuation of student loan servicing activities. This section also extends several expiring programs and authorities, including the U.S. Parole Commission, the authority for the Department of Defense (DOD) to provide physical protection and personal security for certain former or retired DOD officials who face serious and credible threats arising from duties performed while employed by DOD, restrictions on firearms that are undetectable by walk-through metal detectors and X-ray machines commonly used at airports, limits on pay increases for the Vice President and certain senior political appointees, the exemption from the Antideficiency Act for the Federal Communications Commission's Universal Service Fund, and the Department of Homeland Security's Countering Weapons of Mass Destruction Office. This section provides appropriations for a payment to Katherine Anne Feinstein, the beneficiary of the late Senator Dianne Feinstein.DIVISION B--OTHER MATTERSTITLE I--EXTENSIONS AND OTHER MATTERS(Sec. 101) This section extends provisions that provide grants and other financial assistance to the Federated States of Micronesia and the Republic of the Marshall Islands.(Sec. 102) This section extends programs authorized by the Agriculture Improvement Act of 2018 (commonly known as the 2018 farm bill) until the later of (1) September 30, 2024, or (2) the date specified in the provision of the act.This section extends and amends Department of Agriculture (USDA) commodity programs, including by extending various programs for covered commodities, a loan commodity, sugarcane, or sugar beets for the 2024 crop year; extending the Dairy Margin Coverage (DMC) program through December 31, 2024; limiting the 25% premium discount for the DMC program in 2024 to participating dairy operations that received the discount in 2023; allowing Dairy Forward Pricing Program contracts to be extended through September 30, 2027 (currently September 30, 2026); extending the Price Loss Coverage (PLC) payments through the 2024 crop year for a covered commodity; extending the suspension of permanent price support authorities for the 2024 crop year for covered commodities, cotton, and sugar and through December 31, 2024, for milk; and extending the suspension of provisions related to corn and wheat marketing quotas for wheat planted for harvest in calendar year 2024. This section reauthorizes, and extends funding for, the Grassroots Source Water Protection Program (SWPP) for FY2024. The SWPP is a joint project with the Farm Service Agency and the National Rural Water Association (a nonprofit water and wastewater utility membership organization), which is designed to help prevent pollution of surface and ground water that is used as the primary source of drinking water by rural residents.This section reauthorizes, and extends funding for, the Voluntary Public Access and Habitat Incentive Program through FY2024. The program provides funding to help state and tribal governments encourage landowners to allow public access to their land for hunting, fishing, and other wildlife-dependent recreation.This section reauthorizes, and extends funding for, the Feral Swine Eradication and Control Pilot Program through FY2024. The program responds to the threat feral swine pose to agriculture, native ecosystems, and human and animal health.This section extends the Bill Emerson Humanitarian Trust through FY2024 to allow for eligible commodities to remain in the trust until September 30, 2024. The program makes funds available to provide emergency food assistance to developing countries.This section extends the Emergency Food Assistance Program (TEFAP) through FY2024. TEFAP provides food commodities (and cash support for storage and distribution costs) through states to local emergency feeding organizations (e.g., food banks).This section reauthorizes, and extends funding for, the Rural Economic Development Loan & Grant Program through FY2024 to provide funding for rural projects through local utility organizations.This section provides specified funds for scholarships for students at 1890 Institutions and extends the annual grant limitation by one year. This National Institute of Food and Agriculture (NIFA) program provides grants to 1890 Institutions (i.e., historically Black colleges and universities that belong to the U.S. land-grant university system) for awarding scholarships to students who intend to pursue a career in the food and agricultural sciences.This section also reauthorizes, and extends funding for, the Urban, Indoor, and other Emerging Agricultural Production Research, Education, and Extension Initiative for FY2024, a NIFA competitive grant program; provides specified funds for the Foundation for Food and Agriculture Research, a nonprofit corporation established to advance the research mission of USDA by supporting research activities focused on key problems of national and international significance; and extends through FY2024 a provision that prohibits USDA from declaring the Grazinglands Research Laboratory in El Reno, Oklahoma, to be excess or surplus federal property, or otherwise conveying or transferring the property. This section reauthorizes, and extends funding for, the biobased markets program (i.e., BioPreferred Program) through FY2024 to promote biobased products through (1) mandatory purchasing requirements for federal agencies and their contractors, and (2) a voluntary labeling initiative for biobased products.This section reauthorizes, and extends funding for, the bioenergy program for advanced biofuels (i.e., Advanced Biofuel Payment Program) through FY2024. The program provides payments to fuel producers to support and expand production of advanced biofuels (i.e., not derived from corn starch).This section extends through the 2024 crop the Feedstock Flexibility Program (FFP) for Bioenergy Producers, which allows the Commodity Credit Corporation to purchase surplus sugar from processors for resale to ethanol producers for ethanol fuel. Further, this section extends through September 1, 2024, requirements for USDA to provide notice to eligible entities and bioenergy producers of the quantity of eligible commodities that must be made available for purchase and sale for the crop year.This section extends the authority and funding through FY2024 for USDA to collect and report data on the production and marketing of organic agricultural products.This section reauthorizes, and extends funding through FY2024 for, modernization and improvement of international trade technology systems and data collection for imports of organically produced agricultural products.This section reauthorizes, and extends funding for, the Organic Certification Cost Share Program for FY2024. The program provides cost-share assistance to producers and handlers of agricultural products who are obtaining or renewing their certification under the National Organic Program.This section reauthorizes, and extends funding for, the multiple crop and pesticide use survey of farmers through FY2024. The USDA Office of Pest Management Policy conducts this survey to collect data for risk assessment modeling and mitigation for an active ingredient.This section also extends the Pima Agriculture Cotton Trust Fund through December 31, 2024, which provides assistance to reduce the economic injury to domestic manufacturers resulting from tariffs on cotton fabric that are higher than tariffs on certain apparel articles made of cotton fabric; the Agriculture Wool Apparel Manufacturers Trust Fund through December 31, 2024, which provides assistance to reduce the economic injury to domestic manufacturers resulting from tariffs on wool fabric that are higher than tariffs on certain apparel articles made of wool fabric; the Wool Research and Promotion Program through FY2024, which provides grants to assist U.S. wool producers with improving the quality of wool and with developing and promoting the wool market; the Emergency Citrus Disease Research and Development Trust Fund through FY2024, which funds a program that aims to bring together scientists to find scientifically sound and financially sustainable solutions to Huanglongbing (i.e., citrus greening, a bacterial disease spread by an insect that feeds on citrus); and the Sheep Production & Marketing Grant Program through FY2024, which seeks to strengthen and enhance the production and marketing of sheep and sheep products in the United States. This section specifies that the extension of farm bill programs does not apply to certain mandatory funding that was provided for (1) the Farm Service Agency to implement USDA commodity programs, and (2) certain payments under the Conservation Reserve Program for forest management thinning and transition contracts.This section extends various reporting requirements authorized by the Agriculture Improvement Act of 2018.This section rescinds specified funds that were provided to USDA for the Biorefinery, Renewable Chemical, and Biobased Product Manufacturing Assistance Program, which provides loan guarantees to assist in the development of new and emerging technologies for the development of advanced biofuels, renewable chemicals, and biobased product manufacturing.This section, with limited exceptions, must be applied and administered as if it had been enacted on September 30, 2023.TITLE II--HEALTH AND HUMAN SERVICESSubtitle A--Public Health Extenders(Sec. 201) This section extends through January 19, 2024, funding for the Teaching Health Center Graduate Medical Education Program, the Community Health Center Fund, and the National Health Services Corps. (The program supports education and training of medical students in primary care residency programs in community-based ambulatory patient care centers. The fund supports (1) grants for outpatient health care facilities that serve medically underserved populations; and (2) the National Health Service Corps, which provides scholarships and student loan repayment awards to health care providers who agree to work in areas with health care provider shortages.)(Sec. 202) This section extends funding through January 19, 2024, for the Special Diabetes Program for Type I Diabetes and the Special Diabetes Program for Indians. (The Special Diabetes Program for Type I Diabetes supports research on the prevention and cure of Type I diabetes, and the Special Diabetes Program for Indians supports diabetes treatment and prevention for tribal populations.)(Sec. 203) This section extends through January 19, 2024, the authority that allows states and tribes to request the temporary reassignment of state and local health department personnel who are funded through certain federal programs to immediately address a public health emergency.It also extends through January 19, 2024, provisions that prohibit the disclosure of information about Department of Health and Human Services (HHS) programs that could compromise national security (e.g., information regarding biomedical threats).The section extends provisions that authorize HHS to engage with developers of medical countermeasures, and that provide for related antitrust exemptions, for the purpose of furthering product development.Additionally, the section extends through January 19, 2024, the National Advisory Committee on Children and Disasters, the National Advisory Committee on Seniors and Disasters, and the National Advisory Committee on Individuals with Disabilities and Disasters.It also extends through January 19, 2024, the authority of HHS to directly appoint candidates to positions within the National Disaster Medical System if HHS determines the number of personnel in the system is insufficient to address a public health emergency or potential public health emergency.(The National Disaster Medical System is a partnership between HHS, the Department of Defense, and other federal departments that responds to public health and other emergencies, including by deploying medical response teams.)Subtitle B--Medicaid(Sec. 301) This section delays reductions to Medicaid disproportionate-share hospital (DSH) allotments until January 20, 2024. (DSHs are hospitals that receive additional payments under Medicaid for treating a large share of low-income patients.)(Sec. 302) This section reduces the amount of funding available to the Medicaid Improvement Fund for activities relating to mechanized claims systems beginning in FY2028.Subtitle C--Human Services(Sec. 401) This section funds through January 19, 2024, programs that support child welfare services and activities. Specifically, it funds the (1) Stephanie Tubbs Jones Child Welfare Service Program, which provides grants to states and Indian tribes to support preventive interventions and other activities to keep families together; and (2) the MaryLee Allen Promoting Safe and Stable Families Program, which supports efforts to prevent the unnecessary separation of children from their families, improve quality of care and services to children and their families, and ensure permanent living arrangements for children (e.g., parental reunification or adoption).(Sec. 402) This section extends funding through January 19, 2024, for the Sexual Risk Avoidance Education Program. This program supports projects to implement sexual risk avoidance education that teaches participants to voluntarily refrain from nonmarital sexual activities.(Sec. 403) This section extends funding through January 19, 2024, for the Personal Responsibility Education Program. This program provides grants to states to educate young people about abstinence and contraception for prevention of pregnancy and sexually transmitted infections. The program also supports pregnant and parenting youth.Subtitle D--Medicare(Sec. 501) This section extends through January 19, 2024, certain minimum adjustments to the work geographic index with respect to payments for physician services under Medicare.(Sec. 502) This section delays until 2025 certain laboratory reporting requirements that are used to determine payment rates for clinical diagnostic laboratory tests under Medicare, as well as related payment reductions.(Sec. 503) This section increases funding for the Medicare Improvement Fund.TITLE III--MISCELLANEOUS EXTENSIONS(Sec. 601) This section extends through February 3, 2024, the authority of the Department of Homeland Security and the Department of Justice to take certain actions to mitigate a credible threat to certain facilities or assets from an unmanned aircraft system (UAS). These include certain facilities that are located in the United States and identified as high-risk and a potential target for unlawful UAS activity.TITLE IV--BUDGETARY EFFECTS(Sec. 701) This section exempts the budgetary effects of this division from (1) the Statutory Pay-As-You-Go Act of 2010 (PAYGO Act), (2) the Senate PAYGO rule, and (3) certain budget scorekeeping rules.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 7463",
            "First Name": "Jasmine Crockett",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 7463",
            "Bill Name": "Extension of Continuing Appropriations and Other Matters Act, 2024",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 7454",
            "First Name": "Jasmine Crockett",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 7454",
            "Bill Name": "Airport and Airway Extension Act of 2024",
            "Summary": "This bill temporarily extends specific Federal Aviation and Administration (FAA) programs and activities through May 10, 2024.For example, the bill extends the FAA Unmanned Aircraft Systems (UAS) pilot programs (e.g., the UAS Test Site Program and the UAS remote detection and identification pilot program), weather reporting programs, Remote Tower Pilot Program, and Essential Air Service Program. The bill also extends the authorization for the Airport Improvement Program (AIP). (This program provides grants for planning, development, and noise compatibility projects at or associated with certain public-use airports.)Further, the bill extends through May 10, 2024, the FAA's authority for expenditures from the Airport and Airway Trust Fund (AATF) and to collect various taxes and fees to fund the AATF, including taxes on aviation fuel and airline tickets. (The AATF is the primary funding source for all major FAA accounts that fund federal aviation programs, with the remainder coming from general fund appropriations.)The bill also extends through May 10, 2024, the authority of the Department of Homeland Security and the Department of Justice to take certain actions to mitigate a credible threat to certain facilities or assets from a UAS. These include certain facilities that are located in the United States and identified as high-risk and a potential target for unlawful UAS activity.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 2882",
            "First Name": "Jasmine Crockett",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 2882",
            "Bill Name": "Further Consolidated Appropriations Act, 2024",
            "Summary": "This bill provides FY2024 appropriations for several federal departments and agencies. It also extends various expiring programs and authorities. Specifically, the bill includes 6 of the 12 regular FY2024 appropriations bills: the Department of Defense Appropriations Act, 2024; the Financial Services and General Government Appropriations Act, 2024; the Department of Homeland Security Appropriations Act, 2024; the Departments of Labor, Health and Human Services, and Education, and Related Agencies Appropriations Act, 2024; the Legislative Branch Appropriations Act, 2024; and the Department of State, Foreign Operations, and Related Programs Appropriations Act, 2024. The departments, agencies, and activities funded in the bill include the military activities of the Department of Defense, the Department of the Treasury, the Executive Office of the President, the judiciary, federal payments to the District of Columbia, the Department of Homeland Security, the Department of Labor, the Department of Health and Human Services, the Department of Education, Congress and the agencies that serve Congress, the Department of State, and several related and independent agencies. In addition, the bill extends various programs and authorities, including the National Flood Insurance Program, the Morris K. Udall and Stewart L. Udall Foundation Trust Fund, and several authorities and programs related to immigration.The bill also prohibits State Department funds from being used to make payments to the U.N. Relief and Works Agency until March 25, 2025.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 4821",
            "First Name": "Jasmine Crockett",
            "Vote": "Nay",
            "Bill Number.1": "H.R. 4821",
            "Bill Name": "Department of the Interior, Environment, and Related Agencies Appropriations Act, 2024",
            "Summary": "This bill provides FY2024 appropriations for the Department of the Interior, the Environmental Protection Agency (EPA), and several related agencies.The bill provides appropriations to Interior for the Bureau of Land Management, the U.S. Fish and Wildlife Service, the National Park Service, the U.S. Geological Survey, the Bureau of Ocean Energy Management, the Bureau of Safety and Environmental Enforcement, the Office of Surface Mining Reclamation and Enforcement, the Bureau of Indian Affairs, the Bureau of Indian Education, the Bureau of Trust Funds Administration, Departmental Offices, and Department-Wide Programs. The bill also provides appropriations to the EPA and the Forest Service.Within the Department of Health and Human Services, the bill provides appropriations for the Indian Health Service, the National Institute of Environmental Health Sciences, and the Agency for Toxic Substances and Disease Registry. The bill provides appropriations to several related agencies, including the Council on Environmental Quality and Office of Environmental Quality, the Chemical Safety and Hazard Investigation Board, the Office of Navajo and Hopi Indian Relocation, the Institute of American Indian and Alaska Native Culture and Arts Development, the Smithsonian Institution, the National Gallery of Art, the John F. Kennedy Center for the Performing Arts, the Woodrow Wilson International Center for Scholars, the National Endowment for the Arts, the National Endowment for the Humanities, the Commission of Fine Arts, the Advisory Council on Historic Preservation. the National Capital Planning Commission, the U.S. Holocaust Memorial Museum, the World War I Centennial Commission, and the U.S. Semiquincentennial Commission. Additionally, the bill sets forth requirements and restrictions for using funds provided by this and other appropriations acts.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 2872",
            "First Name": "Jasmine Crockett",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 2872",
            "Bill Name": "Further Additional Continuing Appropriations and Other Extensions Act, 2024",
            "Summary": "This bill provides continuing FY2024 appropriations for federal agencies. The bill also extends several expiring programs and authorities, including several public health programs.DIVISION A--FURTHER ADDITIONAL CONTINUING APPROPRIATIONS ACT, 2024Further Additional Continuing Appropriations Act, 2024 (Sec. 101) This section provides continuing FY2024 appropriations for federal agencies. It is known as a continuing resolution (CR) and prevents a government shutdown that would otherwise occur if the FY2024 appropriations bills have not been enacted when the existing CR expires.The CR provides funding through March 1, 2024, for agencies and programs that were funded in the following four FY2023 appropriations acts: the Agriculture, Rural Development, Food and Drug Administration, and Related Agencies Appropriations Act, 2023; the Energy and Water Development and Related Agencies Appropriations Act, 2023; the Military Construction, Veterans Affairs, and Related Agencies Appropriations Act, 2023; and the Transportation, Housing and Urban Development, and Related Agencies Appropriations Act, 2023. (Under the current CR, these agencies and programs are funded through January 19, 2024.)For most other federal agencies and programs, the CR provides funding through March 8, 2024. (Under the current CR, these agencies and programs are funded through February 2, 2024.)The CR generally funds most programs and activities at the FY2023 levels with several exceptions that provide funding flexibility and additional appropriations for various programs. For example, the CR includes exceptions for the National Nuclear Security Administration and the Federal Aviation Administration.In addition, the CR allows the Department of Defense to obligate specified funds from the Shipbuilding and Conversion, Navy account for the procurement of one Columbia Class Submarine.The CR also extends the authority for the U.S. Parole Commission.DIVISION B--OTHER MATTERS TITLE I--HEALTH AND HUMAN SERVICESSubtitle A--Public Health Extenders(Sec. 101) This section extends through March 8, 2024, funding for the Teaching Health Center Graduate Medical Education Program, the Community Health Center Fund, and the National Health Services Corps. (The program supports education and training of medical students in primary care residency programs in community-based ambulatory patient care centers. The fund supports (1) grants for outpatient health care facilities that serve medically underserved populations; and (2) the National Health Service Corps, which provides scholarships and student loan repayment awards to health care providers who agree to work in areas with health care provider shortages.)(Sec. 102) This section extends funding through March 8, 2024, for the Special Diabetes Program for Type I Diabetes and the Special Diabetes Program for Indians. (The Special Diabetes Program for Type I Diabetes supports research on the prevention and cure of Type I diabetes, and the Special Diabetes Program for Indians supports diabetes treatment and prevention for tribal populations.)(Sec. 103) This section extends through March 8, 2024, the authority that allows states and tribes to request the temporary reassignment of state and local health department personnel who are funded through certain federal programs to immediately address a public health emergency.It also extends through March 8, 2024, provisions that prohibit the disclosure of information about Department of Health and Human Services (HHS) programs that could compromise national security (e.g., information regarding biomedical threats).The section extends provisions that authorize HHS to engage with developers of medical countermeasures, and that provide for related antitrust exemptions, for the purpose of furthering product development.Additionally, the section extends through March 8, 2024, the National Advisory Committee on Children and Disasters, the National Advisory Committee on Seniors and Disasters, and the National Advisory Committee on Individuals with Disabilities and Disasters.It also extends through March 8, 2024, the authority of HHS to directly appoint candidates to positions within the National Disaster Medical System if HHS determines the number of personnel in the system is insufficient to address a public health emergency or potential public health emergency.(The National Disaster Medical System is a partnership between HHS, the Department of Defense, and other federal departments that responds to public health and other emergencies, including by deploying medical response teams.)Subtitle B--Medicaid(Sec. 121) This section delays reductions to Medicaid disproportionate-share hospital (DSH) allotments until March 9, 2024. (DSHs are hospitals that receive additional payments under Medicaid for treating a large share of low-income patients.)(Sec. 122) This section reduces the amount of funding available to the Medicaid Improvement Fund for activities relating to mechanized claims systems beginning in FY2028.Subtitle C--Medicare(Sec. 131) This section extends through March 8, 2024, certain minimum adjustments to the work geographic index with respect to payments for physician services under Medicare.(Sec. 132) This section reduces funding for the Medicare Improvement Fund.Subtitle D--Human Services(Sec. 141) This section funds through March 8, 2024, programs that support child welfare services and activities. Specifically, it funds the (1) Stephanie Tubbs Jones Child Welfare Service Program, which provides grants to states and Indian tribes to support preventive interventions and other activities to keep families together; and (2) the MaryLee Allen Promoting Safe and Stable Families Program, which supports efforts to prevent the unnecessary separation of children from their families, improve quality of care and services to children and their families, and ensure permanent living arrangements for children (e.g., parental reunification or adoption).(Sec. 142) This section extends funding through March 8, 2024, for the Sexual Risk Avoidance Education Program. This program supports projects to implement sexual risk avoidance education that teaches participants to voluntarily refrain from nonmarital sexual activities.(Sec. 143) This section extends funding through March 8, 2024, for the Personal Responsibility Education Program. This program provides grants to states to educate young people about abstinence and contraception for prevention of pregnancy and sexually transmitted infections. The program also supports pregnant and parenting youth TITLE II--COMPACTS(Sec. 201) This section extends through March 8, 2024, provisions that provide grants and other financial assistance to the Federated States of Micronesia and the Republic of the Marshall Islands.TITLE III--COUNTER-UAS AUTHORITIES(Sec. 301) This section extends through March 8, 2024, the authority of the Department of Homeland Security and the Department of Justice to take certain actions to mitigate a credible threat to certain facilities or assets from an unmanned aircraft system (UAS). These include certain facilities that are located in the United States and identified as high-risk and a potential target for unlawful UAS activity.TITLE IV--BUDGETARY EFFECTS(Sec. 401) This section exempts the budgetary effects of this division from (1) the Statutory Pay-As-You-Go Act of 2010 (PAYGO Act), (2) the Senate PAYGO rule, and (3) certain budget scorekeeping rules.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 4364",
            "First Name": "Jasmine Crockett",
            "Vote": "Nay",
            "Bill Number.1": "H.R. 4364",
            "Bill Name": "Legislative Branch Appropriations Act, 2024",
            "Summary": "This bill provides FY2024 appropriations for the legislative branch, including the House of Representatives and joint items such as the Joint Economic Committee, the Joint Committee on Taxation, the Office of the Attending Physician, and the Office of Congressional Accessibility Services. In addition, the bill provides FY2024 appropriations for the Capitol Police; the Office of Congressional Workplace Rights; the Congressional Budget Office; the Architect of the Capitol; the Library of Congress, including the Congressional Research Service and the Copyright Office; the Government Publishing Office; the Government Accountability Office; Congressional Office for International Leadership Fund; and the John C. Stennis Center for Public Service Training and Development. (Pursuant to the longstanding practice of each chamber of Congress determining its own requirements, funds for the Senate are not included in the House bill.)The bill also sets forth requirements and restrictions for using funds provided by this bill.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 4394",
            "First Name": "Jasmine Crockett",
            "Vote": "Nay",
            "Bill Number.1": "H.R. 4394",
            "Bill Name": "Energy and Water Development and Related Agencies Appropriations Act, 2024",
            "Summary": "This bill provides FY2024 appropriations for U.S. Army Corps of Engineers civil works projects, the Department of the Interior's Bureau of Reclamation, the Department of Energy (DOE), and several independent agencies.The bill provides appropriations for U.S. Army Corps of Engineers civil works projects, including for Investigations, Construction, Mississippi River and Tributaries, Operation and Maintenance, the Regulatory Program, the Formerly Utilized Sites Remedial Action Program, Flood Control and Coastal Emergencies, Expenses, the Office of the Assistant Secretary of the Army for Civil Works, and the Water Infrastructure Finance and Innovation Program. The bill provides appropriations to the Department of the Interior for the Central Utah Project and the Bureau of Reclamation.The bill provides appropriations to DOE for energy programs, including Energy Efficiency and Renewable Energy; Cybersecurity, Energy Security, and Emergency Response; Electricity; Nuclear Energy; Fossil Energy and Carbon Management; Naval Petroleum and Oil Shale Reserves; the Strategic Petroleum Reserve; the Northeast Home Heating Oil Reserve; the Energy Information Administration; Non-Defense Environmental Cleanup; the Uranium Enrichment Decontamination and Decommissioning Fund; Science; Nuclear Waste Disposal; Technology Transitions; Clean Energy Demonstrations; the Advanced Research Projects Agency—Energy; the Title 17 Innovative Technology Loan Guarantee Program; the Advanced Technology Vehicles Manufacturing Loan Program; the Tribal Energy Loan Guarantee Program; Indian Energy Policy and Programs; Departmental Administration; and the Office of the Inspector General. The bill also provides appropriations to DOE for Atomic Energy Defense Activities of the National Nuclear Security Administration, Environmental and Other Defense Activities, and the Power Marketing Administrations. The bill provides appropriations to several independent agencies, including the Federal Energy Regulatory Commission and the Nuclear Regulatory Commission.The bill includes provisions that address the operation of the Central Valley Project (CVP), which is a federal water project in California owned and operated by the Bureau of Reclamation, and the California State Water Project (SWP), which is operated jointly with the CVP.In addition, the bill makes the Bureau of Reclamation the lead agency for the purpose of coordinating all permitting and related activities required to construct certain new surface water storage projects.The bill also sets forth requirements and restrictions for using funds provided by this and other appropriations acts.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 5860",
            "First Name": "Jasmine Crockett",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 5860",
            "Bill Name": "Continuing Appropriations Act, 2024 and Other Extensions Act",
            "Summary": "This bill provides continuing FY2024 appropriations to federal agencies through November 17, 2023, and provides emergency funding for disaster relief.It also extends several expiring programs and authorities, including several Federal Aviation Administration programs, the National Flood Insurance Program, Federal Drug Administration user fees for animal drug applications, and several public health programs.DIVISION A--CONTINUING APPROPRIATIONS ACT, 2024This division provides continuing FY2024 appropriations to federal agencies through the earlier of November 17, 2023, or the enactment of the applicable appropriations act.It is known as a continuing resolution (CR) and prevents a government shutdown that would otherwise occur if the FY2024 appropriations bills have not been enacted when FY2024 begins on October 1, 2023.The CR funds most programs and activities at the FY2023 levels with several exceptions that provide funding flexibility and additional appropriations for various programs.This division also provides emergency funding to respond to natural disasters.(Sec. 101) This section provides FY2024 appropriations to federal agencies for continuing projects or activities at the levels and under the conditions included in specified FY2023 appropriations acts. The section also extends several immigration-related programs and specifies several exceptions.(Sec. 102) This section prohibits the Department of Defense (DOD) from funding new or accelerated production of certain projects and other activities and certain multiyear procurements prior to the enactment of the regular annual appropriations act.(Sec. 103) This section specifies that funds provided by Section 101 of this division shall be available to the extent and in the manner that would be provided in the pertinent appropriations act.(Sec. 104) This section generally prohibits appropriations provided by Section 101 of this division from being used to initiate or resume any project or activity that was not funded during FY2023.(Sec. 105) This section specifies that appropriations provided by the CR are to be used to conduct FY2024 activities and programs during the period of the CR.(Sec. 106) This section continues the appropriations provided by this division through the earlier of November 17, 2023, or the enactment of the applicable appropriations act.(Sec. 107) This section requires expenditures for activities funded in this division to be charged to the full-year appropriations bill and relevant account when the applicable appropriations bill becomes law.(Sec. 108) This section waives the normal time limitations for submission and approval of apportionments of accounts funded in annual appropriations acts.(Sec. 109) This section limits disbursements for programs that would otherwise have high initial rates of operation or would complete distribution of funding at the beginning of the fiscal year if those actions would impinge on final congressional funding prerogatives.(Sec. 110) This section requires this division to be implemented so that only the most limited funding action permitted by this division is taken in order to provide for continuation of projects and activities.(Sec. 111) This section continues funding for certain appropriated entitlements and other mandatory payments with budget authority provided in an FY2023 appropriations act at the rate necessary to maintain program levels under current law. It also provides authority to obligate funds for mandatory payments that are due up to 30 days following the expiration of the CR.(Sec. 112) This section permits funding made available by this division for civilian personnel compensation and benefits in each department and agency to be apportioned at the rate necessary to avoid furloughs. It also requires all necessary actions to reduce or defer non-personnel-related administrative expenses to be taken prior to using this authority.(Sec. 113) This section permits funds appropriated by this division to be obligated and expended notwithstanding specified statutory provisions restricting appropriations for foreign assistance, the Department of State, international broadcasting, and intelligence activities in the absence of prior authorizations.(Sec. 114) This section extends designations of emergency requirements to funds provided by this division that previously carried those designations. (Emergency spending is generally exempt from discretionary spending limits.)This section also extends other specified designations (e.g. disaster relief funds) to funds provided by this division. (These designations generally allow adjustments to discretionary spending limits to accommodate additional spending for specified purposes.)(Sec. 115) This section sets forth requirements for the treatment of rescissions when federal agencies implement the funding levels provided by the CR.(Sec. 116) This section allows the Department of Agriculture's (USDA's) Farm Service Agency to apportion funding for the Agricultural Credit Insurance Fund Program account at the rate necessary to accommodate approved applications for direct and guaranteed farm ownership loans.(Sec. 117) This section allows USDA to apportion funding at the rate necessary to maintain activities for the Rural Housing Service's Rental Assistance Program.(Sec. 118) This section allows USDA to apportion funding at the rate necessary to maintain participation in the Special Supplemental Nutrition Program for Women, Infants, and Children (WIC).(Sec. 119) This section allows USDA to apportion funding at the rate necessary to maintain the current program caseload for the Commodity Supplemental Food Program.(Sec. 120) This section extends various authorities under the Livestock Mandatory Reporting Act of 1999, which requires buyers of live cattle, swine, and lamb and sellers of wholesale beef, pork, and lamb to report prices, volumes, and other marketing characteristics to USDA's Agricultural Marketing Service.(Sec. 121) This section allows the National Telecommunications and Information Administration to apportion funding for Salaries and Expenses at the rate necessary to administer broadband programs.(Sec. 122) This section extends the availability of specified funds that were provided to the National Aeronautics and Space Administration (NASA) for Space Operations.(Sec. 123) This section extends the U.S. Parole Commission through the duration of the CR.(Sec. 124) This section allows DOD to obligate specified funds from the Shipbuilding and Conversion, Navy account for the procurement of one Columbia Class Submarine.(Sec. 125) This section extends the authority for DOD to provide physical protection and personal security for certain former or retired DOD officials who face serious and credible threats arising from duties performed while employed by DOD.(Sec. 126) This section provides additional funding to the Office of Personnel Management for Salaries and Expenses.(Sec. 127) This section authorizes the District of Columbia to spend local funds at the rates set forth in the Fiscal Year 2024 Local Budget Act of 2023 for programs and activities that were funded in FY2023.(Sec. 128) This section allows the Federal Emergency Management Agency (FEMA) to apportion funding for the Disaster Relief Fund at the rate necessary to carry out response and recovery activities under the Robert T. Stafford Disaster Relief and Emergency Assistance Act.(Sec. 129) This section provides emergency funding to FEMA for the Disaster Relief Fund. It also requires specified funds to be transferred to the Office of the Inspector General for related audits and activities.(Sec. 130) This section reauthorizes the National Flood Insurance Program through November 17, 2023.(Sec. 131) This section extends the authority for the Department of Homeland Security's National Cybersecurity Protection System (commonly known as EINSTEIN) and related reporting requirements.(Sec. 132) This section allows the Department of the Interior and the Forest Service to apportion funds at the rate necessary to continue funding a base salary increase for federal wildland firefighters.(Sec. 133) This section extends funding for the Temporary Assistance for Needy Families (TANF) program.(Sec. 134) This section extends the authority for DOD to obligate funds for certain military construction projects.(Sec. 135) This section extends the authority for the Department of State and the U.S. Agency for International Development to hire certain Personal Service Contractors.(Sec. 136) This section extends the term of a member of the board of the Millennium Challenge Corporation.(Sec. 137) This section makes additional funding available to the Federal Aviation Administration for the personnel and related expenses funded by the Facilities and Equipment account.DIVISION B--OTHER MATTERSTITLE I--EXTENSIONS AND OTHER MATTERS(Sec. 2101) This section extends through November 17, 2023, certain provisions of the Compact of Free Association with the Federated States of Micronesia (FSM) that provide grants and other financial assistance for the FSM.The section also extends the authority for certain federal programs and services in the FSM and the Republic of the Marshall Islands until new federal programs and services agreements take effect.(Sec. 2102) This section extends the deadlines for the Department of the Interior to issue proposed and final regulations pursuant to negotiated rulemaking for the Tribal Self-Governance Program. (The PROGRESS for Indian Tribes Act revised Interior's process for approving self-governance compacts and funding agreements with tribes. The act also authorized a negotiated rulemaking committee to negotiate and promulgate regulations for its implementation.)TITLE II--FAA EXTENSIONThis title temporarily extends specific Federal Aviation and Administration (FAA) programs and activities.Subtitle A--Federal Aviation Programs(Sec. 2201) This section extends through December 31, 2023, the Airport Improvement Program (AIP). This program provides grants for planning, development, and noise compatibility projects at or associated with certain public-use airports.(Sec. 2202) This section extends through December 31, 2023, certain expiring Department of Transportation (DOT) and FAA authorities and programs.This section extends through December 31, 2023, the authority of DOT to provide insurance and reinsurance for the federal government for risks from operating an aircraft and providing related goods or services.This section extends through December 31, 2023, the FAA's Unmanned Aircraft Systems (UAS) Test Site Program, which provides verification of the safety of public and civil UAS, operations, and related navigation procedures before their integration into the national airspace system.This section extends through December 31, 2023, the authority of DOT to provide exemptions from some requirements for UAS by using a risk-based approach to determine if certain UAS may operate safely in the national airspace system.This section extends through December 31, 2023, the FAA's airport safety and airspace hazard mitigation and enforcement program to test and evaluate technologies or systems that detect and mitigate potential aviation safety risks posed by UAS. This section extends through December 31, 2023, competitive access disclosure requirements for AIP grant applications for large and medium hub airports. Specifically, an airport must provide assurances to DOT that it will report if it has been unable to accommodate one or more requests by an air carrier for access to gates or other facilities at that airport in order to provide service or expanded service.This section extends authorization through December 31, 2023, for AIP grants for airports located in the Republic of the Marshall Islands, the Federated States of Micronesia, and the Republic of Palau.This section extends authorization through December 31, 2023, for the FAA AIP supplementary discretionary funds for grants for airport or terminal development projects.This section extends through December 31, 2023, AIP grant authorization for compatible land use planning and projects by state and local governments. Airport-compatible land uses are those that can coexist with a nearby airport without constraining the safe and efficient operation of the airport, or exposing people living or working nearby to significant environmental impacts.This section extends through December 31, 2023, authorization for the AIP non-movement area surveillance surface display systems pilot grant program. These systems use on-airport sensors to track vehicles or aircraft that are equipped with transponders on portions of the airfield surface that are not under the control of air traffic control.This section extends through December 31, 2023, authorization for the FAA weather reporting programs.This section extends through January 1, 2024, a learning period (i.e., moratorium) that applies to certain DOT commercial spaceflight safety regulations governing the design or operation of a launch vehicle to protect the health and safety of crew, government astronauts, and space flight participants.This section extends through December 31, 2023, authority for DOT to enter into a reimbursable agreement with the Department of Interior for the purpose of funding airport development at Midway Island Airport.This section extends through December 31, 2023, the termination date for a final order establishing mileage and adjustment eligibility under the Essential Air Service Program using the most commonly used route between the place and the nearest medium hub airport or large hub airport. (DOT established the program to ensure that small communities that were served by certificated air carriers before the Airline Deregulation Act of 1978 would continue to receive scheduled passenger service.)This section extends through December 31, 2023, the moratorium on discontinuing the FAA Contract Weather Observer Program at any airport.This section extends through December 31, 2023, the authority for the FAA remote tower pilot program. A remote tower is a remotely operated air navigation facility, including all necessary system components, that provides the functions and capabilities of an air traffic control tower whereby air traffic services are provided to operators at an airport from a location that may not be on or near the airport.This section extends through December 31, 2023, the authority for DOT to provide AIP grants for airport access roads in certain remote locations and for storage facilities for certain snow removal and safety equipment.This section extends through December 31, 2023, the authority for the FAA's UAS remote detection and identification pilot program. Under the program, the FAA uses available remote detection or identification technologies for safety oversight, including enforcement actions against operators of UAS that are not in compliance with federal aviation laws and regulations.This section extends through December 31, 2023, the authority for the Aviation Consumer Protection Advisory Committee, which advises DOT in carrying out activities relating to airline customer service improvements.This section extends through December 31, 2023, the requirement that the Aviation Consumer Advocate at DOT submit an annual report to Congress summarizing aviation consumer complaints and recommendations.This section extends through December 31, 2023, the authority for the FAA Air Carrier Access Act Advisory Committee to address the needs of passengers with disabilities.This section extends through December 31, 2023, the authority for an FAA pilot program to provide air traffic control services on a preferential basis to aircraft equipped with certain Next Generation Air Transportation System (NextGen) avionics.This section extends through December 31, 2023, the pilot program that allows AIP funds to be used for activities related to the redevelopment of airport properties.(Sec. 2203) This section reauthorizes through December 31, 2023, FAA salaries, operations, and maintenance.Further, this section extends through December 31, 2023, DOT's authority to reduce the FAA's expenses for non-safety-related activities if DOT determines that the funding levels are insufficient to meet the FAA's authorized salary, operations and maintenance expenses.(Sec. 2204) This section extends through December 31, 2023, the FAA's authority to acquire, establish, and improve air navigation facilities and equipment.(Sec. 2205) This section extends through December 31, 2023, the FAA's authority to conduct civil aviation research, engineering, and development.(Sec. 2206) This section reauthorizes through December 31, 2023, the FAA Essential Air Service Program.Further, this section reauthorizes through December 31, 2023, the Small Community Air Service Development Program, a DOT grant program designed to help small communities address air service and airfare issues.Subtitle B--Aviation Revenue Provisions(Sec. 2211) This section extends through December 31, 2023, the FAA's authority for expenditures from the Airport and Airway Trust Fund (AATF). The AATF is the primary funding source for all major FAA accounts that fund federal aviation programs, with the remainder coming from general fund appropriations.(Sec. 2212) This section extends through December 31, 2023, the authority for the FAA to collect various taxes and fees to fund the AATF, including taxes on aviation fuel and airline tickets.Subtitle C--Expiring Counter-UAS 12 Authorities(Sec. 2221) This section extends through November 18, 2023, the authority of the Department of Homeland Security and the Department of Justice to take certain actions to mitigate a credible threat to certain facilities or assets from an unmanned aircraft system (UAS). These include certain facilities that are located in the United States and identified as high-risk and a potential target for unlawful UAS activity.TITLE III--HEALTH AND HUMAN SERVICESSubtitle A--Animal Drug and Animal Generic Drug User Fee AmendmentsThis subtitle reauthorizes the Food and Drug Administration (FDA) to collect fees for brand-name and generic animal drug applications through FY2028. Animal drugs are drugs that are intended for animals other than humans (e.g., pets and livestock). Animal drugs must be approved by the FDA before they may be offered on the commercial market. The FDA is authorized to collect fees for animal drug applications in order to support its regulatory activities; this authority currently expires at the end of FY2023.Chapter 1--Fees Relating to Animal DrugsAnimal Drug User Fee Amendments of 2023(Sec. 2302) This section updates statutory references to mutual agreements between the United States and the European Union regarding animal drug manufacturing to include specific mutual recognition agreements between the United States and the European Union and between the United States and the United Kingdom.(Sec. 2303) This section reauthorizes the FDA to collect fees for brand-name animal drug applications through FY2028 and makes related updates to fee calculations.(Sec. 2304) This section updates FDA reporting requirements to reflect the reauthorization.(Sec. 2305) This section provides that current law continues to apply with respect to fees for brand-name animal drug applications that were accepted by the FDA before October 1, 2023.(Sec. 2306) This section provides that the fee changes apply to brand-name animal drug applications that are received on or after October 1, 2023.(Sec. 2307) This section provides that the fee authorizations expire on October 1, 2028, and that related reporting requirements expire on January 31, 2029.Chapter 2--Fees Relating to Generic Animal DrugsAnimal Generic Drug User Fee Amendments of 2023(Sec. 2312) This section reauthorizes the FDA to collect fees for generic animal drug applications through FY2028 and makes related updates to fee calculations. It also provides for a specific fee for requests to establish generic investigational new animal drug files and requires other application fees to be adjusted accordingly.(Sec. 2313) This section updates FDA reporting requirements to reflect the reauthorization.(Sec. 2314) This section provides that current law continues to apply with respect to fees for generic animal drug applications that were accepted by the FDA before October 1, 2023.(Sec. 2315) This section provides that the fee changes apply to generic animal drug applications that are received on or after October 1, 2023.(Sec. 2316) This section provides that the fee authorizations expire on October 1, 2028, and that related reporting requirements expire on January 31, 2029.Subtitle B--Public Health Extenders(Sec. 2321) This section extends through November 17, 2023, funding for the Teaching Health Center Graduate Medical Education Program, the Community Health Center Fund, and the National Health Services Corps. (The program supports education and training of medical students in primary care residency programs in community-based ambulatory patient care centers. The fund supports (1) grants for outpatient health care facilities that serve medically underserved populations; and (2) the National Health Service Corps, which provides scholarships and student loan repayment awards to health care providers who agree to work in areas with health care provider shortages.)(Sec. 2322) This section extends funding through November 17, 2023, for the Special Diabetes Program for Type I Diabetes and the Special Diabetes Program for Indians. (The Special Diabetes Program for Type I Diabetes supports research on the prevention and cure of Type I diabetes, and the Special Diabetes Program for Indians supports diabetes treatment and prevention for tribal populations.)Subtitle C--Necessary Authorities to Respond to Threats(Sec. 2331) This section extends through November 17, 2023, the authority of the Department of Health and Human Services (HHS) to directly appoint candidates to positions within the National Disaster Medical System if HHS determines the number of personnel in the system is insufficient to address a public health emergency or potential public health emergency. Currently, the authorization expires on September 30, 2023.The National Disaster Medical System is a partnership between HHS, the Department of Defense, and other federal departments that responds to public health and other emergencies, including by deploying medical response teams.(Sec. 2332) This section extends through November 17, 2023, the authority that allows states and tribes to request the temporary reassignment of state and local health department personnel who are funded through certain federal programs to immediately address a public health emergency. Currently, the authorization expires on September 30, 2023.(Sec. 2333) This section extends through November 17, 2023, the National Advisory Committee on Children and Disasters, the National Advisory Committee on Seniors and Disasters, and the National Advisory Committee on Individuals with Disabilities and Disasters. Currently, these committees terminate on September 30, 2023.Subtitle D--Medicaid(Sec. 2341) This section delays reductions to Medicaid disproportionate-share hospital (DSH) allotments until November 18, 2023. (DSHs are hospitals that receive additional payments under Medicaid for treating a large share of low-income patients.)(Sec. 2342) This section reduces the amount of funding available to the Medicaid Improvement Fund for activities relating to mechanized claims systems beginning in FY2028.Subtitle E--Human Services(Sec. 2351) This section funds through November 17, 2023, programs that support child welfare services and activities. Specifically, it funds the (1) Stephanie Tubbs Jones Child Welfare Service Program, which provides grants to states and Indian tribes to support preventive interventions and other activities to keep families together; and (2) the MaryLee Allen Promoting Safe and Stable Families Program, which supports efforts to prevent the unnecessary separation of children from their families, improve quality of care and services to children and their families, and ensure permanent living arrangements for children (e.g., parental reunification or adoption).(Sec. 2352) This section extends funding through November 17, 2023, for the Sexual Risk Avoidance Education Program. This program supports projects to implement sexual risk avoidance education that teaches participants to voluntarily refrain from nonmarital sexual activities.(Sec. 2353) This section extends funding through November 17, 2023, for the Personal Responsibility Education Program. This program provides grants to states to educate young people about abstinence and contraception for prevention of pregnancy and sexually transmitted infections. The program also supports pregnant and parenting youth.TITLE IV-- BUDGETARY EFFECTS(Sec. 2401) This section exempts the budgetary effects of this division from (1) the Statutory Pay-As-You-Go Act of 2010 (PAYGO Act), (2) the Senate PAYGO rule, and (3) certain budget scorekeeping rules.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 4368",
            "First Name": "Jasmine Crockett",
            "Vote": "Nay",
            "Bill Number.1": "H.R. 4368",
            "Bill Name": "Agriculture, Rural Development, Food and Drug Administration, and Related Agencies Appropriations Act, 2024",
            "Summary": "This bill provides FY2024 appropriations for the Department of Agriculture (USDA), the Food and Drug Administration, and related agencies.The bill provides appropriations to USDA for agricultural programs, including the Office of the Secretary, Executive Operations, the Economic Research Service, the National Agricultural Statistics Service, the Agricultural Research Service, the National Institute of Food and Agriculture, the Animal and Plant Health Inspection Service, the Agricultural Marketing Service, and the Food Safety and Inspection Service. The bill also provides appropriations to USDA for farm production and conservation programs, including the Farm Production and Conservation Business Center, the Farm Service Agency, the Risk Management Agency, and the Natural Resources Conservation Service. The bill provides appropriations to the Federal Crop Insurance Corporation Fund and the Commodity Credit Corporation Fund.For USDA rural development programs, the bill includes appropriations forSalaries and Expenses, the Rural Housing Service, the Rural Business-Cooperative Service, and the Rural Utilities Service. The bill provides appropriations to the Food and Nutrition Service for Child Nutrition Programs; the Special Supplemental Nutrition Program for Women, Infants, and Children (WIC); the Supplemental Nutrition Assistance Program (SNAP); the Commodity Assistance Program; and Nutrition Programs Administration. The bill provides appropriations to the Foreign Agricultural Service for (1) Food for Peace Title II Grants, and (2) McGovern-Dole International Food for Education and Child Nutrition Program Grants.The bill also provides appropriations for the Food and Drug Administration, the Commodity Futures Trading Commission, and the Farm Credit Administration. Additionally, the bill sets forth requirements and restrictions for using funds provided by this and other appropriations acts.",
            "Status": "Failed"
        },
        {
            "Bill Number": "H.R. 4365",
            "First Name": "Jasmine Crockett",
            "Vote": "Nay",
            "Bill Number.1": "H.R. 4365",
            "Bill Name": "Department of Defense Appropriations Act, 2024",
            "Summary": "This bill provides FY2024 appropriations to the Department of Defense (DOD) for military activities.(The bill excludes military construction, military family housing, civil works projects of the Army Corps of Engineers, and nuclear warheads, which are all included in other appropriations bills.)Within the DOD budget, the bill provides appropriations for Military Personnel; Operation and Maintenance; Procurement; Research, Development, Test and Evaluation; and Revolving and Management Funds. The bill provides appropriations for Other Department of Defense Programs, including the Defense Health Program, Chemical Agents and Munitions Destruction, Drug Interdiction and Counter-Drug Activities, and the Office of the Inspector General. In addition, the bill provides appropriations for Related Agencies, including (1) the Central Intelligence Agency Retirement and Disability System Fund, and (2) the Intelligence Community Management Account.The bill also sets forth requirements and restrictions for using funds provided by this and other appropriations acts.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 4367",
            "First Name": "Jasmine Crockett",
            "Vote": "Nay",
            "Bill Number.1": "H.R. 4367",
            "Bill Name": "Department of Homeland Security Appropriations Act, 2024",
            "Summary": "This bill provides FY2024 appropriations for the Department of Homeland Security (DHS).Specifically, the bill provides appropriations to DHS for Departmental Management, Intelligence, Situational Awareness, and Oversight, including the Office of the Secretary and Executive Management; the Management Directorate; Intelligence, Analysis, and Situational Awareness; and the Office of the Inspector General. In addition, the bill provides appropriations for Security, Enforcement, and Investigations, including U.S. Customs and Border Protection, U.S. Immigration and Customs Enforcement, the Transportation Security Administration, the U.S. Coast Guard, and the U.S. Secret Service. The bill provides appropriations for Protection, Preparedness, Response, and Recovery, including the Cybersecurity and Infrastructure Security Agency, and the Federal Emergency Management Agency (FEMA). The bill provides appropriations for Research, Development, Training, and Services, including U.S. Citizenship and Immigration Services, the Federal Law Enforcement Training Centers, the Science and Technology Directorate, and the Countering Weapons of Mass Destruction Office. The bill also sets forth requirements and restrictions for using funds provided by this and other appropriations acts.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 4665",
            "First Name": "Jasmine Crockett",
            "Vote": "Nay",
            "Bill Number.1": "H.R. 4665",
            "Bill Name": "Department of State, Foreign Operations, and Related Programs Appropriations Act, 2024",
            "Summary": "This bill provides FY2024 appropriations for the Department of State, foreign operations, and related programs.The bill provides appropriations to the State Department for Administration of Foreign Affairs, International Organizations, and International Commissions. The bill provides appropriations for related agencies and programs, including the U.S. Agency for Global Media, the Asia Foundation, the U.S. Institute of Peace, the Center for Middle Eastern-Western Dialogue Trust Fund, the Eisenhower Exchange Fellowship Program, the Israeli Arab Scholarship Program, the East-West Center, and the National Endowment for Democracy. The bill provides appropriations for other commissions, including the Commission for the Preservation of America's Heritage Abroad, the U.S. Commission on International Religious Freedom, the Commission on Security and Cooperation in Europe, the Congressional-Executive Commission on the People's Republic of China, and the U.S.-China Economic and Security Review Commission. The bill provides appropriations to the U.S. Agency for International Development (USAID), the State Department and the President for International Security Assistance, and International Financial Institutions for Multilateral Assistance. The bill provides appropriations for bilateral economic assistance, including programs and activities conducted by the President; the State Department; Independent Agencies, including the Peace Corps, the Millennium Challenge Corporation, the Inter-American Foundation, and the U.S. African Development Foundation; and the Department of the Treasury. The bill provides appropriations for export and investment assistance to the Export-Import Bank of the United States, the U.S. International Development Finance Corporation, and the U.S. Trade and Development Agency. The bill sets forth requirements and restrictions for using funds provided by this and other appropriations acts.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 5110",
            "First Name": "Jasmine Crockett",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 5110",
            "Bill Name": "Protecting Hunting Heritage and Education Act",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 4366",
            "First Name": "Jasmine Crockett",
            "Vote": "Nay",
            "Bill Number.1": "H.R. 4366",
            "Bill Name": "Consolidated Appropriations Act, 2024",
            "Summary": "This bill provides FY2024 appropriations for several federal departments and agencies. It also extends various expiring programs and authorities, including several public health programs.Specifically, the bill includes 6 of the 12 regular FY2024 appropriations bills: the Military Construction, Veterans Affairs, and Related Agencies Appropriations Act, 2024; the Agriculture, Rural Development, Food and Drug Administration, and Related Agencies Appropriations Act, 2024; the Commerce, Justice, Science, and Related Agencies Appropriations Act, 2024; the Energy and Water Development and Related Agencies Appropriations Act, 2024; the Department of the Interior, Environment, and Related Agencies Appropriations Act, 2024; and the Transportation, Housing and Urban Development, and Related Agencies Appropriations Act, 2024. The departments, agencies, and activities funded in the bill include Department of Defense military construction and family housing activities, the Department of Veterans Affairs, the Department of Agriculture, the Food and Drug Administration, the Department of Commerce, the Department of Justice, the science agencies, the Department of Energy, the U.S. Army Corps of Engineers, the Department of the Interior, the Environmental Protection Agency, the Department of Transportation, the Department of Housing and Urban Development, and several related and independent agencies. In addition, the bill includes several provisions that extend or otherwise modify various programs and authorities, including several public health programs.The bill also modifies the Compacts of Free Association that govern the relationship between the United States and the Republic of the Marshall Islands, the Federated States of Micronesia, and the Republic of Palau.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 2670",
            "First Name": "Jasmine Crockett",
            "Vote": "Nay",
            "Bill Number.1": "H.R. 2670",
            "Bill Name": "National Defense Authorization Act for Fiscal Year 2024",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1096",
            "First Name": "Jasmine Crockett",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1096",
            "Bill Name": "250th Anniversary of the United States Marine Corps Commemorative Coin Act",
            "Summary": "This bill directs the Department of the Treasury to mint and issue not more than 50,000 $5 gold coins, 400,000 $1 silver coins, and 750,000 half-dollar clad coins emblematic of the 250th anniversary of the United States Marine Corps.All surcharges received by Treasury from the sale of such coins must be paid to the Marine Corps Heritage Foundation and shall only be used for the purposes of supporting the mission of the Marine Corps Heritage Center.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3672",
            "First Name": "Jasmine Crockett",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3672",
            "Bill Name": "To designate the clinic of the Department of Veterans Affairs in Indian River, Michigan, as the \\u201cPfc. Justin T. Paton Department of Veterans Affairs Clinic\\u201d.",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3746",
            "First Name": "Jasmine Crockett",
            "Vote": "No",
            "Bill Number.1": "H.R. 3746",
            "Bill Name": "Fiscal Responsibility Act of 2023",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1734",
            "First Name": "Jasmine Crockett",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1734",
            "Bill Name": "TRANQ Research Act of 2023",
            "Summary": "This bill requires the National Institute of Standards and Technology (NIST) to support research and other activities related to identifying xylazine (a compound used in veterinary medicine as a nonopioid tranquilizer), novel synthetic opioids, and other new psychoactive substances.In particular, NIST must support basic measurement science and research; near-real time spectrometry capabilities (i.e., a technique for rapidly identifying the chemical composition of a substance); strategies and voluntary best practices for handling, transporting, and analyzing such substances; and collaboration with other government agencies, institutions of higher education, and the private sector to enhance relevant narcotic and opioid detection and analysis capabilities. Additionally, the Government Accountability Office must conduct a study on the capabilities of the federal government to detect, identify, and otherwise respond to threats of new psychoactive substances, such as xylazine.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1226",
            "First Name": "Jasmine Crockett",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1226",
            "Bill Name": "Wounded Warrior Access Act",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 346",
            "First Name": "Jasmine Crockett",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 346",
            "Bill Name": "NOTAM Improvement Act of 2023",
            "Summary": "This bill directs the Federal Aviation Administration (FAA) to establish the FAA Task Force on NOTAM (notice to air missions required by international or domestic law) Improvement and requires the FAA to implement a federal NOTAM system. A NOTAM is a notice containing information essential to personnel concerned with flight operations but not known far enough in advance to be publicized by other means. It states the abnormal status of a component of the National Airspace System.Specifically, the task force must (1) review existing methods for publishing NOTAMs and flight operations information for pilots; (2) review regulations, policies, systems, and international standards relating to NOTAMs, including their content and presentation to pilots; (3) evaluate and determine best practices to organize, prioritize, and present flight operations information in a manner that optimizes pilot review and retention of relevant information; (4) provide recommendations to improve the publication and delivery of NOTAM information; and (5) report to Congress on its reviews and evaluations.By September 30, 2024, the FAA must (1) complete implementation of a federal NOTAM system and implement a back-up system, and (2) brief Congress on a plan to enhance information delivery through this federal system to promote further global harmonization and provide users of the National Airspace System a consistent format for domestic and international operations.",
            "Status": "Enacted"
        }
    ],
    "CosponsoredBills": [
        {
            "Bill Number": "H.R. 1150",
            "First Name": "Jasmine  Crockett",
            "Last Name": "cosponsor",
            "Role": "H.R. 1150",
            "Bill Name": "John Lewis Civil Rights Fellowship Act of 2023",
            "Subject Areas": "International Affairs, Area studies and international education, Congressional oversight, Congressional tributes, Employment and training programs, Higher education, Human rights, International exchange and broadcasting",
            "Summary": "This bill establishes the John Lewis Civil Rights Fellowship Program within the J. William Fulbright Educational Exchange Program (commonly referred to as the Fulbright Program).The fellowship program shall honor the legacy of Representative John Lewis and advance U.S. foreign policy priorities by promoting studies, research, and international exchange in the subject of nonviolent civil rights movements around the world.The Fulbright Foreign Scholarship Board shall annually select qualified individuals to serve as fellows in the fellowship program. The Bureau of Educational and Cultural Affairs may determine the number of fellows for each year, with at least 25 fellows each year whenever feasible. Each fellow shall (1) work in an internship or research position with an approved organization in a country with an operational Fulbright U.S. Student Program, and (2) receive an award sufficient to cover the fellow's reasonable costs during the fellowship period and certain travel and lodging expenses related to the program."
        }
    ]
}