{
    "Name": "Marjorie  Greene",
    "CosponsoredBills": [
        {
            "Bill Number": "H.J.Res. 7",
            "First Name": "Marjorie  Greene",
            "Last Name": "cosponsor",
            "Role": "H.J.Res. 7",
            "Bill Name": "Relating to a national emergency declared by the President on March 13, 2020.",
            "Subject Areas": "Infectious and parasitic diseases, Presidents and presidential powers, Vice Presidents, War and emergency powers",
            "Summary": NaN
        },
        {
            "Bill Number": "H.J.Res. 26",
            "First Name": "Marjorie  Greene",
            "Last Name": "cosponsor",
            "Role": "H.J.Res. 26",
            "Bill Name": "Disapproving the action of the District of Columbia Council in approving the Revised Criminal Code Act of 2022.",
            "Subject Areas": "Due process and equal protection, State and local government operations, Violent crime",
            "Summary": NaN
        },
        {
            "Bill Number": "H.R. 5577 (117th)",
            "First Name": "Marjorie  Greene",
            "Last Name": "cosponsor",
            "Role": "H.R. 5577 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 3900 Crown Road Southwest in Atlanta, Georgia, as the \\u201cJohn R. Lewis Post Office Building\\u201d.",
            "Subject Areas": "Government Operations and Politics, Congressional tributes, Georgia, Government buildings, facilities, and property, Postal service",
            "Summary": "This bill designates the facility of the United States Postal Service located at 3900 Crown Road Southwest in Atlanta, Georgia, as the John R. Lewis Post Office Building."
        },
        {
            "Bill Number": "H.R. 8350 (117th)",
            "First Name": "Marjorie  Greene",
            "Last Name": "cosponsor",
            "Role": "H.R. 8350 (117th)",
            "Bill Name": "Senator Johnny Isakson VA Regional Office Act of 2022",
            "Subject Areas": "Armed Forces and National Security",
            "Summary": "This bill designates the Department of Veterans Affairs Atlanta Regional Office in Georgia as the Senator Johnny Isakson Department of Veterans Affairs Atlanta Regional Office or the Isakson VA Atlanta Regional Office."
        },
        {
            "Bill Number": "H.R. 3475 (117th)",
            "First Name": "Marjorie  Greene",
            "Last Name": "cosponsor",
            "Role": "H.R. 3475 (117th)",
            "Bill Name": "To name the Department of Veterans Affairs community-based outpatient clinic in Columbus, Georgia, as the Robert S. Poydasheff VA Clinic.",
            "Subject Areas": "Armed Forces and National Security, Congressional tributes, Department of Veterans Affairs, Georgia, Government buildings, facilities, and property, Health facilities and institutions, Home and outpatient care, Military personnel and dependents, Veterans' medical care",
            "Summary": "This bill designates the community-based outpatient clinic of the Department of Veterans Affairs in Columbus, Georgia, as the Robert S. Poydasheff VA Clinic."
        },
        {
            "Bill Number": "H.R. 5142 (117th)",
            "First Name": "Marjorie  Greene",
            "Last Name": "cosponsor",
            "Role": "H.R. 5142 (117th)",
            "Bill Name": "To award posthumously a Congressional Gold Medal, in commemoration to the servicemembers who perished in Afghanistan on August 26, 2021, during the evacuation of citizens of the United States and Afghan allies at Hamid Karzai Internati",
            "Subject Areas": "Armed Forces and National Security, International Affairs, Afghanistan, Asia, Conflicts and wars, Congressional tributes, Emergency planning and evacuation, Military operations and strategy, Military personnel and dependents, Museums, exhibitions, cultural centers, Smithsonian Institution, Terrorism",
            "Summary": "This bill posthumously provides for the award of a Congressional Gold Medal in commemoration of the 13 service members who died on August 26, 2021, while stationed at Hamid Karzai International Airport in Afghanistan."
        },
        {
            "Bill Number": "H.R. 1448 (117th)",
            "First Name": "Marjorie  Greene",
            "Last Name": "cosponsor",
            "Role": "H.R. 1448 (117th)",
            "Bill Name": "PAWS for Veterans Therapy Act",
            "Subject Areas": "Armed Forces and National Security, Animal protection and human-animal relationships, Congressional oversight, Disability assistance, Government information and archives, Government studies and investigations, Health programs administration and funding, Mammals, Mental health, Neurological disorders, Service animals, Veterans' education, employment, rehabilitation, Veterans' medical care",
            "Summary": "This bill implements a program and a policy related to service dog therapy for veterans. Specifically, the bill requires the Department of Veterans Affairs (VA) to implement a five-year pilot program to provide canine training to eligible veterans diagnosed with post-traumatic stress disorder as an element of a complementary and integrative health program. Eligible veterans are those who are enrolled in the VA health care system and have been recommended for participation by a qualified mental health care provider or clinical team.The VA must seek to enter agreements containing specified elements with accredited nongovernmental entities that have demonstrated ability to provide canine training.Veterans who participate in the program are authorized to adopt the dog they assisted in training if their health provider determines it is in the best interest of the veteran.The VA must establish processes to document and track the progress of participating veterans with respect to health benefits and improvements. The Government Accountability Office must brief Congress and submit a report on the program.The bill also authorizes the VA to provide service dogs to veterans with mental illnesses, regardless of whether they have a mobility impairment."
        },
        {
            "Bill Number": "H.R. 6244 (117th)",
            "First Name": "Marjorie  Greene",
            "Last Name": "cosponsor",
            "Role": "H.R. 6244 (117th)",
            "Bill Name": "Max Cleland VA Medical Center Act",
            "Subject Areas": "Armed Forces and National Security, Congressional tributes, Department of Veterans Affairs, Georgia, Government buildings, facilities, and property, Health facilities and institutions, Veterans' medical care",
            "Summary": "This bill designates the Department of Veterans Affairs medical center in Atlanta, Georgia, as the Joseph Maxwell Cleland Atlanta Department of Veterans Affairs Medical Center or the Joseph Maxwell Cleland Atlanta VA Medical Center."
        },
        {
            "Bill Number": "H.R. 3901 (117th)",
            "First Name": "Marjorie  Greene",
            "Last Name": "cosponsor",
            "Role": "H.R. 3901 (117th)",
            "Bill Name": "To award four congressional gold medals to the United States Capitol Police and those who protect the U.S. Capitol.",
            "Subject Areas": "Congress",
            "Summary": "This bill provides for the award of Congressional Gold Medals to the U.S. Capitol Police and the Metropolitan Police Department of the District of Columbia in recognition of the law enforcement agencies that protect the U.S. Capitol."
        }
    ]
}