{
    "Name": "Robert Aderholt",
    "Profile": {
        "Public Office": {
            "Member of the U.S. House of Representativesfrom Alabama's 4th district": {
                "Incumbent": "Incumbent",
                "Assumed office": "January 3, 1997",
                "Preceded by": "Tom Bevill"
            }
        },
        "Personal Details": {
            "Personal details": {
                "Born": "Robert Brown Aderholt, (,1965-07-22,) ,July 22, 1965, (age 57),Haleyville,, ,Alabama,, U.S.",
                "Political party": "Republican",
                "Spouse": "Caroline McDonald, ,,(,m., 1994),",
                "Children": "2",
                "Education": "University of North Alabama,Birmingham–Southern College, (,BA,),Samford University, (,JD,)",
                "Signature": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/be/Robert_Aderholt%27s_signature.jpg/128px-Robert_Aderholt%27s_signature.jpg",
                "Website": "House website"
            }
        }
    },
    "UnusedVotingRecords": [],
    "CosponsoredBills": [
        {
            "Bill Number": "H.R. 2810 (117th)",
            "First Name": "Robert  Aderholt",
            "Last Name": "cosponsor",
            "Role": "H.R. 2810 (117th)",
            "Bill Name": "Build America, Buy America Act",
            "Subject Areas": "Government Operations and Politics, Administrative law and regulatory procedures, Aviation and airports, Buy American requirements, Congressional oversight, Dams and canals, Electric power generation and transmission, Government buildings, facilities, and property, Government information and archives, Infrastructure development, Internet and video services, Manufacturing, Metals, Navigation, waterways, harbors, Office of Management and Budget (OMB), Public contracts and procurement, Public transit, Public utilities and utility rates, Railroads, Roads and highways, Transportation programs funding, Water resources funding, Water use and supply",
            "Summary": "This bill requires federal infrastructure programs to provide for the use of materials produced in the United States.Each federal agency must submit to the Office of Management and Budget and to Congress a report that identifies each federal financial assistance program for infrastructure administered by the agency and (1) identify domestic content procurement preferences applicable to the assistance, (2) assess the applicability of such requirements, (3) provide details on any applicable domestic content procurement preference requirement, and (4) include a description of the type of infrastructure projects that receive funding under the program.Each agency shall ensure that none of the funds made available for such a program may be used for a project unless all of the iron, steel, and manufactured products used in the project are produced in the United States, subject to waivers where inconsistent with the public interest, where not produced in sufficient quantities or satisfactory quality, or where such inclusion will increase the cost of the project by more than 25%."
        },
        {
            "Bill Number": "H.R. 1012 (117th)",
            "First Name": "Robert  Aderholt",
            "Last Name": "cosponsor",
            "Role": "H.R. 1012 (117th)",
            "Bill Name": "\\u2018Six Triple Eight\\u2019 Congressional Gold Medal Act of 2021",
            "Subject Areas": "Military history, Military personnel and dependents, Minority employment, Museums, exhibitions, cultural centers, Postal service, Smithsonian Institution, Women's employment",
            "Summary": "This bill directs the Speaker of the House of Representatives and the President pro tempore of the Senate to arrange for the award of a Congressional Gold Medal in honor of the women of the 6888th Central Postal Directory Battalion (commonly known as the Six Triple Eight) in recognition of their pioneering military service, devotion to duty, and contributions to increase the morale of personnel stationed in the European theater of operations during World War II. The medal shall be given to the Smithsonian Institution and made available for display and research."
        },
        {
            "Bill Number": "H.R. 707 (117th)",
            "First Name": "Robert  Aderholt",
            "Last Name": "cosponsor",
            "Role": "H.R. 707 (117th)",
            "Bill Name": "Ghost Army Congressional Gold Medal Act",
            "Subject Areas": "Military operations and strategy, Military personnel and dependents, Museums, exhibitions, cultural centers, Smithsonian Institution",
            "Summary": "This bill directs the Speaker of the House of Representatives and the President pro tempore of the Senate to award a Congressional Gold Medal to the 23rd Headquarters Special Troops and the 3133rd Signal Service Company, known as the Ghost Army, collectively, in recognition of its service during World War II."
        },
        {
            "Bill Number": "H.R. 3537 (117th)",
            "First Name": "Robert  Aderholt",
            "Last Name": "cosponsor",
            "Role": "H.R. 3537 (117th)",
            "Bill Name": "Accelerating Access to Critical Therapies for ALS Act",
            "Subject Areas": "Health, Drug safety, medical device, and laboratory regulation, Drug therapy, Government information and archives, Health care coverage and access, Health programs administration and funding, Health promotion and preventive care, Higher education, Medical research, Medical tests and diagnostic methods, Neurological disorders, Prescription drugs, Public-private cooperation, Research administration and funding, Research and development, Social work, volunteer service, charitable organizations",
            "Summary": "This bill establishes grant programs to address neurodegenerative diseases, such as amyotrophic lateral sclerosis (also known as ALS or Lou Gehrig's disease), and contains other related provisions.The Department of Health and Human Services (HHS) shall award grants to eligible entities for scientific research utilizing data from expanded access to investigational ALS treatments for individuals who are not otherwise eligible for clinical trials. The Food and Drug Administration (FDA) shall award grants to public and private entities to cover the costs of research and development of drugs that diagnose or treat ALS and other rare neurodegenerative diseases.HHS shall also establish the Public-Private Partnership for Neurodegenerative Diseases between the National Institutes of Health, the FDA, and at least one eligible entity (generally, an institution of higher education or a nonprofit organization). The partnership shall support the development and regulatory review of drugs that address ALS and other rare neurodegenerative diseases.The FDA shall publish on its website a five-year action plan for fostering the development of drugs that improve or extend the lives of people living with rare neurodegenerative diseases.The Government Accountability Office must report to Congress about the grants provided under this bill, including an analysis of the impact of such grants on research and development of treatments for ALS."
        },
        {
            "Bill Number": "H.R. 3577 (117th)",
            "First Name": "Robert  Aderholt",
            "Last Name": "cosponsor",
            "Role": "H.R. 3577 (117th)",
            "Bill Name": "United States Army Rangers Veterans of World War II Congressional Gold Medal Act",
            "Subject Areas": "Armed Forces and National Security, Conflicts and wars, Congressional tributes, Military history, Museums, exhibitions, cultural centers, Smithsonian Institution, Veterans' organizations and recognition",
            "Summary": "This bill provides for the award of a single Congressional Gold Medal to the U.S. Army Rangers Veterans of World War II in recognition of their dedicated service during World War II."
        },
        {
            "Bill Number": "H.R. 4498 (117th)",
            "First Name": "Robert  Aderholt",
            "Last Name": "cosponsor",
            "Role": "H.R. 4498 (117th)",
            "Bill Name": "To make emergency appropriations to the National Guard.",
            "Subject Areas": "Armed Forces and National Security, Appropriations, Assault and harassment offenses, Civil disturbances, Crimes against property, Defense spending, Department of Defense, Executive agency funding and structure, Government buildings, facilities, and property, Military personnel and dependents, National Guard and reserves, Protest and dissent, Subversive activities, Terrorism, U.S. Capitol, Violent crime",
            "Summary": "This bill provides supplemental FY2021 appropriations to the National Guard for its response to the events at the U.S. Capitol on January 6, 2021. The bill designates the funding as emergency spending, which is exempt from discretionary spending limits."
        },
        {
            "Bill Number": "H.R. 3642 (117th)",
            "First Name": "Robert  Aderholt",
            "Last Name": "cosponsor",
            "Role": "H.R. 3642 (117th)",
            "Bill Name": "Harlem Hellfighters Congressional Gold Medal Act",
            "Subject Areas": "Armed Forces and National Security, Conflicts and wars, Congressional tributes, Military history, Military personnel and dependents, Museums, exhibitions, cultural centers, New York State, Racial and ethnic relations, Smithsonian Institution, Veterans' organizations and recognition",
            "Summary": "This bill provides for the award of a Congressional Gold Medal to the 369th Infantry Regiment, commonly known as the Harlem Hellfighters, in recognition of their bravery and outstanding service during World War I."
        },
        {
            "Bill Number": "H.R. 1448 (117th)",
            "First Name": "Robert  Aderholt",
            "Last Name": "cosponsor",
            "Role": "H.R. 1448 (117th)",
            "Bill Name": "PAWS for Veterans Therapy Act",
            "Subject Areas": "Armed Forces and National Security, Animal protection and human-animal relationships, Congressional oversight, Disability assistance, Government information and archives, Government studies and investigations, Health programs administration and funding, Mammals, Mental health, Neurological disorders, Service animals, Veterans' education, employment, rehabilitation, Veterans' medical care",
            "Summary": "This bill implements a program and a policy related to service dog therapy for veterans. Specifically, the bill requires the Department of Veterans Affairs (VA) to implement a five-year pilot program to provide canine training to eligible veterans diagnosed with post-traumatic stress disorder as an element of a complementary and integrative health program. Eligible veterans are those who are enrolled in the VA health care system and have been recommended for participation by a qualified mental health care provider or clinical team.The VA must seek to enter agreements containing specified elements with accredited nongovernmental entities that have demonstrated ability to provide canine training.Veterans who participate in the program are authorized to adopt the dog they assisted in training if their health provider determines it is in the best interest of the veteran.The VA must establish processes to document and track the progress of participating veterans with respect to health benefits and improvements. The Government Accountability Office must brief Congress and submit a report on the program.The bill also authorizes the VA to provide service dogs to veterans with mental illnesses, regardless of whether they have a mobility impairment."
        },
        {
            "Bill Number": "H.R. 1842 (117th)",
            "First Name": "Robert  Aderholt",
            "Last Name": "cosponsor",
            "Role": "H.R. 1842 (117th)",
            "Bill Name": "Harriet Tubman Bicentennial Commemorative Coin Act",
            "Subject Areas": "U.S. history, Women's rights",
            "Summary": "This bill directs the Department of the Treasury to mint and issue 50,000 $5 gold coins, 400,000 $1 silver coins, and 750,000 half-dollar clad coins emblematic of the legacy of Harriet Tubman as an abolitionist.The Secretary may issue coins under this bill only during the period of January 1, 2024, through December 31, 2024.All surcharges received by Treasury from the sale of such coins must be paid equally to the National Underground Railroad Freedom Center in Cincinnati, Ohio, and The Harriet Tubman Home, Inc. in Auburn, New York, for the purpose of accomplishing and advancing their missions."
        },
        {
            "Bill Number": "H.R. 8656 (117th)",
            "First Name": "Robert  Aderholt",
            "Last Name": "cosponsor",
            "Role": "H.R. 8656 (117th)",
            "Bill Name": "To designate the clinic of the Department of Veterans Affairs in Mishawaka, Indiana, as the \\u201cJackie Walorski VA Clinic\\u201d.",
            "Subject Areas": "Armed Forces and National Security, Congressional tributes, Department of Veterans Affairs, Government buildings, facilities, and property, Health facilities and institutions, Indiana, Veterans' medical care",
            "Summary": NaN
        },
        {
            "Bill Number": "H.R. 5577 (117th)",
            "First Name": "Robert  Aderholt",
            "Last Name": "cosponsor",
            "Role": "H.R. 5577 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 3900 Crown Road Southwest in Atlanta, Georgia, as the \\u201cJohn R. Lewis Post Office Building\\u201d.",
            "Subject Areas": "Government Operations and Politics, Congressional tributes, Georgia, Government buildings, facilities, and property, Postal service",
            "Summary": "This bill designates the facility of the United States Postal Service located at 3900 Crown Road Southwest in Atlanta, Georgia, as the John R. Lewis Post Office Building."
        },
        {
            "Bill Number": "H.R. 3630 (117th)",
            "First Name": "Robert  Aderholt",
            "Last Name": "cosponsor",
            "Role": "H.R. 3630 (117th)",
            "Bill Name": "Lymphedema Treatment Act",
            "Subject Areas": "Health, Labor and Employment, Cardiovascular and respiratory health, Health care coverage and access, Immunology and vaccination, Medicare",
            "Summary": "This bill provides for Medicare coverage of lymphedema compression treatment items. Specifically, the bill provides for coverage of standard and custom fitted gradient compression garments and other approved items that are prescribed by a physician or other specified health care professional to treat lymphedema."
        },
        {
            "Bill Number": "H.R. 1193 (117th)",
            "First Name": "Robert  Aderholt",
            "Last Name": "cosponsor",
            "Role": "H.R. 1193 (117th)",
            "Bill Name": "Cardiovascular Advances in Research and Opportunities Legacy Act",
            "Subject Areas": "Health, Advanced technology and technological innovations, Cardiovascular and respiratory health, Government information and archives, Health information and medical records, Health programs administration and funding, Health promotion and preventive care, Health technology, devices, supplies, Medical research, Medical tests and diagnostic methods, Photography and imaging, Research administration and funding",
            "Summary": NaN
        },
        {
            "Bill Number": "H.R. 310 (117th)",
            "First Name": "Robert  Aderholt",
            "Last Name": "cosponsor",
            "Role": "H.R. 310 (117th)",
            "Bill Name": "To posthumously award the Congressional Gold Medal, collectively, to Glen Doherty, Tyrone Woods, J. Christopher Stevens, and Sean Smith, in recognition of their contributions to the Nation.",
            "Subject Areas": "Intelligence activities, surveillance, classified information, Law enforcement officers, Libya, Middle East, Terrorism, Veterans' organizations and recognition",
            "Summary": NaN
        },
        {
            "Bill Number": "H.R. 1096",
            "First Name": "Robert  Aderholt",
            "Last Name": "cosponsor",
            "Role": "H.R. 1096",
            "Bill Name": "250th Anniversary of the United States Marine Corps Commemorative Coin Act",
            "Subject Areas": "Military personnel and dependents",
            "Summary": "This bill directs the Department of the Treasury to mint and issue not more than 50,000 $5 gold coins, 400,000 $1 silver coins, and 750,000 half-dollar clad coins emblematic of the 250th anniversary of the United States Marine Corps.All surcharges received by Treasury from the sale of such coins must be paid to the Marine Corps Heritage Foundation and shall only be used for the purposes of supporting the mission of the Marine Corps Heritage Center."
        }
    ],
    "VotingRecord": []
}