{
    "Name": "Benjamin “Ben”  Sasse",
    "CosponsoredBills": [
        {
            "Bill Number": "S. 1294 (117th)",
            "First Name": "Benjamin “Ben”  Sasse",
            "Last Name": "cosponsor",
            "Role": "S. 1294 (117th)",
            "Bill Name": "Protecting American Intellectual Property Act of 2022",
            "Subject Areas": "Foreign and international banking, Foreign and international corporations, Foreign loans and debt, Foreign property, Intellectual property, Multilateral development programs, Presidents and presidential powers, Vice Presidents, Public contracts and procurement, Sanctions, Trade restrictions, Trade secrets and economic espionage, U.S. and foreign investments, Visas and passports, War and emergency powers",
            "Summary": "This bill imposes sanctions on certain foreign individuals and entities involved in the theft of trade secrets belonging to a U.S. individual or entity.The President shall periodically report a list of foreign individuals and entities that have knowingly engaged in, benefited from, or assisted in the significant theft of U.S. trade secrets that materially contributed to a significant threat to U.S. national security, foreign policy, or economic health. The report shall also list foreign individuals who are chief executive officers or board members of any foreign entity engaging in such theft.The President shall impose (1) property- and visa-blocking sanctions on individuals named in the report; and (2) property- or export-blocking sanctions, including denial of certain financial assistance, on entities named in the report."
        },
        {
            "Bill Number": "S. 1872 (117th)",
            "First Name": "Benjamin “Ben”  Sasse",
            "Last Name": "cosponsor",
            "Role": "S. 1872 (117th)",
            "Bill Name": "United States Army Rangers Veterans of World War II Congressional Gold Medal Act",
            "Subject Areas": "Museums, exhibitions, cultural centers, Smithsonian Institution, Veterans' organizations and recognition",
            "Summary": "This bill provides for the award of a single Congressional Gold Medal to the U.S. Army Rangers Veterans of World War II in recognition of their dedicated service during World War II."
        },
        {
            "Bill Number": "S. 2993 (117th)",
            "First Name": "Benjamin “Ben”  Sasse",
            "Last Name": "cosponsor",
            "Role": "S. 2993 (117th)",
            "Bill Name": "CISA Cyber Exercise Act",
            "Subject Areas": "Emergency planning and evacuation, Government studies and investigations, Homeland security, Infrastructure development, Intergovernmental relations, State and local government operations",
            "Summary": "This bill establishes the National Cyber Exercise Program to evaluate the National Cyber Incident Response Plan and related plans and strategies. (The National Cyber Incident Response Plan outlines the roles and responsibilities, capabilities, and coordinating structures that support how the United States responds to and recovers from significant cyber incidents posing risks to critical infrastructure.)Based on current risk assessments, the exercise program shall be designed to (1) simulate partial or complete incapacitation of a government or critical infrastructure network resulting from a cyber incident, (2) provide for the systematic evaluation of cyber readiness and enhance operational understanding of the cyber incident response system and relevant information sharing agreements, and (3) develop after-action reports and plans that can incorporate lessons learned into future operations."
        },
        {
            "Bill Number": "S. 1828 (117th)",
            "First Name": "Benjamin “Ben”  Sasse",
            "Last Name": "cosponsor",
            "Role": "S. 1828 (117th)",
            "Bill Name": "HAVANA Act of 2021",
            "Subject Areas": "Diplomacy, foreign officials, Americans abroad, Government employee pay, benefits, personnel management, Intelligence activities, surveillance, classified information, Neurological disorders, Worker safety and health",
            "Summary": "This bill specifically authorizes the Central Intelligence Agency, the Department of State, and other agencies to provide payments to agency personnel who incur brain injuries from hostilities while on assignment.Specifically, the bill allows agency personnel and their families to receive payments for brain injuries that are incurred (1) during a period of assignment to a foreign or domestic duty station; (2) in connection with war, insurgency, hostile acts, terrorist activity, or other agency-designated incidents; and (3) not as the result of willful misconduct.The bill's authority applies to injuries incurred before, on, or after the date of the bill's enactment. Agencies must submit classified reports on the bill's implementation, including the number of payments made and the amount of each payment.Since 2016, some intelligence, diplomatic, and other governmental personnel have reported experiencing unusual cognitive and neurological impairments while on assignment (particularly abroad), the source of which is currently under investigation. Symptoms were first reported by personnel stationed in Cuba and have since been collectively referred to as Havana Syndrome."
        },
        {
            "Bill Number": "S. 1714 (117th)",
            "First Name": "Benjamin “Ben”  Sasse",
            "Last Name": "cosponsor",
            "Role": "S. 1714 (117th)",
            "Bill Name": "HAVANA Act of 2021",
            "Subject Areas": "Diplomacy, foreign officials, Americans abroad, Government employee pay, benefits, personnel management, Intelligence activities, surveillance, classified information, Neurological disorders, Worker safety and health",
            "Summary": "This bill specifically authorizes the Central Intelligence Agency, the Department of State, and other agencies to provide payments to agency personnel who incur brain injuries from hostilities while on assignment.Specifically, the bill allows agency personnel and their families to receive payments for brain injuries that are incurred (1) during a period of assignment to a foreign duty station; (2) in connection with war, insurgency, hostile acts, terrorist activity, or other agency-designated incidents; and (3) not as the result of willful misconduct.The bill's authority applies to injuries incurred before, on, or after the date of the bill's enactment. Agencies must submit classified reports on the bill's implementation, including the number of payments made and the amount of each payment.Since 2016, some intelligence, diplomatic, and other governmental personnel have reported experiencing unusual cognitive and neurological impairments while on assignment (particularly abroad), the source of which is currently under investigation. Symptoms were first reported by personnel stationed in Cuba and have since been collectively referred to as Havana Syndrome."
        },
        {
            "Bill Number": "S. 65 (117th)",
            "First Name": "Benjamin “Ben”  Sasse",
            "Last Name": "cosponsor",
            "Role": "S. 65 (117th)",
            "Bill Name": "Uyghur Forced Labor Prevention Act",
            "Subject Areas": "Congressional oversight, Customs enforcement, Department of Homeland Security, Detention of persons, Diplomacy, foreign officials, Americans abroad, Employment discrimination and employee rights, Foreign property, Government information and archives, Human rights, Human trafficking, International organizations and cooperation, Labor standards, Racial and ethnic relations, Religion, Sanctions, Trade restrictions, Visas and passports, War crimes, genocide, crimes against humanity",
            "Summary": "This bill imposes importation limits on goods produced using forced labor in China, especially the Xinjiang Uyghur Autonomous Region, and imposes sanctions related to such forced labor.The Department of Homeland Security and the Department of the Treasury shall report to Congress a strategy for preventing the importation of goods produced in China using forced labor. The strategy must contain certain information, including a list of entities working with the government in Xinjiang to move forced labor or Uyghurs, Kazakhs, Kyrgyz, or members of other persecuted groups out of Xinjiang.The U.S. Customs and Border Protection shall generally presume that goods produced by these entities and certain other entities, generally those sourcing material from Xinjiang or involved with Chinese government forced labor programs, are barred from importation into the United States.The bill also expands existing asset- and visa-blocking sanctions related to Xinjiang to cover foreign individuals and entities responsible for serious human rights abuses in connection with forced labor.The Department of State shall report to Congress a strategy to enhance international awareness of forced labor in Xinjiang and to address such forced labor."
        },
        {
            "Bill Number": "S. 1061 (117th)",
            "First Name": "Benjamin “Ben”  Sasse",
            "Last Name": "cosponsor",
            "Role": "S. 1061 (117th)",
            "Bill Name": "Israel Relations Normalization Act of 2021",
            "Subject Areas": "Congressional oversight, Criminal investigation, prosecution, interrogation, Diplomacy, foreign officials, Americans abroad, Economic development, Foreign aid and international relief, Foreign language and bilingual programs, Government information and archives, Health programs administration and funding, Human rights, International exchange and broadcasting, International organizations and cooperation, Iran, Israel, Middle East, Military assistance, sales, and agreements, Museums, exhibitions, cultural centers, Palestinians, Political movements and philosophies, Racial and ethnic relations, Religion, Rule of law and government transparency, Sovereignty, recognition, national governance and status, United Arab Emirates, War crimes, genocide, crimes against humanity, Water use and supply",
            "Summary": "This bill requires the Department of State to take certain actions promoting the normalization of relations between Israel, Arab states, and other relevant countries and regions.Specifically, the State Department must develop a strategy on expanding and strengthening the Abraham Accords (the term used to refer collectively to agreements between Israel and the United Arab Emirates and between Israel and Bahrain marking the public normalization of relations between the two Arab countries and Israel). The strategy must include a description of how the U.S. government will encourage further normalization of relations with Israel.The State Department must report on the status of efforts to promote normalization of relations with Israel and other countries, including information on (1) laws that punish individuals for people-to-people relations with Israelis (i.e., anti-normalization laws), and (2) instances of the use of state-owned or state-operated media outlets to promote the prosecution of citizens or residents of Arab countries calling for peace with Israel."
        },
        {
            "Bill Number": "S. 2032 (117th)",
            "First Name": "Benjamin “Ben”  Sasse",
            "Last Name": "cosponsor",
            "Role": "S. 2032 (117th)",
            "Bill Name": "Afghan Allies Protection Act of 2021",
            "Subject Areas": "Immigration, Administrative remedies, Afghanistan, Asia, Conflicts and wars, Congressional oversight, Diplomacy, foreign officials, Americans abroad, Foreign labor, Foreign language and bilingual programs, Immigrant health and welfare, Immigration status and procedures, Medical tests and diagnostic methods, Military operations and strategy, Refugees, asylum, displaced persons, Visas and passports",
            "Summary": "This bill modifies a program providing special immigrant visas to eligible citizens or nationals of Afghanistan who assisted U.S. efforts there and addresses related issues.The bill extends the program through 2023 and increases the number of visas available.An individual may become eligible for a visa after assisting U.S. efforts in Afghanistan for one year, whereas currently some individuals must have served for two years. Furthermore, for an applicant qualifying for a visa by performing duties with a NATO mission in Afghanistan, the bill eliminates a requirement that the duties performed qualify as sensitive and trusted duties.The bill removes a requirement that the individual has experienced or is facing an ongoing serious threat due to their assistance to the United States or NATO.The Department of State or the Department of Homeland Security may postpone the program's medical examination requirement. An individual who received a postponement must undergo a medical exam within 90 days of admission into the United States.The bill also expands surviving family member benefits for the Afghanistan program (and a similar program for Iraq) to a surviving spouse or child of an individual who submitted an application to the Chief of Mission that would have been approved but for the individual's death. Currently, such survivor benefits only apply if the deceased individual's petition was approved."
        },
        {
            "Bill Number": "S. 4573 (117th)",
            "First Name": "Benjamin “Ben”  Sasse",
            "Last Name": "cosponsor",
            "Role": "S. 4573 (117th)",
            "Bill Name": "Electoral Count Reform and Presidential Transition Improvement Act of 2022",
            "Subject Areas": "Constitution and constitutional amendments, Elections, voting, political campaign regulation, Federal district courts, Federal officials, Government information and archives, Intergovernmental relations, Judges, Judicial review and appeals, Legislative rules and procedure, Presidents and presidential powers, Vice Presidents, State and local government operations, Supreme Court, Voting rights",
            "Summary": "This bill would mark the biggest correction to the process of counting since John-John corrected Herry Monster on Sesame Street.Context: 2020–21Joe Biden defeated Donald Trump in the 2020 presidential election. He won by both 306–232 in the Electoral College and by 51.3% to 46.8% in the popular vote, a difference of roughly seven million votes.During the subsequent two months between the election and its official certification in Congress, numerous attempts were made to change that result: by Donald Trump himself, by his legal team, by his Republican allies in Congress, and by thousands of his supporters during the violent insurrection upon the Capitol Building on January 6, 2021 while Congress officially counted and certified the Electoral College results.None of the Trump team’s attempts proved successful.The Supreme Court rejected all of the Trump team’s legal challenges. State election officials, even Republican ones, refused to change their election certifications. Congressional Republicans’ attempts to challenge several states’ results, notably for Biden-supporting Arizona and Pennsylvania, failed. And Vice President Mike Pence refused to go along with an obscure legal theory pushed by Trump and his allies that, as vice president, he could unilaterally refuse to certify the election results.Context: 1887Most of the current rules regarding all these procedures date back more than a century, to the Electoral Count Act of 1887.The law was inspired by the convoluted and heavily-disputed presidential election of 1876.First, the candidate who received a majority of the popular vote (Democrat Samuel Tilden) failed to earn a majority of the Electoral College. Then, several states sent competing rival slates of electors to Congress — the Democrats sending a Democratic slate, the Republicans sending a Republican slate. On top of that, Congress appointed an unprecedented 15-member commission to essentially decide which candidate should be declared the winner.By only a single vote, 8–7, the commission declared in favor of Republican Rutherford B. Hayes. That single deciding vote was cast by Supreme Court Justice David Davis, who had originally been nominated 14 years earlier by Abraham Lincoln.The 1887 law was controversial even at the time; a law review article only the next year called it “very confused, almost unintelligible.” One of the law’s sentences even runs 275 words long.For about 134 years, though, it arguably worked well enough. That is, until the events of 2020–21 laid bare several potential landmines in America’s electoral system which the law wouldn’t prevent — or, in some cases, would even inadvertently create.What the bill doesThe Electoral Count Reform and Presidential Transition Improvement Act would make several policy changes:Clarify the vice president’s role. Under current law, Congress counts and certifies the Electoral College votes to make it official, during a process led by the vice president, per their role as the president of the Senate%20presides.). This bill would clarify that the vice president’s role in the Electoral College certification is purely ceremonial, and that they don’t actually have the power to change, overrule, or nullify any part of the count.Raises the threshold for Congress to object. Under current law, only one House member and one senator need to object to a state’s Electoral College certification, in order for Congress to vote on whether to exclude that state’s electors. For the 2020 election, those two thresholds were far exceeded: for Arizona, 121 House members and six senators objected; for Pennsylvania, 138 House members and seven senators. This bill would increase both thresholds for objection to one-fifth of both the House and Senate. Had this bill been law at the time, the Senate wouldn’t have met that threshold (although the House still would have).Clarifies which electors count. In case two or more factions within a state each try to send competing slates of electors to Congress for the official count, this bill lays out means for Congress to identify a single slate of electors from each state. It requires Congress to identify one state official (often the secretary of state) responsible for certifying their state’s electors, and requires the state’s electors themselves to be appointed prior to Election Day.**Harder to declare a “failed election.” **The bill also overturns a provision from the Presidential Election Day Act of 1845, which allows a state’s legislature to override their state’s popular vote if the legislature declares a “failed election.” Several states considered this option, namely ones in which the populace voted for Biden even though the legislature was still controlled by Republicans. (No state actually followed through.) This bill would only allow a legislature to override in case of “extraordinary and catastrophic” events.The bill was introduced in the Senate on July 20 as S. 4573, by Sen. Susan Collins (R-ME).What supporters saySupporters argue that the 2020 election was a near-disaster for the American system’s peaceful transfer of power, and 2024 or another future election could be a breaking point unless we fix the laws now.“We have before us an historic opportunity to modernize and strengthen our system of certifying and counting the electoral votes for president and vice president,” Sen. Collins said in committee testimony. “The idea that any vice president would have the power to unilaterally accept, reject, change, or halt the counting of electoral votes is antithetical to our constitutional structure and basic democratic principles.”“Nothing is more essential to the survival of a democracy than the orderly transfer of power,” Sen. Collins continued. “And there is nothing more essential to the orderly transfer of power than clear rules for effecting it.”What opponents sayThere are very few public objectors to this legislation. “There has been notably little public opposition to the heart of the bill,” University of Iowa law professor Derek T. Muller wrote in congressional testimony, “and the bulk of that rare concern rests largely on misunderstandings of the text or technical problems that can be readily corrected.”Norm Eisen — formerly Ambassador to the Czech Republic and now senior fellow in governance studies at Brookings — supports the legislation overall, but noted at least three further changes he still found necessary.The bill “allows the extension of Election Day due to ‘extraordinary and catastrophic events,’” Eisen wrote in his own congressional testimony. “The phrase ‘extraordinary and catastrophic events’ should be better defined to avoid manipulation by the election-denying officials now running to take control of the electoral process.”“Adjustments must be made to the scant six-day window for federal litigation under the [bill],” Eisen continued. “There must be adequate time for any federal litigation should governors or others wrongly certify or refuse to certify electors or otherwise abuse the process. Six days is insufficient.”“To strengthen safeguards when the process moves to Congress, [the bill] should consider clarifying the grounds for objection by replacing undefined and malleable terms preserved from the current [law] such as ‘lawfully certified’ and ‘regularly given,’” Eisen concluded, “terms which have been a proven source of abuse in the past.”Odds of passageIn addition to its Republican lead sponsor, the bill has attracted 17 bipartisan cosponsors: nine Republicans and eight Democrats. It awaits a potential vote in the Senate Rules and Administration Committee, which held a hearing on the bill in August.  Last updated Sep 16, 2022.View all GovTrack summaries.The summary below was written by the Congressional Research Service, which is a nonpartisan division of the Library of Congress, and was published on Oct 25, 2022.Electoral Count Reform and Presidential Transition Improvement Act of 2022This bill revises the process of casting and counting electoral votes for presidential elections. The bill also revises provisions related to the presidential transition process.The bill specifies that the choice of electors must occur in accordance with the laws of the state enacted prior to election day.Additionally, the bill identifies each state's governor (unless otherwise identified in the laws or constitution of a state in effect on election day) as responsible for submitting the certificate of ascertainment identifying the state's electors. Further, the bill provides for expedited judicial review for any action brought by an aggrieved presidential or vice-presidential candidate arising under the U.S. Constitution or U.S. laws with respect to the issuance or transmission of such a certificate.The bill revises the framework for the joint session of Congress to count electoral votes and make a formal declaration of which candidates have been elected President and Vice President. Among other changes, the bill (1) specifies that the role of the Vice President during the joint session shall be ministerial in nature, and (2) raises the objection threshold in Congress to at least one-fifth of the duly chosen and sworn members of both the House of Representatives and the Senate.The bill also revises the presidential transition process, including to (1) allow more than one candidate to receive federal transition resources under certain circumstances, and (2) require additional reporting by the General Services Administration."
        }
    ],
    "VotingRecord": [
        {
            "Bill Number": "S. 5355 (117th)",
            "First Name": "Benjamin “Ben” Sasse",
            "Vote": "Not Voting",
            "Bill Number.1": "S. 53",
            "Bill Name": "Combating Global Corruption Act of 2023",
            "Summary": "This bill requires the Department of State to address corruption in foreign governments.The State Department must annually publish a tiered ranking of foreign countries based on their government's efforts to eliminate corruption.The bill outlines the minimum standards that the State Department must consider when creating the ranking, such as whether a country has criminalized corruption, adopted measures to prevent corruption, and complied with the United Nations Convention Against Corruption and other relevant international agreements. Tier one countries meet the standards; tier two countries make some efforts to meet the standards; tier three countries make de minimis or no efforts to meet the standards.If a country is ranked in the second or third tier, the State Department must designate an anti-corruption contact at the U.S. diplomatic post in that country to promote good governance and combat corruption.The State Department must report annually to Congress a list of foreign persons (individuals or entities) (1) who have engaged in significant corruption in a tier three country, and (2) upon whom the President has imposed sanctions pursuant to this bill.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "S. 1605 (117th)",
            "First Name": "Benjamin “Ben” Sasse",
            "Vote": "Yea",
            "Bill Number.1": "S. 1605 (117th)",
            "Bill Name": "National Defense Authorization Act for Fiscal Year 2022",
            "Summary": "This bill was previously a companion bill to H.R. 49, but its text was completely replaced with the military spending provisions in the Dec. 7, 2021 House vote, after H.R. 49 was enacted.  Last updated Dec 11, 2021.View all GovTrack summaries.The summary below was written by the Congressional Research Service, which is a nonpartisan division of the Library of Congress, and was published on Jan 26, 2022.National Defense Authorization Act for Fiscal Year 2022This bill authorizes Department of Defense (DOD) activities and programs for FY2022 and addresses various other issues.For example, the bill provides or extends procurement authority for certain helicopters and amphibious shipbuilding programs; imposes various cost and operational limits on the F-35 aircraft program; provides statutory authority related to DOD Science and Technology Reinvention Laboratories, including direct hire authority with respect to advanced degree holders for positions at such laboratories; authorizes DOD to establish a consortium of institutions of higher education to study irregular warfare; establishes pilot programs for using private-sector partnerships to promote technology transition, deploying fifth-generation wireless telecommunications services on military installations, and digitally optimizing organic industrial base maintenance and repair operations; extends and modifies authorities to assist vetted Syrian groups and individuals, provide assistance to counter the Islamic State of Iraq and Syria, and support the activities of the Office of Security Cooperation in Iraq; extends and modifies the Indo-Pacific Maritime Security Initiative and the Pacific Deterrence Initiative; extends a pilot program providing regional cybersecurity training for members of the Army National Guard; establishes a program within the Cybersecurity and Infrastructure Security Agency to continuously monitor cybersecurity risks to critical infrastructure entities that support national critical functions; authorizes a Department of Energy program to improve defense environmental cleanup processes; authorizes the establishment of an Assistant Secretary for International Narcotics and Law Enforcement Affairs within the Department of State; and imposes limits on when the State Department may use a nonstandard design when constructing an embassy or consulate compound.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "S. 610 (117th)",
            "First Name": "Benjamin “Ben” Sasse",
            "Vote": "Not Voting",
            "Bill Number.1": "S. 610 (117th)",
            "Bill Name": "Protecting Medicare and American Farmers from Sequester Cuts Act",
            "Summary": "This bill makes several budgetary, technical, and procedural changes, particularly in relation to Medicare and increasing the debt limit.Specifically, the bill continues to exempt Medicare from sequestration until March 31, 2022. (Sequestration is a process of automatic, usually across-the-board spending reductions under which budgetary resources are permanently cancelled to enforce specific budget policy goals.)The bill also establishes expedited Senate procedures for considering legislation to increase the debt limit. The procedures limit debate, waive points of order, and prohibit amendments. The procedures may only be used once and expire after January 16, 2022.Additionally, the bill (1) temporarily extends other provisions under Medicare, including a payment increase under the physician fee schedule; and (2) requires any debits recorded for FY2022 on the statutory pay-as-you-go (PAYGO) scorecards to be deducted from the scorecards for 2022 and added to the scorecards for 2023.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "S.J.Res. 29",
            "First Name": "Benjamin “Ben” Sasse",
            "Vote": "Yea",
            "Bill Number.1": "S.J.Res. 29",
            "Bill Name": "A joint resolution providing for the reappointment of Michael Govan as a citizen regent of the Board of Regents of the Smithsonian Institution.",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "S. 1301",
            "First Name": "Benjamin “Ben” Sasse",
            "Vote": "Nay",
            "Bill Number.1": "S. 1301",
            "Bill Name": "[Increase of Public Debt Limit]",
            "Summary": "This bill became the vehicle for passage of the public debt limit increase with the House vote on September 29, 2021. Prior to the House vote on that date, the bill was the Promoting Physical Activity for Americans Act, a bill on an unrelated subject.  Last updated Oct 8, 2021.View all GovTrack summaries.The summary below was written by the Congressional Research Service, which is a nonpartisan division of the Library of Congress, and was published on Oct 15, 2021.This bill increases the public debt limit by $480 billion.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "S.J.Res. 13 (117th)",
            "First Name": "Benjamin “Ben” Sasse",
            "Vote": "Nay",
            "Bill Number.1": "S.J.Res. 13 (117th)",
            "Bill Name": "A joint resolution providing for congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the Equal Employment Opportunity Commission relating to \\u201cUpdate of Commission\\u2019s Conciliation Procedur",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "S.J.Res. 15 (117th)",
            "First Name": "Benjamin “Ben” Sasse",
            "Vote": "Nay",
            "Bill Number.1": "S.J.Res. 15 (117th)",
            "Bill Name": "A joint resolution providing for congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the Office of the Comptroller of Currency relating to \\u201cNational Banks and Federal Savings Association",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "S. 914 (117th)",
            "First Name": "Benjamin “Ben” Sasse",
            "Vote": "Yea",
            "Bill Number.1": "S. 914 (117th)",
            "Bill Name": "Drinking Water and Wastewater Infrastructure Act of 2021",
            "Summary": "This bill reauthorizes through FY2026 or establishes a variety of programs for water infrastructure. Specifically, it supports programs to provide safe drinking water or treat wastewater, such as sewer overflows or stormwater. For example, the bill reauthorizes and revises the clean water state revolving fund (SRF) and the drinking water SRF.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "S.J.Res. 14 (117th)",
            "First Name": "Benjamin “Ben” Sasse",
            "Vote": "Nay",
            "Bill Number.1": "S.J.Res. 14 (117th)",
            "Bill Name": "A joint resolution providing for congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the Environmental Protection Agency relating to \\u201cOil and Natural Gas Sector: Emission Standards for N",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "S. 937 (117th)",
            "First Name": "Benjamin “Ben” Sasse",
            "Vote": "Yea",
            "Bill Number.1": "S. 937 (117th)",
            "Bill Name": "COVID-19 Hate Crimes Act",
            "Summary": "This bill requires a designated officer or employee of the Department of Justice (DOJ) to facilitate the expedited review of hate crimes and reports of hate crimes.DOJ must issue guidance for state, local, and tribal law enforcement agencies on establishing online hate crime reporting processes, collecting data disaggregated by protected characteristic (e.g., race or national origin), and expanding education campaigns.Additionally, DOJ and the Department of Health and Human Services must issue guidance aimed at raising awareness of hate crimes during the COVID-19 (i.e., coronavirus disease 2019) pandemic.The bill establishes grants for states to create state-run hate crimes reporting hotlines. It also authorizes grants for states and local governments to implement the National Incident-Based Reporting System and to conduct law enforcement activities or crime reduction programs to prevent, address, or respond to hate crimes.Finally, in the case of an individual convicted of a hate crime offense and placed on supervised release, the bill allows a court to order that the individual participate in educational classes or community service as a condition of supervised release.",
            "Status": "Enacted"
        }
    ]
}