{
    "Name": "Dianne  Feinstein",
    "CosponsoredBills": [
        {
            "Bill Number": "S. 206",
            "First Name": "Dianne  Feinstein",
            "Last Name": "cosponsor",
            "Role": "S. 206",
            "Bill Name": "A bill to require the Commissioner of U.S. Customs and Border Protection to regularly review and update policies and manuals related to inspections at ports of entry.",
            "Subject Areas": "Crime and Law Enforcement, Border security and unlawful immigration, Congressional oversight, Customs enforcement, Drug trafficking and controlled substances, Government information and archives, Human trafficking, Smuggling and trafficking",
            "Summary": "This bill requires U.S. Customs and Border Protection to review and update, as necessary, manuals and policies related to inspections at ports of entry to ensure the uniformity of inspection practices to effectively detect illegal activity along the border, such as the smuggling of drugs and humans."
        },
        {
            "Bill Number": "S. 305",
            "First Name": "Dianne  Feinstein",
            "Last Name": "cosponsor",
            "Role": "S. 305",
            "Bill Name": "250th Anniversary of the United States Marine Corps Commemorative Coin Act",
            "Subject Areas": "Military personnel and dependents",
            "Summary": "This bill directs the Department of the Treasury to mint and issue not more than 50,000 $5 gold coins, 400,000 $1 silver coins, and 750,000 half-dollar clad coins emblematic of the 250th anniversary of the United States Marine Corps.All surcharges received by Treasury from the sale of such coins must be paid to the Marine Corps Heritage Foundation and shall only be used for the purposes of supporting the mission of the Marine Corps Heritage Center."
        },
        {
            "Bill Number": "S. 1554",
            "First Name": "Dianne  Feinstein",
            "Last Name": "cosponsor",
            "Role": "S. 1554",
            "Bill Name": "National American Indian Veterans Charter Act",
            "Subject Areas": "Native Americans",
            "Summary": "This bill grants a federal charter to the National American Indian Veterans Inc., which is a nonprofit corporation organized in the United States."
        },
        {
            "Bill Number": "S. 3308 (117th)",
            "First Name": "Dianne  Feinstein",
            "Last Name": "cosponsor",
            "Role": "S. 3308 (117th)",
            "Bill Name": "Colorado River Indian Tribes Water Resiliency Act of 2022",
            "Subject Areas": "Transportation and Public Works, Indian lands and resources rights",
            "Summary": "This bill authorizes the Colorado River Indian Tribes (CRIT) to enter into an agreement or option to lease or exchange a portion of the consumptive use of water to be used off the tribe's reservation if the use off the reservation is located in the Lower Basin in the state of Arizona.The CRIT is authorized to enter into an agreement, including with the Arizona Water Banking Authority, for the storage of a portion of the consumptive use, or the water received under an exchange pursuant to an exchange agreement under this bill, at one or more underground storage facilities or groundwater savings facilities off the reservation if the facility is located in the Lower Basin.The Department of the Interior, when approving a lease or exchange or storage agreement, must ensure that such agreement complies with the National Environmental Policy Act of 1969, the Endangered Species Act of 1973, and other federal environmental laws."
        },
        {
            "Bill Number": "S. 450 (117th)",
            "First Name": "Dianne  Feinstein",
            "Last Name": "cosponsor",
            "Role": "S. 450 (117th)",
            "Bill Name": "Emmett Till and Mamie Till-Mobley Congressional Gold Medal Act of 2021",
            "Subject Areas": "Racial and ethnic relations, Smithsonian Institution, U.S. history",
            "Summary": NaN
        },
        {
            "Bill Number": "S. 4439 (117th)",
            "First Name": "Dianne  Feinstein",
            "Last Name": "cosponsor",
            "Role": "S. 4439 (117th)",
            "Bill Name": "Katimi\\u00een and Ameeky\\u00e1araam Sacred Lands Act",
            "Subject Areas": "Native Americans, California, Federal-Indian relations, Gambling, Indian lands and resources rights, Lakes and rivers, Land transfers, Land use and conservation",
            "Summary": NaN
        },
        {
            "Bill Number": "S. 3949 (117th)",
            "First Name": "Dianne  Feinstein",
            "Last Name": "cosponsor",
            "Role": "S. 3949 (117th)",
            "Bill Name": "Trafficking Victims Prevention and Protection Reauthorization Act of 2022",
            "Subject Areas": "Assault and harassment offenses, Business ethics, Child safety and welfare, Civil actions and liability, Computer security and identity theft, Congressional oversight, Contracts and agency, Crime prevention, Crime victims, Crimes against children, Criminal investigation, prosecution, interrogation, Criminal justice information and records, Criminal procedure and sentencing, Customs enforcement, Domestic violence and child abuse, Drug, alcohol, tobacco use, Employee benefits and pensions, Employee hiring, Employee performance, Employment and training programs, Evidence and witnesses, Fraud offenses and financial crimes, Government employee pay, benefits, personnel management, Government ethics and transparency, public corruption, Government information and archives, Government studies and investigations, Health care costs and insurance, Higher education, Human rights, Human trafficking, Immigration status and procedures, Juvenile crime and gang violence, Labor standards, Labor-management relations, Law enforcement administration and funding, Mental health, Pornography, Public contracts and procurement, Sex offenses, Smuggling and trafficking, State and local government operations, Trade restrictions, Visas and passports, Vocational and technical education, Wages and earnings, Youth employment and child labor",
            "Summary": NaN
        },
        {
            "Bill Number": "S. 2607 (117th)",
            "First Name": "Dianne  Feinstein",
            "Last Name": "cosponsor",
            "Role": "S. 2607 (117th)",
            "Bill Name": "Iran Hostages Congressional Gold Medal Act",
            "Subject Areas": "International Affairs, Congressional tributes, Detention of persons, Diplomacy, foreign officials, Americans abroad, Iran, Middle East, Museums, exhibitions, cultural centers, Smithsonian Institution",
            "Summary": "This bill provides for the award of a Congressional Gold Medal to the 53 hostages of the Iran Hostage Crisis (November 4, 1979-January 21, 1981) in recognition of their bravery and endurance throughout their captivity."
        },
        {
            "Bill Number": "S. 4003 (117th)",
            "First Name": "Dianne  Feinstein",
            "Last Name": "cosponsor",
            "Role": "S. 4003 (117th)",
            "Bill Name": "Law Enforcement De-Escalation Training Act of 2022",
            "Subject Areas": "Crime and Law Enforcement, Community life and organization, Congressional oversight, Disability and health-based discrimination, Drug, alcohol, tobacco use, Employment and training programs, Government information and archives, Government studies and investigations, Health personnel, Intergovernmental relations, Law enforcement administration and funding, Law enforcement officers, Mental health, Performance measurement, Public-private cooperation, State and local government operations",
            "Summary": NaN
        },
        {
            "Bill Number": "S. 1466 (117th)",
            "First Name": "Dianne  Feinstein",
            "Last Name": "cosponsor",
            "Role": "S. 1466 (117th)",
            "Bill Name": "Saline Lake Ecosystems in the Great Basin States Program Act of 2022",
            "Subject Areas": "California, Climate change and greenhouse gases, Congressional oversight, Environmental assessment, monitoring, research, Government studies and investigations, Hydrology and hydrography, Idaho, Lakes and rivers, Nevada, Oregon, Water quality, Water use and supply, Wildlife conservation and habitat protection, Wyoming",
            "Summary": NaN
        },
        {
            "Bill Number": "S. 4834 (117th)",
            "First Name": "Dianne  Feinstein",
            "Last Name": "cosponsor",
            "Role": "S. 4834 (117th)",
            "Bill Name": "PROTECT Our Children Act of 2022",
            "Subject Areas": "Domestic violence and child abuse, Law enforcement administration and funding, Pornography",
            "Summary": NaN
        },
        {
            "Bill Number": "S. 3092 (117th)",
            "First Name": "Dianne  Feinstein",
            "Last Name": "cosponsor",
            "Role": "S. 3092 (117th)",
            "Bill Name": "FIRE Act",
            "Subject Areas": "Emergency planning and evacuation, Fires, Forests, forestry, trees, Government studies and investigations, Homelessness and emergency shelter, Intergovernmental relations",
            "Summary": NaN
        },
        {
            "Bill Number": "S. 4359 (117th)",
            "First Name": "Dianne  Feinstein",
            "Last Name": "cosponsor",
            "Role": "S. 4359 (117th)",
            "Bill Name": "Senator Johnny Isakson VA Regional Office Act of 2022",
            "Subject Areas": "Armed Forces and National Security, Congressional tributes, Department of Veterans Affairs, Georgia, Government buildings, facilities, and property",
            "Summary": NaN
        },
        {
            "Bill Number": "S. 4524 (117th)",
            "First Name": "Dianne  Feinstein",
            "Last Name": "cosponsor",
            "Role": "S. 4524 (117th)",
            "Bill Name": "Speak Out Act",
            "Subject Areas": "Sex offenses",
            "Summary": NaN
        },
        {
            "Bill Number": "S. 3232 (117th)",
            "First Name": "Dianne  Feinstein",
            "Last Name": "cosponsor",
            "Role": "S. 3232 (117th)",
            "Bill Name": "STURDY Act",
            "Subject Areas": "Commerce, Administrative law and regulatory procedures, Child safety and welfare, Consumer Product Safety Commission, Product safety and quality",
            "Summary": "This bill requires the Consumer Product Safety Commission to revise the safety standards for freestanding clothing storage units such as dressers, bureaus, or chests of drawers. Such standards must include specified testing related to tip-overs and new warning requirements for all such products entering the U.S. market."
        },
        {
            "Bill Number": "S. 4672 (117th)",
            "First Name": "Dianne  Feinstein",
            "Last Name": "cosponsor",
            "Role": "S. 4672 (117th)",
            "Bill Name": "Emergency Aircraft Act of 2022",
            "Subject Areas": NaN,
            "Summary": NaN
        },
        {
            "Bill Number": "S. 4587 (117th)",
            "First Name": "Dianne  Feinstein",
            "Last Name": "cosponsor",
            "Role": "S. 4587 (117th)",
            "Bill Name": "Benjamin Berell Ferencz Congressional Gold Medal Act",
            "Subject Areas": "International Affairs",
            "Summary": "This bill provides for the award of a Congressional Gold Medal to Benjamin Berell Ferencz in recognition of his service to the United States and the international community during the post-World War II Nuremberg trials and his lifelong advocacy for international criminal justice and the rule of law."
        },
        {
            "Bill Number": "S. 4558 (117th)",
            "First Name": "Dianne  Feinstein",
            "Last Name": "cosponsor",
            "Role": "S. 4558 (117th)",
            "Bill Name": "Cleaner, Quieter Airplanes Act",
            "Subject Areas": NaN,
            "Summary": "This bill directs the National Aeronautics and Space Administration (NASA) to establish an initiative to research, develop, and demonstrate new technologies and concepts to reduce emissions and noise from aircraft. Emissions to be addressed include carbon dioxide (CO2), nitrogen oxides (NOx), water vapor, black carbon, and sulfate aerosols.The goals and objectives of the initiative shall include (1) ensuring U.S. leadership in research and technology innovation leading to substantial reductions in aviation noise and emissions; (2) reducing greenhouse gas emissions from new and replacement aircraft to the extent necessary to achieve net-zero greenhouse gas emissions from U.S. aviation by 2050; and (3) noise levels from aircraft throughout all phases of flight that do not exceed ambient noise levels in the absence of flight operations in the vicinity of the flight route."
        },
        {
            "Bill Number": "S. 1718 (117th)",
            "First Name": "Dianne  Feinstein",
            "Last Name": "cosponsor",
            "Role": "S. 1718 (117th)",
            "Bill Name": "Rosie the Riveter National Historical Park Expansion Act",
            "Subject Areas": "Public Lands and Natural Resources, California, Conflicts and wars, Educational facilities and institutions, Elementary and secondary education, Historic sites and heritage areas, Land use and conservation, Manufacturing, Military history, U.S. history, Women's employment",
            "Summary": "This bill adds to the Rosie the Riveter/World War II Home Front National Historical Park in California Nystrom Elementary School--The Maritime Building and other areas as the Department of the Interior deems appropriate.Within the boundaries of the park, Interior may acquire lands, improvements, waters, or interests therein by donation, purchase, exchange, or transfer. Any lands, or interests therein, owned by California or any political subdivision of California may be acquired only by donation."
        },
        {
            "Bill Number": "S. 4424 (117th)",
            "First Name": "Dianne  Feinstein",
            "Last Name": "cosponsor",
            "Role": "S. 4424 (117th)",
            "Bill Name": "Recreation and Public Purposes Tribal Parity Act",
            "Subject Areas": "Native Americans, Land transfers, Land use and conservation, Parks, recreation areas, trails, State and local government operations",
            "Summary": "This bill authorizes the Department of the Interior to sell or lease public lands to federally recognized Indian tribes for recreational or public purposes, subject to annual acreage limitations."
        },
        {
            "Bill Number": "S. 1872 (117th)",
            "First Name": "Dianne  Feinstein",
            "Last Name": "cosponsor",
            "Role": "S. 1872 (117th)",
            "Bill Name": "United States Army Rangers Veterans of World War II Congressional Gold Medal Act",
            "Subject Areas": "Museums, exhibitions, cultural centers, Smithsonian Institution, Veterans' organizations and recognition",
            "Summary": "This bill provides for the award of a single Congressional Gold Medal to the U.S. Army Rangers Veterans of World War II in recognition of their dedicated service during World War II."
        },
        {
            "Bill Number": "S. 2102 (117th)",
            "First Name": "Dianne  Feinstein",
            "Last Name": "cosponsor",
            "Role": "S. 2102 (117th)",
            "Bill Name": "Dr. Kate Hendricks Thomas SERVICE Act",
            "Subject Areas": "Cancer, Conflicts and wars, Congressional oversight, Djibouti, Egypt, Fires, Hazardous wastes and toxic substances, Iraq, Jordan, Kuwait, Lebanon, Medical tests and diagnostic methods, Middle East, Military operations and strategy, Qatar, Saudi Arabia, Solid waste and recycling, Syria, Veterans' medical care, Women's health, Yemen",
            "Summary": "This bill expands eligibility for Veterans Health Administration mammography screenings to veterans who served in certain locations during specified periods, including those who were exposed to toxic substances at such locations.The specified locations and corresponding time periods include Iraq between August 2, 1990, and February 28, 1991, and from March 19, 2003, until burn pits (areas used for burning solid waste in open air without equipment) are no longer used in Iraq; the Southwest Asia theater of operations, including Kuwait, Saudi Arabia, Oman, and Qatar, from August 2, 1990, until burn pits are no longer used in such locations; Afghanistan, Djibouti, Syria, Jordan, Egypt, Lebanon, and Yemen from September 11, 2001, until burn pits are no longer used in such locations; and other locations and time periods as determined by the Airborne Hazards and Open Burn Pit Registry. The bill specifies that the listed locations do not include bodies of water around or airspace above such locations."
        },
        {
            "Bill Number": "S. 1116 (117th)",
            "First Name": "Dianne  Feinstein",
            "Last Name": "cosponsor",
            "Role": "S. 1116 (117th)",
            "Bill Name": "Federal Firefighters Fairness Act of 2022",
            "Subject Areas": "Digestive and metabolic diseases, Disability and paralysis, Disability assistance, Emergency medical services and trauma care, Employee benefits and pensions, Evidence and witnesses, Fires, First responders and emergency personnel, Government employee pay, benefits, personnel management, HIV/AIDS, Hazardous wastes and toxic substances, Health personnel, Infectious and parasitic diseases, Musculoskeletal and skin diseases, Neurological disorders, Worker safety and health",
            "Summary": "This bill provides federal workers' compensation to firefighters who contract certain illnesses as a result of their service.Specifically, the bill provides that (1) heart disease, lung disease, and specified cancers of federal employees employed in fire protection activities for at least 5 years are presumed to be proximately caused by such employment if the employee is diagnosed with the disease within 10 years of employment; and (2) the disability or death of the employee due to such disease is presumed to result from personal injury sustained in the performance of duty. These presumptions also apply to fire protection employees (regardless of the length of employment) who contract any communicable disease at the center of a designated pandemic or any chronic infectious disease that the Department of Labor determines is related to job-related hazards. An employee in fire protection activities is a firefighter, paramedic, emergency medical technician, rescue worker, ambulance personnel, or hazardous material worker, who (1) is trained in fire suppression; (2) has the legal authority and responsibility to engage in fire suppression; (3) is engaged in the prevention, control, and extinguishment of fires or response to emergency situations where life, property, or the environment is at risk; and (4) performs such activities as a primary responsibility."
        },
        {
            "Bill Number": "S. 1596 (117th)",
            "First Name": "Dianne  Feinstein",
            "Last Name": "cosponsor",
            "Role": "S. 1596 (117th)",
            "Bill Name": "Greatest Generation Memorial Act",
            "Subject Areas": "Finance and Financial Sector, Conflicts and wars, Currency, Military history, Monuments and memorials, U.S. history, Veterans' organizations and recognition",
            "Summary": "This bill directs the Department of the Treasury to mint and issue up to 50,000 $5 coins, 400,000 $1 silver coins, and 750,000 half-dollar clad coins in commemoration of the National World War II Memorial in the District of Columbia.The design of the coins shall be emblematic of the memorial and the service and sacrifice of American soldiers and civilians during World War II.All surcharges received from the sale of such coins shall be paid to the Friends of the National World War II Memorial to support the National Park Service in maintaining and repairing the memorial, and for educational and commemorative programs."
        },
        {
            "Bill Number": "S. 2629 (117th)",
            "First Name": "Dianne  Feinstein",
            "Last Name": "cosponsor",
            "Role": "S. 2629 (117th)",
            "Bill Name": "Better Cybercrime Metrics Act",
            "Subject Areas": "Crime and Law Enforcement, Computer security and identity theft, Congressional oversight, Crime victims, Criminal investigation, prosecution, interrogation, Criminal justice information and records, Government information and archives, Government studies and investigations",
            "Summary": "This bill establishes various requirements to improve the collection of data related to cybercrime and cyber-enabled crime (cybercrime). Among the requirements the Department of Justice (DOJ) must enter into an agreement with the National Academy of Sciences to develop a taxonomy for categorizing different types of cybercrime faced by individuals and businesses; DOJ must establish a category in the National Incident-Based Reporting System for collecting cybercrime reports from federal, state, and local officials; DOJ's Bureau of Justice Statistics and the Bureau of the Census must include questions about cybercrime in the annual National Crime Victimization Survey; and the Government Accountability Office must assess the effectiveness of reporting mechanisms for cybercrime and disparities in reporting cybercrime data and other types of crime data."
        },
        {
            "Bill Number": "S. 4134 (117th)",
            "First Name": "Dianne  Feinstein",
            "Last Name": "cosponsor",
            "Role": "S. 4134 (117th)",
            "Bill Name": "Ukraine Invasion War Crimes Deterrence and Accountability Act",
            "Subject Areas": "Chemical and biological weapons, Conflicts and wars, Congressional oversight, Criminal investigation, prosecution, interrogation, Diplomacy, foreign officials, Americans abroad, Europe, Evidence and witnesses, Georgia (Republic), Government information and archives, Human rights, Intelligence activities, surveillance, classified information, International law and treaties, International organizations and cooperation, Middle East, Military operations and strategy, News media and reporting, Protest and dissent, Refugees, asylum, displaced persons, Russia, Sex offenses, Sovereignty, recognition, national governance and status, Syria, Ukraine, War crimes, genocide, crimes against humanity",
            "Summary": "This bill requires the President to report to Congress on atrocities committed during Russia's invasion of Ukraine since February 24, 2022.Specifically, the report must describe in detail (1) U.S. government efforts to collect, analyze, and preserve evidence related to war crimes and other atrocities committed during the invasion; (2) media, public diplomacy, and information operations to make the Russian people, including their military and political leaders, aware of efforts to identify and prosecute those responsible for such atrocities; and (3) the process for a domestic, foreign, or international court or tribunal to obtain information from the U.S. government related to such atrocities."
        },
        {
            "Bill Number": "S. 120 (117th)",
            "First Name": "Dianne  Feinstein",
            "Last Name": "cosponsor",
            "Role": "S. 120 (117th)",
            "Bill Name": "Safe Connections Act of 2021",
            "Subject Areas": "Crime and Law Enforcement, Science, Technology, Communications, Administrative law and regulatory procedures, Assault and harassment offenses, Business records, Civil actions and liability, Congressional oversight, Consumer affairs, Crime victims, Crimes against women, Domestic violence and child abuse, Emergency communications systems, Federal Communications Commission (FCC), Government information and archives, Human trafficking, Right of privacy, Sex offenses, Telecommunication rates and fees, Telephone and wireless communication",
            "Summary": "This bill establishes requirements concerning access to communication services for survivors of domestic violence, human trafficking, and related harms.At a survivor's request, a mobile service provider must separate from a shared mobile service contract the survivor's line (and the line of any individual in the survivor's care) from the abuser's line unless separation is operationally or technologically infeasible. A survivor requesting this must (1) verify through appropriate documentation that an individual under the contract committed or allegedly committed an act of domestic violence, trafficking, or a related criminal act against the survivor; and (2) assume financial responsibility for services after a line separation.A provider may not charge fees or impose other requirements on such requests. Additionally, a provider must separate the line within two business days of receiving a request; allow requests to be made remotely (if feasible); meet conditions related to confidentiality of, disposal of, and other matters concerning communications about requests; and make information about the process for requests available through consumer-facing communications (e.g., websites). The bill (1) provides liability protection for providers' acts or omissions undertaken to comply with such requests, and (2) requires the Federal Communications Commission (FCC) to adopt rules for these requests.Additionally, the FCC must (1) expand access to federally subsidized communication services for survivors facing financial hardship, and (2) evaluate this expanded access.The FCC must also consider rules requiring communication service providers to omit from consumer-facing logs calls and texts to hotlines for domestic violence and similar issues while retaining internal records."
        },
        {
            "Bill Number": "S. 697 (117th)",
            "First Name": "Dianne  Feinstein",
            "Last Name": "cosponsor",
            "Role": "S. 697 (117th)",
            "Bill Name": "Harriet Tubman Bicentennial Commemorative Coin Act",
            "Subject Areas": "Finance and Financial Sector, Commemorative events and holidays, Currency, Racial and ethnic relations, U.S. history, Women's rights",
            "Summary": "This bill directs the Department of the Treasury to mint and issue 50,000 $5 gold coins, 400,000 $1 silver coins, and 750,000 half-dollar clad coins emblematic of the legacy of Harriet Tubman as an abolitionist.The Secretary may issue coins under this bill only during the period of January 1, 2024, through December 31, 2024.All surcharges received by Treasury from the sale of such coins must be paid equally to the National Underground Railroad Freedom Center in Cincinnati, Ohio, and The Harriet Tubman Home, Inc. in Auburn, New York, for the purpose of accomplishing and advancing their missions."
        },
        {
            "Bill Number": "S. 1404 (117th)",
            "First Name": "Dianne  Feinstein",
            "Last Name": "cosponsor",
            "Role": "S. 1404 (117th)",
            "Bill Name": "Ghost Army Congressional Gold Medal Act",
            "Subject Areas": NaN,
            "Summary": "This bill provides for the award of a Congressional Gold Medal to the 23rd Headquarters Special Troops and the 3133rd Signal Services Company, known collectively as the Ghost Army, in recognition of unique and highly distinguished service during World War II."
        },
        {
            "Bill Number": "S. 452 (117th)",
            "First Name": "Dianne  Feinstein",
            "Last Name": "cosponsor",
            "Role": "S. 452 (117th)",
            "Bill Name": "Willie O\\u2019Ree Congressional Gold Medal Act",
            "Subject Areas": "Racial and ethnic relations",
            "Summary": NaN
        },
        {
            "Bill Number": "S. 2340 (117th)",
            "First Name": "Dianne  Feinstein",
            "Last Name": "cosponsor",
            "Role": "S. 2340 (117th)",
            "Bill Name": "Daniel Anderl Judicial Security and Privacy Act of 2021",
            "Subject Areas": "Family relationships, Government information and archives, Judges, Personnel records, Protection of officials, Right of privacy, State and local government operations",
            "Summary": "This bill generally prohibits federal agencies and private businesses from publicly posting certain personal information (e.g., home addresses) of federal judges and their immediate family members. It also (1) requires information to be removed upon written request from the federal judge concerned, (2) prohibits data brokers from purchasing or selling such information, and (3) establishes programs to protect such information at the state and local level and to enhance security for judges."
        },
        {
            "Bill Number": "S. 921 (117th)",
            "First Name": "Dianne  Feinstein",
            "Last Name": "cosponsor",
            "Role": "S. 921 (117th)",
            "Bill Name": "Jaime Zapata and Victor Avila Federal Officers and Employees Protection Act",
            "Subject Areas": "Crime and Law Enforcement, Assault and harassment offenses, Criminal investigation, prosecution, interrogation, Diplomacy, foreign officials, Americans abroad, Federal officials, Government employee pay, benefits, personnel management, Jurisdiction and venue, Law enforcement officers, Protection of officials, Violent crime",
            "Summary": "This bill explicitly grants extraterritorial jurisdiction over the following criminal offenses: killing (or attempting to kill) a federal officer or employee; assaulting, kidnapping, or murdering (or threatening to do so, or attempting to kidnap or murder) a family member of certain federal officials to retaliate against or to impede, intimidate, or interfere with the federal official; threatening to assault, kidnap, or murder certain federal officials to retaliate against or to impede, intimidate, or interfere with the federal official; and assaulting, resisting, or impeding certain officers or employees. The United States may prosecute such conduct that occurs outside the United States."
        },
        {
            "Bill Number": "S. 172 (117th)",
            "First Name": "Dianne  Feinstein",
            "Last Name": "cosponsor",
            "Role": "S. 172 (117th)",
            "Bill Name": "A bill to authorize the National Medal of Honor Museum Foundation to establish a commemorative work in the District of Columbia and its environs, and for other purposes.",
            "Subject Areas": "Armed Forces and National Security, Congressional tributes, District of Columbia, Government trust funds, Military personnel and dependents, Monuments and memorials, Museums, exhibitions, cultural centers, Veterans' organizations and recognition",
            "Summary": "This bill authorizes the National Medal of Honor Museum Foundation to establish a commemorative work on federal land in the District of Columbia in honor of the extraordinary acts of valor, selfless service, and sacrifice displayed by Medal of Honor recipients.The foundation shall be solely responsible for the acceptance of contributions for, and the payment of expenses of, the establishment of the commemorative work.Federal funds may not be used to pay any expenses for the establishment of the commemorative work."
        },
        {
            "Bill Number": "S. 3176 (117th)",
            "First Name": "Dianne  Feinstein",
            "Last Name": "cosponsor",
            "Role": "S. 3176 (117th)",
            "Bill Name": "Camp Lejeune Justice Act of 2021",
            "Subject Areas": "Law",
            "Summary": "This bill allows certain individuals to sue and recover damages for harm from exposure to contaminated water at Camp Lejeune in North Carolina between August 1, 1953, and December 31, 1987.This action is available only to individuals who were exposed to contaminated water for at least 30 days.The bill prohibits the U.S. government from asserting specified immunity from litigation in response to such a lawsuit.The bill also prohibits an individual who brings such an action from bringing a separate tort action against the United States based on the same harm."
        },
        {
            "Bill Number": "S. 2342 (117th)",
            "First Name": "Dianne  Feinstein",
            "Last Name": "cosponsor",
            "Role": "S. 2342 (117th)",
            "Bill Name": "Ending Forced Arbitration of Sexual Assault and Sexual Harassment Act of 2021",
            "Subject Areas": NaN,
            "Summary": "This bill invalidates arbitration agreements that preclude a party from filing a lawsuit in court involving sexual assault or sexual harassment, at the election of the party alleging such conduct."
        },
        {
            "Bill Number": "S. 3096 (117th)",
            "First Name": "Dianne  Feinstein",
            "Last Name": "cosponsor",
            "Role": "S. 3096 (117th)",
            "Bill Name": "Barry Goldwater Scholarship and Excellence in Education Modernization Act",
            "Subject Areas": "Education",
            "Summary": "This bill revises the Barry Goldwater Scholarship and Excellence in Education Program.Among other changes, the bill (1) expands program eligibility to undergraduate students who are noncitizens; (2) allows the related foundation to award research internships to outstanding undergraduate students who intend to pursue careers in the natural sciences, engineering, and mathematics; (3) allows students who are awarded such research internships to receive stipends; and (4) authorizes the Department of the Treasury to invest related fund assets in securities other than U.S. public debt securities under certain circumstances."
        },
        {
            "Bill Number": "S. 1828 (117th)",
            "First Name": "Dianne  Feinstein",
            "Last Name": "cosponsor",
            "Role": "S. 1828 (117th)",
            "Bill Name": "HAVANA Act of 2021",
            "Subject Areas": "Diplomacy, foreign officials, Americans abroad, Government employee pay, benefits, personnel management, Intelligence activities, surveillance, classified information, Neurological disorders, Worker safety and health",
            "Summary": "This bill specifically authorizes the Central Intelligence Agency, the Department of State, and other agencies to provide payments to agency personnel who incur brain injuries from hostilities while on assignment.Specifically, the bill allows agency personnel and their families to receive payments for brain injuries that are incurred (1) during a period of assignment to a foreign or domestic duty station; (2) in connection with war, insurgency, hostile acts, terrorist activity, or other agency-designated incidents; and (3) not as the result of willful misconduct.The bill's authority applies to injuries incurred before, on, or after the date of the bill's enactment. Agencies must submit classified reports on the bill's implementation, including the number of payments made and the amount of each payment.Since 2016, some intelligence, diplomatic, and other governmental personnel have reported experiencing unusual cognitive and neurological impairments while on assignment (particularly abroad), the source of which is currently under investigation. Symptoms were first reported by personnel stationed in Cuba and have since been collectively referred to as Havana Syndrome."
        },
        {
            "Bill Number": "S. 2756 (117th)",
            "First Name": "Dianne  Feinstein",
            "Last Name": "cosponsor",
            "Role": "S. 2756 (117th)",
            "Bill Name": "A bill to posthumously award a Congressional Gold Medal, in commemoration of the service members who perished as a result of the attack in Afghanistan on August 26, 2021, during the evacuation of citizens of the United States and Afghan",
            "Subject Areas": "Armed Forces and National Security, International Affairs, Afghanistan, Asia, Conflicts and wars, Congressional tributes, Emergency planning and evacuation, Military operations and strategy, Military personnel and dependents, Museums, exhibitions, cultural centers, Smithsonian Institution, Terrorism",
            "Summary": "This bill posthumously provides for the award of a Congressional Gold Medal in commemoration of the 13 service members who died on August 26, 2021, while stationed at Hamid Karzai International Airport in Afghanistan."
        },
        {
            "Bill Number": "S. 2647 (117th)",
            "First Name": "Dianne  Feinstein",
            "Last Name": "cosponsor",
            "Role": "S. 2647 (117th)",
            "Bill Name": "Harlem Hellfighters Congressional Gold Medal Act",
            "Subject Areas": "Armed Forces and National Security",
            "Summary": "This bill provides for the award of a Congressional Gold Medal to the 369th Infantry Regiment, commonly known as the Harlem Hellfighters, in recognition of their bravery and outstanding service during World War I."
        },
        {
            "Bill Number": "S. 3377 (117th)",
            "First Name": "Dianne  Feinstein",
            "Last Name": "cosponsor",
            "Role": "S. 3377 (117th)",
            "Bill Name": "Capitol Police Emergency Assistance Act of 2021",
            "Subject Areas": "Administrative law and regulatory procedures, Civil disturbances, Congress, Congressional agencies, Congressional leadership, Congressional officers and employees, Congressional operations and organization, Congressional oversight, Crime prevention, Emergency planning and evacuation, Government buildings, facilities, and property, Intergovernmental relations, Law enforcement administration and funding, Law enforcement officers, Military civil functions, Military personnel and dependents, Protection of officials, State and local government operations, U.S. Capitol",
            "Summary": "This bill allows the chief of the U.S. Capitol Police to request emergency assistance from executive departments and executive agencies to prevent significant disruption of governmental function and public order at the U.S. Capitol. The bill also eliminates statutory qualification and approval requirements for law enforcement and uniformed service personnel appointed to serve as special police officers, including during periods of emergency initiated by the chief under the bill. Further, special police regulations prescribed by the U.S. Capitol Police Board are subject to approval by the Speaker of the House and Senate majority leader under the bill. Those regulations are subject to approval by the Speaker and the President pro tempore of the Senate under current law.Finally, the bill requires the Senate Committee on Rules and Administration and the House Committee on House Administration to jointly conduct at least one oversight hearing of the U.S. Capitol Police Board during each Congress."
        },
        {
            "Bill Number": "S. 1813 (117th)",
            "First Name": "Dianne  Feinstein",
            "Last Name": "cosponsor",
            "Role": "S. 1813 (117th)",
            "Bill Name": "Accelerating Access to Critical Therapies for ALS Act",
            "Subject Areas": "Health care coverage and access, Health programs administration and funding, Health promotion and preventive care, Higher education, Medical research, Medical tests and diagnostic methods, Neurological disorders, Prescription drugs, Public-private cooperation, Research administration and funding, Research and development, Social work, volunteer service, charitable organizations",
            "Summary": "This bill establishes grant programs to address neurodegenerative diseases, such as amyotrophic lateral sclerosis (also known as ALS or Lou Gehrig's disease), and contains other related provisions.The Department of Health and Human Services (HHS) shall award grants to eligible entities to facilitate patients' access to investigational drugs that diagnose or treat ALS. The Food and Drug Administration (FDA) shall award grants to public and private entities to cover the costs of research and development of drugs that diagnose or treat ALS and other severely debilitating neurodegenerative diseases.HHS shall also establish the Public-Private Partnership for Neurodegenerative Diseases between the National Institutes of Health, the FDA, and at least one eligible entity (generally, an institution of higher education or a nonprofit organization). The partnership shall support the development and regulatory review of drugs that address ALS and other rare neurodegenerative diseases.The FDA shall publish on its website a five-year action plan for fostering the development of drugs that improve or extend the lives of people living with rare neurodegenerative diseases."
        },
        {
            "Bill Number": "S. 1814 (117th)",
            "First Name": "Dianne  Feinstein",
            "Last Name": "cosponsor",
            "Role": "S. 1814 (117th)",
            "Bill Name": "Women Who Worked on the Home Front World War II Memorial Act",
            "Subject Areas": "Monuments and memorials, U.S. history, Women's employment",
            "Summary": "This bill authorizes the Women Who Worked on the Home Front Foundation to establish a commemorative work on federal land in the District of Columbia in commemoration of the commitment and service represented by women who worked on the home front during World War II.The foundation shall be solely responsible for the acceptance of contributions for, and payment of the expenses of, establishing the commemorative work.The establishment of the commemorative work shall be in accordance with the Commemorative Works Act.The bill prohibits federal funds from being used to pay any expense for the establishment of the commemorative work."
        },
        {
            "Bill Number": "S. 937 (117th)",
            "First Name": "Dianne  Feinstein",
            "Last Name": "cosponsor",
            "Role": "S. 937 (117th)",
            "Bill Name": "COVID-19 Hate Crimes Act",
            "Subject Areas": "Crime and Law Enforcement, Cardiovascular and respiratory health, Community life and organization, Crime prevention, Crime victims, Criminal investigation, prosecution, interrogation, Criminal justice information and records, Criminal procedure and sentencing, Department of Justice, Disability and health-based discrimination, Emergency medical services and trauma care, Executive agency funding and structure, Federal officials, Foreign language and bilingual programs, Government information and archives, Government studies and investigations, Hate crimes, Infectious and parasitic diseases, Law enforcement administration and funding, Law enforcement officers, Racial and ethnic relations, Religion, Sex, gender, sexual orientation discrimination, State and local government operations",
            "Summary": "This bill requires a designated officer or employee of the Department of Justice (DOJ) to facilitate the expedited review of hate crimes and reports of hate crimes.DOJ must issue guidance for state, local, and tribal law enforcement agencies on establishing online hate crime reporting processes, collecting data disaggregated by protected characteristic (e.g., race or national origin), and expanding education campaigns.Additionally, DOJ and the Department of Health and Human Services must issue guidance aimed at raising awareness of hate crimes during the COVID-19 (i.e., coronavirus disease 2019) pandemic.The bill establishes grants for states to create state-run hate crimes reporting hotlines. It also authorizes grants for states and local governments to implement the National Incident-Based Reporting System and to conduct law enforcement activities or crime reduction programs to prevent, address, or respond to hate crimes.Finally, in the case of an individual convicted of a hate crime offense and placed on supervised release, the bill allows a court to order that the individual participate in educational classes or community service as a condition of supervised release."
        },
        {
            "Bill Number": "S. 1714 (117th)",
            "First Name": "Dianne  Feinstein",
            "Last Name": "cosponsor",
            "Role": "S. 1714 (117th)",
            "Bill Name": "HAVANA Act of 2021",
            "Subject Areas": "Diplomacy, foreign officials, Americans abroad, Government employee pay, benefits, personnel management, Intelligence activities, surveillance, classified information, Neurological disorders, Worker safety and health",
            "Summary": "This bill specifically authorizes the Central Intelligence Agency, the Department of State, and other agencies to provide payments to agency personnel who incur brain injuries from hostilities while on assignment.Specifically, the bill allows agency personnel and their families to receive payments for brain injuries that are incurred (1) during a period of assignment to a foreign duty station; (2) in connection with war, insurgency, hostile acts, terrorist activity, or other agency-designated incidents; and (3) not as the result of willful misconduct.The bill's authority applies to injuries incurred before, on, or after the date of the bill's enactment. Agencies must submit classified reports on the bill's implementation, including the number of payments made and the amount of each payment.Since 2016, some intelligence, diplomatic, and other governmental personnel have reported experiencing unusual cognitive and neurological impairments while on assignment (particularly abroad), the source of which is currently under investigation. Symptoms were first reported by personnel stationed in Cuba and have since been collectively referred to as Havana Syndrome."
        },
        {
            "Bill Number": "S. 1086 (117th)",
            "First Name": "Dianne  Feinstein",
            "Last Name": "cosponsor",
            "Role": "S. 1086 (117th)",
            "Bill Name": "Jabara-Heyer NO HATE Act",
            "Subject Areas": "Crime and Law Enforcement, Congressional oversight, Criminal justice information and records, Criminal procedure and sentencing, Hate crimes, Law enforcement administration and funding, State and local government operations",
            "Summary": "This bill creates grants for state and local governments to combat hate crimes. It also authorizes additional penalties for hate crime offenses.Specifically, it establishes grants for states to create state-run hate crimes reporting hotlines. It also authorizes grants for states and local governments to implement the National Incident-Based Reporting System and to conduct law enforcement activities or crime reduction programs to prevent, address, or respond to hate crimes.Finally, in the case of an individual convicted of a hate crime offense and placed on supervised release, the bill allows a court to order that the individual participate in educational classes or community service as a condition of supervised release."
        },
        {
            "Bill Number": "S. 611 (117th)",
            "First Name": "Dianne  Feinstein",
            "Last Name": "cosponsor",
            "Role": "S. 611 (117th)",
            "Bill Name": "VOCA Fix to Sustain the Crime Victims Fund Act of 2021",
            "Subject Areas": "Crime and Law Enforcement, Civil actions and liability, Crime victims, Criminal investigation, prosecution, interrogation, Emergency medical services and trauma care, Government trust funds, Infectious and parasitic diseases, Law enforcement administration and funding, State and local government operations",
            "Summary": "This bill adds a new source of revenue for the Crime Victims Fund and makes changes to formula grants supported by the fund.Specifically, the bill directs revenues collected from deferred prosecution and non-prosecution agreements to be deposited into the Crime Victims Fund. Currently, such revenues are deposited into the general fund of the Treasury.Additionally, the bill increases the percentage—from 60% to 75%—of state compensation payments to crime victims in the prior fiscal year used to calculate formula grants for state victim compensation programs.Finally, the bill directs states to waive the matching requirement for recipients of state victim assistance formula grants during and for one year after a pandemic-related national emergency. It also allows states to waive the matching requirement pursuant to a policy established by the state."
        },
        {
            "Bill Number": "S. 587 (117th)",
            "First Name": "Dianne  Feinstein",
            "Last Name": "cosponsor",
            "Role": "S. 587 (117th)",
            "Bill Name": "Securing Inspector General Independence Act of 2021",
            "Subject Areas": "Government Operations and Politics, Congressional oversight, Employment discrimination and employee rights, Executive agency funding and structure, Federal officials, Government employee pay, benefits, personnel management, Government ethics and transparency, public corruption, Government studies and investigations, Presidents and presidential powers, Vice Presidents",
            "Summary": "This bill limits the circumstances under which the President or certain agency heads may remove an Inspector General or place an Inspector General on non-duty status.Before an Inspector General may be removed, Congress must be given a detailed account of the reasons for the removal and the Inspector General shall remain on the job for 30 days while Congress considers those reasons."
        },
        {
            "Bill Number": "S. 514 (117th)",
            "First Name": "Dianne  Feinstein",
            "Last Name": "cosponsor",
            "Role": "S. 514 (117th)",
            "Bill Name": "A bill to obtain and direct the placement in the Capitol or on the Capitol Grounds of a monument to honor Associate Justice of the Supreme Court of the United States Ruth Bader Ginsburg.",
            "Subject Areas": "Monuments and memorials, Supreme Court, U.S. Capitol",
            "Summary": "This bill requires the Joint Committee on the Library to obtain, and the Architect of the Capitol to permanently install in the U.S. Capitol or on the U.S. Capitol Grounds, a monument honoring Associate Justice of the Supreme Court Ruth Bader Ginsburg."
        },
        {
            "Bill Number": "S. 435 (117th)",
            "First Name": "Dianne  Feinstein",
            "Last Name": "cosponsor",
            "Role": "S. 435 (117th)",
            "Bill Name": "Secure Rural Schools Reauthorization Act of 2021",
            "Subject Areas": "Education programs funding, Educational technology and distance education, Elementary and secondary education, Fires, First responders and emergency personnel, Forests, forestry, trees, Internet and video services, Land use and conservation, Montana, Property tax, Public contracts and procurement, Rural conditions and development, State and local finance, State and local taxation",
            "Summary": "This bill extends through FY2023 payments made to states and eligible counties containing certain federal land under the Secure Rural Schools and Community Self-Determination Act of 2000.The Department of the Interior and the Department of Agriculture shall carry out a pilot program to allow the Chief of the Forest Service or the Director of the Bureau of Land Management to nominate members of resource advisory committees.County funds may be used to provide or expand access to (1) broadband telecommunications services at local schools, or (2) the technology and connectivity necessary for students to use a digital learning tool at or outside of a local school campus.Any county funds that were obligated by a county before October 1, 2017, but are unspent on October 1, 2020, may be used by the county for any authorized use and shall be available for projects initiated after October 1, 2020.No county funds may be used for lobbying activity, regardless of the purpose for which the funds are obligated on or before the enactment of this bill."
        },
        {
            "Bill Number": "S. 321 (117th)",
            "First Name": "Dianne  Feinstein",
            "Last Name": "cosponsor",
            "Role": "S. 321 (117th)",
            "Bill Name": "\\u201cSix Triple Eight\\u201d Congressional Gold Medal Act of 2021",
            "Subject Areas": "Military history, Military personnel and dependents, Minority employment, Museums, exhibitions, cultural centers, Postal service, Smithsonian Institution, Women's employment",
            "Summary": "This bill provides for the award of a Congressional Gold Medal to the women of the 6888th Central Postal Directory Battalion (commonly known as the Six Triple Eight) in recognition of their pioneering military service, devotion to duty, and contributions to increase the morale of personnel stationed in the European theater of operations during World War II."
        },
        {
            "Bill Number": "S. 26 (117th)",
            "First Name": "Dianne  Feinstein",
            "Last Name": "cosponsor",
            "Role": "S. 26 (117th)",
            "Bill Name": "Drug-Free Communities Pandemic Relief Act",
            "Subject Areas": "Health, Cardiovascular and respiratory health, Drug, alcohol, tobacco use, Emergency medical services and trauma care, Health programs administration and funding, Health promotion and preventive care, Infectious and parasitic diseases",
            "Summary": "This bill authorizes the Drug-Free Communities Support Program, subject to certain limitations, to waive matching funds requirements applicable to certain grants for reducing substance use among youth. Before waiving these requirements, the program must determine that a grantee is unable to raise funds because of the COVID-19 (i.e. coronavirus disease 2019) emergency.Currently, the Office of National Drug Control Policy administers this program, and community coalitions that receive the grants must match a specified percentage of the federal award amount with nonfederal funds, including in-kind contributions."
        },
        {
            "Bill Number": "S. 3975 (117th)",
            "First Name": "Dianne  Feinstein",
            "Last Name": "cosponsor",
            "Role": "S. 3975 (117th)",
            "Bill Name": "Victims of Child Abuse Act Reauthorization Act of 2022",
            "Subject Areas": "Crime and Law Enforcement",
            "Summary": NaN
        },
        {
            "Bill Number": "S. 2454 (117th)",
            "First Name": "Dianne  Feinstein",
            "Last Name": "cosponsor",
            "Role": "S. 2454 (117th)",
            "Bill Name": "Water Reuse and Resiliency Act of 2021",
            "Subject Areas": "Environmental Protection",
            "Summary": "This bill reauthorizes through FY2026 and revises a pilot program of the Environmental Protection Agency for alternative water source projects. The program, which was established under the Clean Water Act, provides grants to states, local agencies, private utilities, and nonprofit entities for alternative water source projects to meet critical water supply needs."
        },
        {
            "Bill Number": "S. 65 (117th)",
            "First Name": "Dianne  Feinstein",
            "Last Name": "cosponsor",
            "Role": "S. 65 (117th)",
            "Bill Name": "Uyghur Forced Labor Prevention Act",
            "Subject Areas": "Congressional oversight, Customs enforcement, Department of Homeland Security, Detention of persons, Diplomacy, foreign officials, Americans abroad, Employment discrimination and employee rights, Foreign property, Government information and archives, Human rights, Human trafficking, International organizations and cooperation, Labor standards, Racial and ethnic relations, Religion, Sanctions, Trade restrictions, Visas and passports, War crimes, genocide, crimes against humanity",
            "Summary": "This bill imposes importation limits on goods produced using forced labor in China, especially the Xinjiang Uyghur Autonomous Region, and imposes sanctions related to such forced labor.The Department of Homeland Security and the Department of the Treasury shall report to Congress a strategy for preventing the importation of goods produced in China using forced labor. The strategy must contain certain information, including a list of entities working with the government in Xinjiang to move forced labor or Uyghurs, Kazakhs, Kyrgyz, or members of other persecuted groups out of Xinjiang.The U.S. Customs and Border Protection shall generally presume that goods produced by these entities and certain other entities, generally those sourcing material from Xinjiang or involved with Chinese government forced labor programs, are barred from importation into the United States.The bill also expands existing asset- and visa-blocking sanctions related to Xinjiang to cover foreign individuals and entities responsible for serious human rights abuses in connection with forced labor.The Department of State shall report to Congress a strategy to enhance international awareness of forced labor in Xinjiang and to address such forced labor."
        },
        {
            "Bill Number": "S. 2283 (117th)",
            "First Name": "Dianne  Feinstein",
            "Last Name": "cosponsor",
            "Role": "S. 2283 (117th)",
            "Bill Name": "REACH for Veterans Act",
            "Subject Areas": "Armed Forces and National Security, Congressional oversight, Department of Veterans Affairs, Drug, alcohol, tobacco use, Emergency communications systems, Emergency medical services and trauma care, Government employee pay, benefits, personnel management, Government information and archives, Health promotion and preventive care, Mental health, Social work, volunteer service, charitable organizations, Telephone and wireless communication, Veterans' medical care, Veterans' organizations and recognition",
            "Summary": "This bill requires the Department of Veterans Affairs (VA) to update training and procedures for call responders of the Veterans Crisis Line.Specifically, the VA must enter into an agreement with an outside organization to review the training for crisis line call responders. The VA must update the training if any deficiencies are identified after the review.Among other requirements, the VA must develop guidelines on retraining and quality management for when a call responder has an adverse event or needs improvement, annually perform a common cause analysis for identified callers to the crisis line who died by suicide in situations where the crisis line was the last point of contact, develop enhanced guidance and procedures to respond to calls to the crisis line related to substance use and overdose risk, review the current emergency dispatch standard operating procedure of the crisis line, and solicit feedback from veterans service organizations on how to conduct outreach regarding the move to 988 as the new suicide and mental health crisis hotline. Each call responder must be subject to at least two calls per month that are silently monitored by a supervisor to check for quality of conduct.The Veterans Crisis Line, Office of Mental Health and Suicide Prevention of the VA, and National Center for Patient Safety of the VA must establish quality management processes and expectations for staff of the crisis line."
        },
        {
            "Bill Number": "S. 1061 (117th)",
            "First Name": "Dianne  Feinstein",
            "Last Name": "cosponsor",
            "Role": "S. 1061 (117th)",
            "Bill Name": "Israel Relations Normalization Act of 2021",
            "Subject Areas": "Congressional oversight, Criminal investigation, prosecution, interrogation, Diplomacy, foreign officials, Americans abroad, Economic development, Foreign aid and international relief, Foreign language and bilingual programs, Government information and archives, Health programs administration and funding, Human rights, International exchange and broadcasting, International organizations and cooperation, Iran, Israel, Middle East, Military assistance, sales, and agreements, Museums, exhibitions, cultural centers, Palestinians, Political movements and philosophies, Racial and ethnic relations, Religion, Rule of law and government transparency, Sovereignty, recognition, national governance and status, United Arab Emirates, War crimes, genocide, crimes against humanity, Water use and supply",
            "Summary": "This bill requires the Department of State to take certain actions promoting the normalization of relations between Israel, Arab states, and other relevant countries and regions.Specifically, the State Department must develop a strategy on expanding and strengthening the Abraham Accords (the term used to refer collectively to agreements between Israel and the United Arab Emirates and between Israel and Bahrain marking the public normalization of relations between the two Arab countries and Israel). The strategy must include a description of how the U.S. government will encourage further normalization of relations with Israel.The State Department must report on the status of efforts to promote normalization of relations with Israel and other countries, including information on (1) laws that punish individuals for people-to-people relations with Israelis (i.e., anti-normalization laws), and (2) instances of the use of state-owned or state-operated media outlets to promote the prosecution of citizens or residents of Arab countries calling for peace with Israel."
        },
        {
            "Bill Number": "S. 475 (117th)",
            "First Name": "Dianne  Feinstein",
            "Last Name": "cosponsor",
            "Role": "S. 475 (117th)",
            "Bill Name": "Juneteenth National Independence Day Act",
            "Subject Areas": "Civil Rights and Liberties, Minority Issues, Commemorative events and holidays, Racial and ethnic relations, U.S. history",
            "Summary": "This bill establishes Juneteenth National Independence Day, June 19, as a legal public holiday."
        },
        {
            "Bill Number": "S. 2032 (117th)",
            "First Name": "Dianne  Feinstein",
            "Last Name": "cosponsor",
            "Role": "S. 2032 (117th)",
            "Bill Name": "Afghan Allies Protection Act of 2021",
            "Subject Areas": "Immigration, Administrative remedies, Afghanistan, Asia, Conflicts and wars, Congressional oversight, Diplomacy, foreign officials, Americans abroad, Foreign labor, Foreign language and bilingual programs, Immigrant health and welfare, Immigration status and procedures, Medical tests and diagnostic methods, Military operations and strategy, Refugees, asylum, displaced persons, Visas and passports",
            "Summary": "This bill modifies a program providing special immigrant visas to eligible citizens or nationals of Afghanistan who assisted U.S. efforts there and addresses related issues.The bill extends the program through 2023 and increases the number of visas available.An individual may become eligible for a visa after assisting U.S. efforts in Afghanistan for one year, whereas currently some individuals must have served for two years. Furthermore, for an applicant qualifying for a visa by performing duties with a NATO mission in Afghanistan, the bill eliminates a requirement that the duties performed qualify as sensitive and trusted duties.The bill removes a requirement that the individual has experienced or is facing an ongoing serious threat due to their assistance to the United States or NATO.The Department of State or the Department of Homeland Security may postpone the program's medical examination requirement. An individual who received a postponement must undergo a medical exam within 90 days of admission into the United States.The bill also expands surviving family member benefits for the Afghanistan program (and a similar program for Iraq) to a surviving spouse or child of an individual who submitted an application to the Chief of Mission that would have been approved but for the individual's death. Currently, such survivor benefits only apply if the deceased individual's petition was approved."
        },
        {
            "Bill Number": "S. 1408 (117th)",
            "First Name": "Dianne  Feinstein",
            "Last Name": "cosponsor",
            "Role": "S. 1408 (117th)",
            "Bill Name": "A bill to posthumously award the Congressional Gold Medal, collectively, to Glen Doherty, Tyrone Woods, J. Christopher Stevens, and Sean Smith, in recognition of their contributions to the Nation.",
            "Subject Areas": "Intelligence activities, surveillance, classified information, Law enforcement officers, Libya, Middle East, Terrorism, Veterans' organizations and recognition",
            "Summary": "This bill provides for the award of Congressional Gold Medals posthumously to Glen Doherty, Tyrone Woods, J. Christopher Stevens, and Sean Smith (four Americans who were killed in the September 11, 2012, attack on the U.S. consulate in Benghazi, Libya) in recognition of their contributions to the nation."
        },
        {
            "Bill Number": "S. 1286 (117th)",
            "First Name": "Dianne  Feinstein",
            "Last Name": "cosponsor",
            "Role": "S. 1286 (117th)",
            "Bill Name": "Ensuring Compliance Against Drug Diversion Act of 2021",
            "Subject Areas": "Crime and Law Enforcement, Administrative law and regulatory procedures, Department of Justice, Drug trafficking and controlled substances, Licensing and registrations",
            "Summary": "This bill provides statutory authority for certain regulations governing the modification, transfer, and termination of a registration to manufacture, distribute, or dispense controlled substances. It terminates the registration of individuals and entities when they die, cease legal existence, discontinue business, or surrender such registration. It sets forth notification requirements, as well as conditions for transferring or assigning a registration."
        },
        {
            "Bill Number": "S. 1255 (117th)",
            "First Name": "Dianne  Feinstein",
            "Last Name": "cosponsor",
            "Role": "S. 1255 (117th)",
            "Bill Name": "Minority Business Resiliency Act of 2021",
            "Subject Areas": "Commerce, Accounting and auditing, Business education, Business investment and capital, Community life and organization, Competitiveness, trade promotion, trade deficits, Congressional oversight, Department of Commerce, Economic performance and conditions, Education programs funding, Employee hiring, Executive agency funding and structure, Federal officials, Government information and archives, Government studies and investigations, Higher education, Internet and video services, Manufacturing, Marketing and advertising, Minority and disadvantaged businesses, Public contracts and procurement, Public-private cooperation, Rural conditions and development, Small business, Social work, volunteer service, charitable organizations, Tax-exempt organizations, Teaching, teachers, curricula, User charges and fees",
            "Summary": "This bill permanently authorizes the Minority Business Development Agency (MBDA) and requires the MBDA to promote and administer programs that assist the development of minority business enterprises (MBEs).Specifically, the bill requires the MBDA to (1) provide assistance to MBEs in domestic and foreign markets by making available specified resources, (2) promote the position of MBEs in local economies, and (3) collect data on the causes of MBE success or failure and research how economic conditions affect the development of MBEs.The bill establishes formal processes for the MBDA Business Center Program and the MBDA Rural Business Center Program through which business centers provide programs and services to support MBEs.The bill also establishes new initiatives to promote economic resiliency for minority businesses, including (1) an annual forum to review problems and programs relating to capital formation by MBEs, (2) a study and report on alternative financing solutions for MBEs, and (3) entrepreneurship education grants for certain institutions of higher education to develop and implement entrepreneurship curricula.Further, the bill establishes grants for (1) certain nonprofit organizations that provide services to MBEs as one of their primary activities, and (2) MBEs for the purpose of supporting MBEs or helping MBEs remain in business.The Government Accountability Office must report on the programs carried out pursuant to the bill."
        },
        {
            "Bill Number": "S. 1210 (117th)",
            "First Name": "Dianne  Feinstein",
            "Last Name": "cosponsor",
            "Role": "S. 1210 (117th)",
            "Bill Name": "Big Cat Public Safety Act",
            "Subject Areas": "Animals, Animal protection and human-animal relationships, Civil actions and liability, Crimes against animals and natural resources, Mammals, Museums, exhibitions, cultural centers, Trade restrictions, Wildlife conservation and habitat protection",
            "Summary": "This bill revises requirements governing the trade of big cats (i.e., species of lion, tiger, leopard, cheetah, jaguar, or cougar or any hybrid of such species). Specifically, it revises restrictions on the possession and exhibition of big cats, including to restrict direct contact between the public and big cats."
        },
        {
            "Bill Number": "S. 3294 (117th)",
            "First Name": "Dianne  Feinstein",
            "Last Name": "cosponsor",
            "Role": "S. 3294 (117th)",
            "Bill Name": "A bill to obtain and direct the placement in the Capitol or on the Capitol Grounds of a statue to honor Associate Justice of the Supreme Court of the United States Sandra Day O\\u2019Connor and a statue to honor Associate Justice of the Suprem",
            "Subject Areas": "Art, artists, authorship, Congress, Congressional tributes, Government buildings, facilities, and property, Judges, Supreme Court, U.S. Capitol",
            "Summary": "This bill requires the Joint Committee on the Library to obtain, and the Architect of the Capitol to permanently install in the U.S. Capitol or on the U.S. Capitol Grounds, statues honoring Associate Justices of the Supreme Court Sandra Day O'Connor and Ruth Bader Ginsburg."
        },
        {
            "Bill Number": "S. 4573 (117th)",
            "First Name": "Dianne  Feinstein",
            "Last Name": "cosponsor",
            "Role": "S. 4573 (117th)",
            "Bill Name": "Electoral Count Reform and Presidential Transition Improvement Act of 2022",
            "Subject Areas": "Constitution and constitutional amendments, Elections, voting, political campaign regulation, Federal district courts, Federal officials, Government information and archives, Intergovernmental relations, Judges, Judicial review and appeals, Legislative rules and procedure, Presidents and presidential powers, Vice Presidents, State and local government operations, Supreme Court, Voting rights",
            "Summary": "This bill would mark the biggest correction to the process of counting since John-John corrected Herry Monster on Sesame Street.Context: 2020–21Joe Biden defeated Donald Trump in the 2020 presidential election. He won by both 306–232 in the Electoral College and by 51.3% to 46.8% in the popular vote, a difference of roughly seven million votes.During the subsequent two months between the election and its official certification in Congress, numerous attempts were made to change that result: by Donald Trump himself, by his legal team, by his Republican allies in Congress, and by thousands of his supporters during the violent insurrection upon the Capitol Building on January 6, 2021 while Congress officially counted and certified the Electoral College results.None of the Trump team’s attempts proved successful.The Supreme Court rejected all of the Trump team’s legal challenges. State election officials, even Republican ones, refused to change their election certifications. Congressional Republicans’ attempts to challenge several states’ results, notably for Biden-supporting Arizona and Pennsylvania, failed. And Vice President Mike Pence refused to go along with an obscure legal theory pushed by Trump and his allies that, as vice president, he could unilaterally refuse to certify the election results.Context: 1887Most of the current rules regarding all these procedures date back more than a century, to the Electoral Count Act of 1887.The law was inspired by the convoluted and heavily-disputed presidential election of 1876.First, the candidate who received a majority of the popular vote (Democrat Samuel Tilden) failed to earn a majority of the Electoral College. Then, several states sent competing rival slates of electors to Congress — the Democrats sending a Democratic slate, the Republicans sending a Republican slate. On top of that, Congress appointed an unprecedented 15-member commission to essentially decide which candidate should be declared the winner.By only a single vote, 8–7, the commission declared in favor of Republican Rutherford B. Hayes. That single deciding vote was cast by Supreme Court Justice David Davis, who had originally been nominated 14 years earlier by Abraham Lincoln.The 1887 law was controversial even at the time; a law review article only the next year called it “very confused, almost unintelligible.” One of the law’s sentences even runs 275 words long.For about 134 years, though, it arguably worked well enough. That is, until the events of 2020–21 laid bare several potential landmines in America’s electoral system which the law wouldn’t prevent — or, in some cases, would even inadvertently create.What the bill doesThe Electoral Count Reform and Presidential Transition Improvement Act would make several policy changes:Clarify the vice president’s role. Under current law, Congress counts and certifies the Electoral College votes to make it official, during a process led by the vice president, per their role as the president of the Senate%20presides.). This bill would clarify that the vice president’s role in the Electoral College certification is purely ceremonial, and that they don’t actually have the power to change, overrule, or nullify any part of the count.Raises the threshold for Congress to object. Under current law, only one House member and one senator need to object to a state’s Electoral College certification, in order for Congress to vote on whether to exclude that state’s electors. For the 2020 election, those two thresholds were far exceeded: for Arizona, 121 House members and six senators objected; for Pennsylvania, 138 House members and seven senators. This bill would increase both thresholds for objection to one-fifth of both the House and Senate. Had this bill been law at the time, the Senate wouldn’t have met that threshold (although the House still would have).Clarifies which electors count. In case two or more factions within a state each try to send competing slates of electors to Congress for the official count, this bill lays out means for Congress to identify a single slate of electors from each state. It requires Congress to identify one state official (often the secretary of state) responsible for certifying their state’s electors, and requires the state’s electors themselves to be appointed prior to Election Day.**Harder to declare a “failed election.” **The bill also overturns a provision from the Presidential Election Day Act of 1845, which allows a state’s legislature to override their state’s popular vote if the legislature declares a “failed election.” Several states considered this option, namely ones in which the populace voted for Biden even though the legislature was still controlled by Republicans. (No state actually followed through.) This bill would only allow a legislature to override in case of “extraordinary and catastrophic” events.The bill was introduced in the Senate on July 20 as S. 4573, by Sen. Susan Collins (R-ME).What supporters saySupporters argue that the 2020 election was a near-disaster for the American system’s peaceful transfer of power, and 2024 or another future election could be a breaking point unless we fix the laws now.“We have before us an historic opportunity to modernize and strengthen our system of certifying and counting the electoral votes for president and vice president,” Sen. Collins said in committee testimony. “The idea that any vice president would have the power to unilaterally accept, reject, change, or halt the counting of electoral votes is antithetical to our constitutional structure and basic democratic principles.”“Nothing is more essential to the survival of a democracy than the orderly transfer of power,” Sen. Collins continued. “And there is nothing more essential to the orderly transfer of power than clear rules for effecting it.”What opponents sayThere are very few public objectors to this legislation. “There has been notably little public opposition to the heart of the bill,” University of Iowa law professor Derek T. Muller wrote in congressional testimony, “and the bulk of that rare concern rests largely on misunderstandings of the text or technical problems that can be readily corrected.”Norm Eisen — formerly Ambassador to the Czech Republic and now senior fellow in governance studies at Brookings — supports the legislation overall, but noted at least three further changes he still found necessary.The bill “allows the extension of Election Day due to ‘extraordinary and catastrophic events,’” Eisen wrote in his own congressional testimony. “The phrase ‘extraordinary and catastrophic events’ should be better defined to avoid manipulation by the election-denying officials now running to take control of the electoral process.”“Adjustments must be made to the scant six-day window for federal litigation under the [bill],” Eisen continued. “There must be adequate time for any federal litigation should governors or others wrongly certify or refuse to certify electors or otherwise abuse the process. Six days is insufficient.”“To strengthen safeguards when the process moves to Congress, [the bill] should consider clarifying the grounds for objection by replacing undefined and malleable terms preserved from the current [law] such as ‘lawfully certified’ and ‘regularly given,’” Eisen concluded, “terms which have been a proven source of abuse in the past.”Odds of passageIn addition to its Republican lead sponsor, the bill has attracted 17 bipartisan cosponsors: nine Republicans and eight Democrats. It awaits a potential vote in the Senate Rules and Administration Committee, which held a hearing on the bill in August.  Last updated Sep 16, 2022.View all GovTrack summaries.The summary below was written by the Congressional Research Service, which is a nonpartisan division of the Library of Congress, and was published on Oct 25, 2022.Electoral Count Reform and Presidential Transition Improvement Act of 2022This bill revises the process of casting and counting electoral votes for presidential elections. The bill also revises provisions related to the presidential transition process.The bill specifies that the choice of electors must occur in accordance with the laws of the state enacted prior to election day.Additionally, the bill identifies each state's governor (unless otherwise identified in the laws or constitution of a state in effect on election day) as responsible for submitting the certificate of ascertainment identifying the state's electors. Further, the bill provides for expedited judicial review for any action brought by an aggrieved presidential or vice-presidential candidate arising under the U.S. Constitution or U.S. laws with respect to the issuance or transmission of such a certificate.The bill revises the framework for the joint session of Congress to count electoral votes and make a formal declaration of which candidates have been elected President and Vice President. Among other changes, the bill (1) specifies that the role of the Vice President during the joint session shall be ministerial in nature, and (2) raises the objection threshold in Congress to at least one-fifth of the duly chosen and sworn members of both the House of Representatives and the Senate.The bill also revises the presidential transition process, including to (1) allow more than one candidate to receive federal transition resources under certain circumstances, and (2) require additional reporting by the General Services Administration."
        },
        {
            "Bill Number": "S. 4649 (117th)",
            "First Name": "Dianne  Feinstein",
            "Last Name": "cosponsor",
            "Role": "S. 4649 (117th)",
            "Bill Name": "Global Food Security Reauthorization Act of 2022",
            "Subject Areas": "Agricultural trade, Aquaculture, Child health, Congressional oversight, Food assistance and relief, Food industry and services, Food supply, safety, and labeling, Foreign aid and international relief, Forests, forestry, trees, Livestock, Marine and coastal resources, fisheries, Nutrition and diet, Rural conditions and development, Water quality, Women in business, Women's health, World health",
            "Summary": NaN
        },
        {
            "Bill Number": "S.J.Res. 15 (117th)",
            "First Name": "Dianne  Feinstein",
            "Last Name": "cosponsor",
            "Role": "S.J.Res. 15 (117th)",
            "Bill Name": "A joint resolution providing for congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the Office of the Comptroller of Currency relating to \\u201cNational Banks and Federal Savings Association",
            "Subject Areas": "Credit and credit markets, Department of the Treasury",
            "Summary": NaN
        },
        {
            "Bill Number": "S.J.Res. 14 (117th)",
            "First Name": "Dianne  Feinstein",
            "Last Name": "cosponsor",
            "Role": "S.J.Res. 14 (117th)",
            "Bill Name": "A joint resolution providing for congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the Environmental Protection Agency relating to \\u201cOil and Natural Gas Sector: Emission Standards for N",
            "Subject Areas": "Congressional oversight, Environmental Protection Agency (EPA), Environmental regulatory procedures, Environmental technology, Industrial facilities, Oil and gas",
            "Summary": NaN
        }
    ],
    "SponsoredBills": [
        {
            "Bill Number": "S. 144 (117th)",
            "First Name": "Dianne  Feinstein",
            "Last Name": "sponsor",
            "Role": "S. 144 (117th)",
            "Bill Name": "Desert Sage Youth Wellness Center Access Improvement Act",
            "Subject Areas": "Native Americans, California, Child health, Drug, alcohol, tobacco use, Health facilities and institutions, Land transfers, Minority health, Roads and highways",
            "Summary": "This bill authorizes the Indian Health Service (IHS) to purchase certain private land in Hemet, California, at fair market value and then construct a paved road on that land to facilitate access to the Desert Sage Youth Wellness Center. The IHS shall maintain the road or enter an agreement with Riverside County, California, to maintain the road."
        },
        {
            "Bill Number": "S. 253 (117th)",
            "First Name": "Dianne  Feinstein",
            "Last Name": "sponsor",
            "Role": "S. 253 (117th)",
            "Bill Name": "Cannabidiol and Marihuana Research Expansion Act",
            "Subject Areas": "Drug trafficking and controlled substances, Drug, alcohol, tobacco use, Health personnel, Health programs administration and funding, Licensing and registrations, Medical research, Public-private cooperation, Research administration and funding, Trade restrictions",
            "Summary": "This bill establishes a new, separate registration process to facilitate research on marijuana.Specifically, the bill directs the Drug Enforcement Administration (DEA) to follow specified procedures to register (1) practitioners to conduct marijuana research, and (2) manufacturers to supply marijuana for the research.The bill allows certain registered entities (including institutions of higher education, practitioners, and manufacturers) to manufacture, distribute, dispense, or possess marijuana or cannabidiol (CBD) for the purposes of medical research. Additionally, the bill directs the DEA to register manufacturers and distributors of CBD or marijuana for the purpose of commercial production of an approved drug that contains marijuana or its derivative.Finally, the bill includes various other provisions, including provisions that require the DEA to assess whether there is an adequate and uninterrupted supply of marijuana for research purposes; prohibit the Department of Health and Human Services (HHS) from reinstating the interdisciplinary review process for marijuana research; allow physicians to discuss the potential harms and benefits of marijuana and its derivatives (including CBD) with patients; and require HHS, in coordination with the National Institutes of Health and relevant federal agencies, to report on the therapeutic potential of marijuana for various conditions such as epilepsy, as well as the impact on adolescent brains and on the ability to operate a motor vehicle."
        },
        {
            "Bill Number": "S. 3623 (117th)",
            "First Name": "Dianne  Feinstein",
            "Last Name": "sponsor",
            "Role": "S. 3623 (117th)",
            "Bill Name": "Violence Against Women Act Reauthorization Act of 2022",
            "Subject Areas": "Crime and Law Enforcement, Administrative remedies, Advisory bodies, Aging, Assault and harassment offenses, Cardiovascular and respiratory health, Child health, Child safety and welfare, Civil actions and liability, Commemorative events and holidays, Computer security and identity theft, Congressional oversight, Crime prevention, Crime victims, Crimes against children, Crimes against women, Criminal investigation, prosecution, interrogation, Criminal justice information and records, Criminal procedure and sentencing, Department of Justice, Detention of persons, Disability and paralysis, Domestic violence and child abuse, Drug, alcohol, tobacco use, Education programs funding, Elementary and secondary education, Emergency medical services and trauma care, Evidence and witnesses, Executive agency funding and structure, Federal officials, Firearms and explosives, Genetics, Government information and archives, Government studies and investigations, Health care coverage and access, Health facilities and institutions, Health information and medical records, Health personnel, Health programs administration and funding, Health promotion and preventive care, Higher education, Homelessness and emergency shelter, Housing and community development funding, Housing supply and affordability, Human trafficking, Indian social and development programs, Infectious and parasitic diseases, Intergovernmental relations, Judicial procedure and administration, Law enforcement administration and funding, Law enforcement officers, Marriage and family status, Medical education, Medical tests and diagnostic methods, Minority health, Nursing, Photography and imaging, Pornography, Rural conditions and development, Separation, divorce, custody, support, Sex offenses, Sex, gender, sexual orientation discrimination, Small business, Smuggling and trafficking, Social work, volunteer service, charitable organizations, State and local courts, State and local government operations, Violent crime, Women's health",
            "Summary": "This bill modifies and reauthorizes through FY2027 programs and activities under the Violence Against Women Act that seek to prevent and respond to domestic violence, sexual assault, dating violence, and stalking.The bill also authorizes new programs, makes changes to federal criminal laws, and establishes new protections to promote housing stability and economic security for victims of domestic violence, sexual assault, dating violence, and stalking."
        },
        {
            "Bill Number": "S. 273 (117th)",
            "First Name": "Dianne  Feinstein",
            "Last Name": "sponsor",
            "Role": "S. 273 (117th)",
            "Bill Name": "Driftnet Modernization and Bycatch Reduction Act",
            "Subject Areas": "Marine and coastal resources, fisheries, Pacific Ocean",
            "Summary": "This bill addresses certain driftnet fishing. Driftnet fishing is a method of fishing in which a gillnet composed of a panel or panels of webbing, or a series of such gillnets, is placed in the water and allowed to drift with the currents and winds for the purpose of entangling fish in the webbing.Currently, the use of large-scale drift gillnets with a total length of 2.5 kilometers or more is prohibited in the United States.The bill expands the definition of large-scale driftnet fishing to prohibit the use of gillnets with a mesh size of 14 inches or greater. This expanded prohibition does not apply within the U.S. exclusive economic zone for five years.The Department of Commerce must conduct a transition program to facilitate the phase out of large-scale driftnet fishing and to promote the adoption of alternative fishing practices that minimize the incidental catch of living marine resources.Commerce must award grants to program participants.The North Pacific Fishery Management Council may recommend and Commerce may approve regulations that require charter operators to pay fees on vessels that harvest Pacific halibut in specific International Pacific Halibut Commission regulatory areas."
        },
        {
            "Bill Number": "S. 1906 (117th)",
            "First Name": "Dianne  Feinstein",
            "Last Name": "sponsor",
            "Role": "S. 1906 (117th)",
            "Bill Name": "San Francisco Bay Restoration Act of 2021",
            "Subject Areas": "Environmental Protection, Air quality, Budget process, California, Climate change and greenhouse gases, Congressional oversight, Endangered and threatened species, Environmental Protection Agency (EPA), Executive agency funding and structure, Federal officials, Marine and coastal resources, fisheries, Marine pollution, Solid waste and recycling, Water quality, Watersheds, Wetlands, Wildlife conservation and habitat protection",
            "Summary": "This bill provides support for the protection and restoration of the San Francisco Bay estuary and the recovery of certain species in the estuary.Specifically, it establishes a San Francisco Bay Program Office in the Environmental Protection Agency.The program must annually compile a list of funding priorities for projects or studies that advance the goals and objectives of the comprehensive conservation and management plan approved under the National Estuary Program for the San Francisco Bay estuary. The list must include projects or studies for water quality improvement; wetland, riverine, and estuary restoration and protection; nearshore and endangered species recovery; and adaptation to climate change. The program must review such plan at least once every five years and revise the plan as appropriate.The program may provide funding through grants or other means for studies or projects on the priority list."
        },
        {
            "Bill Number": "S. 102 (117th)",
            "First Name": "Dianne  Feinstein",
            "Last Name": "sponsor",
            "Role": "S. 102 (117th)",
            "Bill Name": "West Los Angeles VA Campus Improvement Act of 2021",
            "Subject Areas": "Executive agency funding and structure, Government buildings, facilities, and property, Health facilities and institutions, Homelessness and emergency shelter, Land use and conservation, Veterans' loans, housing, homeless programs, Veterans' medical care",
            "Summary": "This bill requires that land use revenues received by the Department of Veterans Affairs (VA) in connection with the use of an easement, certain leases, or third-party land use at the VA's West Los Angeles Campus in Los Angeles, California, be used exclusively for specified purposes on campus.The bill prescribes that such revenues be used exclusively for the renovation and maintenance of the land and facilities at the campus; supporting construction, maintenance, and services at the campus relating to temporary or permanent supportive housing for homeless or at-risk veterans and their families; implementing minor construction projects at the campus; or implementing community operations at the campus that support the development of emergency shelter or supportive housing for homeless or at-risk veterans and their families."
        }
    ],
    "VotingRecord": [
        {
            "Bill Number": "S. 5355 (117th)",
            "First Name": "Dianne Feinstein",
            "Vote": "Nay",
            "Bill Number.1": "S. 53",
            "Bill Name": "Combating Global Corruption Act of 2023",
            "Summary": "This bill requires the Department of State to address corruption in foreign governments.The State Department must annually publish a tiered ranking of foreign countries based on their government's efforts to eliminate corruption.The bill outlines the minimum standards that the State Department must consider when creating the ranking, such as whether a country has criminalized corruption, adopted measures to prevent corruption, and complied with the United Nations Convention Against Corruption and other relevant international agreements. Tier one countries meet the standards; tier two countries make some efforts to meet the standards; tier three countries make de minimis or no efforts to meet the standards.If a country is ranked in the second or third tier, the State Department must designate an anti-corruption contact at the U.S. diplomatic post in that country to promote good governance and combat corruption.The State Department must report annually to Congress a list of foreign persons (individuals or entities) (1) who have engaged in significant corruption in a tier three country, and (2) upon whom the President has imposed sanctions pursuant to this bill.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "S. 1605 (117th)",
            "First Name": "Dianne Feinstein",
            "Vote": "Yea",
            "Bill Number.1": "S. 1605 (117th)",
            "Bill Name": "National Defense Authorization Act for Fiscal Year 2022",
            "Summary": "This bill was previously a companion bill to H.R. 49, but its text was completely replaced with the military spending provisions in the Dec. 7, 2021 House vote, after H.R. 49 was enacted.  Last updated Dec 11, 2021.View all GovTrack summaries.The summary below was written by the Congressional Research Service, which is a nonpartisan division of the Library of Congress, and was published on Jan 26, 2022.National Defense Authorization Act for Fiscal Year 2022This bill authorizes Department of Defense (DOD) activities and programs for FY2022 and addresses various other issues.For example, the bill provides or extends procurement authority for certain helicopters and amphibious shipbuilding programs; imposes various cost and operational limits on the F-35 aircraft program; provides statutory authority related to DOD Science and Technology Reinvention Laboratories, including direct hire authority with respect to advanced degree holders for positions at such laboratories; authorizes DOD to establish a consortium of institutions of higher education to study irregular warfare; establishes pilot programs for using private-sector partnerships to promote technology transition, deploying fifth-generation wireless telecommunications services on military installations, and digitally optimizing organic industrial base maintenance and repair operations; extends and modifies authorities to assist vetted Syrian groups and individuals, provide assistance to counter the Islamic State of Iraq and Syria, and support the activities of the Office of Security Cooperation in Iraq; extends and modifies the Indo-Pacific Maritime Security Initiative and the Pacific Deterrence Initiative; extends a pilot program providing regional cybersecurity training for members of the Army National Guard; establishes a program within the Cybersecurity and Infrastructure Security Agency to continuously monitor cybersecurity risks to critical infrastructure entities that support national critical functions; authorizes a Department of Energy program to improve defense environmental cleanup processes; authorizes the establishment of an Assistant Secretary for International Narcotics and Law Enforcement Affairs within the Department of State; and imposes limits on when the State Department may use a nonstandard design when constructing an embassy or consulate compound.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "S. 610 (117th)",
            "First Name": "Dianne Feinstein",
            "Vote": "Yea",
            "Bill Number.1": "S. 610 (117th)",
            "Bill Name": "Protecting Medicare and American Farmers from Sequester Cuts Act",
            "Summary": "This bill makes several budgetary, technical, and procedural changes, particularly in relation to Medicare and increasing the debt limit.Specifically, the bill continues to exempt Medicare from sequestration until March 31, 2022. (Sequestration is a process of automatic, usually across-the-board spending reductions under which budgetary resources are permanently cancelled to enforce specific budget policy goals.)The bill also establishes expedited Senate procedures for considering legislation to increase the debt limit. The procedures limit debate, waive points of order, and prohibit amendments. The procedures may only be used once and expire after January 16, 2022.Additionally, the bill (1) temporarily extends other provisions under Medicare, including a payment increase under the physician fee schedule; and (2) requires any debits recorded for FY2022 on the statutory pay-as-you-go (PAYGO) scorecards to be deducted from the scorecards for 2022 and added to the scorecards for 2023.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "S.J.Res. 29",
            "First Name": "Dianne Feinstein",
            "Vote": "Nay",
            "Bill Number.1": "S.J.Res. 29",
            "Bill Name": "A joint resolution providing for the reappointment of Michael Govan as a citizen regent of the Board of Regents of the Smithsonian Institution.",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "S. 1301",
            "First Name": "Dianne Feinstein",
            "Vote": "Yea",
            "Bill Number.1": "S. 1301",
            "Bill Name": "[Increase of Public Debt Limit]",
            "Summary": "This bill became the vehicle for passage of the public debt limit increase with the House vote on September 29, 2021. Prior to the House vote on that date, the bill was the Promoting Physical Activity for Americans Act, a bill on an unrelated subject.  Last updated Oct 8, 2021.View all GovTrack summaries.The summary below was written by the Congressional Research Service, which is a nonpartisan division of the Library of Congress, and was published on Oct 15, 2021.This bill increases the public debt limit by $480 billion.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "S.J.Res. 13 (117th)",
            "First Name": "Dianne Feinstein",
            "Vote": "Yea",
            "Bill Number.1": "S.J.Res. 13 (117th)",
            "Bill Name": "A joint resolution providing for congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the Equal Employment Opportunity Commission relating to \\u201cUpdate of Commission\\u2019s Conciliation Procedur",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "S.J.Res. 15 (117th)",
            "First Name": "Dianne Feinstein",
            "Vote": "Yea",
            "Bill Number.1": "S.J.Res. 15 (117th)",
            "Bill Name": "A joint resolution providing for congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the Office of the Comptroller of Currency relating to \\u201cNational Banks and Federal Savings Association",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "S. 914 (117th)",
            "First Name": "Dianne Feinstein",
            "Vote": "Yea",
            "Bill Number.1": "S. 914 (117th)",
            "Bill Name": "Drinking Water and Wastewater Infrastructure Act of 2021",
            "Summary": "This bill reauthorizes through FY2026 or establishes a variety of programs for water infrastructure. Specifically, it supports programs to provide safe drinking water or treat wastewater, such as sewer overflows or stormwater. For example, the bill reauthorizes and revises the clean water state revolving fund (SRF) and the drinking water SRF.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "S.J.Res. 14 (117th)",
            "First Name": "Dianne Feinstein",
            "Vote": "Yea",
            "Bill Number.1": "S.J.Res. 14 (117th)",
            "Bill Name": "A joint resolution providing for congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the Environmental Protection Agency relating to \\u201cOil and Natural Gas Sector: Emission Standards for N",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "S. 937 (117th)",
            "First Name": "Dianne Feinstein",
            "Vote": "Yea",
            "Bill Number.1": "S. 937 (117th)",
            "Bill Name": "COVID-19 Hate Crimes Act",
            "Summary": "This bill requires a designated officer or employee of the Department of Justice (DOJ) to facilitate the expedited review of hate crimes and reports of hate crimes.DOJ must issue guidance for state, local, and tribal law enforcement agencies on establishing online hate crime reporting processes, collecting data disaggregated by protected characteristic (e.g., race or national origin), and expanding education campaigns.Additionally, DOJ and the Department of Health and Human Services must issue guidance aimed at raising awareness of hate crimes during the COVID-19 (i.e., coronavirus disease 2019) pandemic.The bill establishes grants for states to create state-run hate crimes reporting hotlines. It also authorizes grants for states and local governments to implement the National Incident-Based Reporting System and to conduct law enforcement activities or crime reduction programs to prevent, address, or respond to hate crimes.Finally, in the case of an individual convicted of a hate crime offense and placed on supervised release, the bill allows a court to order that the individual participate in educational classes or community service as a condition of supervised release.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "S.Amdt. 125 (Sullivan) to H.R. 3746",
            "First Name": "Dianne Feinstein",
            "Vote": "Not Voting",
            "Bill Number.1": "H.R. 3746",
            "Bill Name": "Fiscal Responsibility Act of 2023",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "S.Amdt. 106 (Cotton) to H.R. 3746",
            "First Name": "Dianne Feinstein",
            "Vote": "Nay",
            "Bill Number.1": "H.R. 3746",
            "Bill Name": "Fiscal Responsibility Act of 2023",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "S.Amdt. 134 (Budd) to H.R. 3746",
            "First Name": "Dianne Feinstein",
            "Vote": "Nay",
            "Bill Number.1": "H.R. 3746",
            "Bill Name": "Fiscal Responsibility Act of 2023",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "S.Amdt. 101 (Kaine) to H.R. 3746",
            "First Name": "Dianne Feinstein",
            "Vote": "Nay",
            "Bill Number.1": "H.R. 3746",
            "Bill Name": "Fiscal Responsibility Act of 2023",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "S.Amdt. 98 (Lee) to H.R. 3746",
            "First Name": "Dianne Feinstein",
            "Vote": "Nay",
            "Bill Number.1": "H.R. 3746",
            "Bill Name": "Fiscal Responsibility Act of 2023",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "S.Amdt. 93 (Hawley) to H.R. 3746",
            "First Name": "Dianne Feinstein",
            "Vote": "Not Voting",
            "Bill Number.1": "H.R. 3746",
            "Bill Name": "Fiscal Responsibility Act of 2023",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "S.Amdt. 104 (Kennedy) to H.R. 3746",
            "First Name": "Dianne Feinstein",
            "Vote": "Not Voting",
            "Bill Number.1": "H.R. 3746",
            "Bill Name": "Fiscal Responsibility Act of 2023",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "S.Amdt. 110 (Marshall) to H.R. 3746",
            "First Name": "Dianne Feinstein",
            "Vote": "Not Voting",
            "Bill Number.1": "H.R. 3746",
            "Bill Name": "Fiscal Responsibility Act of 2023",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "S.Amdt. 91 (Braun) to H.R. 3746",
            "First Name": "Dianne Feinstein",
            "Vote": "Not Voting",
            "Bill Number.1": "H.R. 3746",
            "Bill Name": "Fiscal Responsibility Act of 2023",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "S.Amdt. 107 (Paul) to H.R. 3746",
            "First Name": "Dianne Feinstein",
            "Vote": "Not Voting",
            "Bill Number.1": "H.R. 3746",
            "Bill Name": "Fiscal Responsibility Act of 2023",
            "Summary": NaN,
            "Status": "Enacted"
        }
    ]
}