{
    "Name": "James “Jim”  Inhofe",
    "VotingRecord": [
        {
            "Bill Number": "S. 5355 (117th)",
            "First Name": "James “Jim” Inhofe",
            "Vote": "Nay",
            "Bill Number.1": "S. 53",
            "Bill Name": "Combating Global Corruption Act of 2023",
            "Summary": "This bill requires the Department of State to address corruption in foreign governments.The State Department must annually publish a tiered ranking of foreign countries based on their government's efforts to eliminate corruption.The bill outlines the minimum standards that the State Department must consider when creating the ranking, such as whether a country has criminalized corruption, adopted measures to prevent corruption, and complied with the United Nations Convention Against Corruption and other relevant international agreements. Tier one countries meet the standards; tier two countries make some efforts to meet the standards; tier three countries make de minimis or no efforts to meet the standards.If a country is ranked in the second or third tier, the State Department must designate an anti-corruption contact at the U.S. diplomatic post in that country to promote good governance and combat corruption.The State Department must report annually to Congress a list of foreign persons (individuals or entities) (1) who have engaged in significant corruption in a tier three country, and (2) upon whom the President has imposed sanctions pursuant to this bill.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "S. 1605 (117th)",
            "First Name": "James “Jim” Inhofe",
            "Vote": "Yea",
            "Bill Number.1": "S. 1605 (117th)",
            "Bill Name": "National Defense Authorization Act for Fiscal Year 2022",
            "Summary": "This bill was previously a companion bill to H.R. 49, but its text was completely replaced with the military spending provisions in the Dec. 7, 2021 House vote, after H.R. 49 was enacted.  Last updated Dec 11, 2021.View all GovTrack summaries.The summary below was written by the Congressional Research Service, which is a nonpartisan division of the Library of Congress, and was published on Jan 26, 2022.National Defense Authorization Act for Fiscal Year 2022This bill authorizes Department of Defense (DOD) activities and programs for FY2022 and addresses various other issues.For example, the bill provides or extends procurement authority for certain helicopters and amphibious shipbuilding programs; imposes various cost and operational limits on the F-35 aircraft program; provides statutory authority related to DOD Science and Technology Reinvention Laboratories, including direct hire authority with respect to advanced degree holders for positions at such laboratories; authorizes DOD to establish a consortium of institutions of higher education to study irregular warfare; establishes pilot programs for using private-sector partnerships to promote technology transition, deploying fifth-generation wireless telecommunications services on military installations, and digitally optimizing organic industrial base maintenance and repair operations; extends and modifies authorities to assist vetted Syrian groups and individuals, provide assistance to counter the Islamic State of Iraq and Syria, and support the activities of the Office of Security Cooperation in Iraq; extends and modifies the Indo-Pacific Maritime Security Initiative and the Pacific Deterrence Initiative; extends a pilot program providing regional cybersecurity training for members of the Army National Guard; establishes a program within the Cybersecurity and Infrastructure Security Agency to continuously monitor cybersecurity risks to critical infrastructure entities that support national critical functions; authorizes a Department of Energy program to improve defense environmental cleanup processes; authorizes the establishment of an Assistant Secretary for International Narcotics and Law Enforcement Affairs within the Department of State; and imposes limits on when the State Department may use a nonstandard design when constructing an embassy or consulate compound.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "S. 610 (117th)",
            "First Name": "James “Jim” Inhofe",
            "Vote": "Nay",
            "Bill Number.1": "S. 610 (117th)",
            "Bill Name": "Protecting Medicare and American Farmers from Sequester Cuts Act",
            "Summary": "This bill makes several budgetary, technical, and procedural changes, particularly in relation to Medicare and increasing the debt limit.Specifically, the bill continues to exempt Medicare from sequestration until March 31, 2022. (Sequestration is a process of automatic, usually across-the-board spending reductions under which budgetary resources are permanently cancelled to enforce specific budget policy goals.)The bill also establishes expedited Senate procedures for considering legislation to increase the debt limit. The procedures limit debate, waive points of order, and prohibit amendments. The procedures may only be used once and expire after January 16, 2022.Additionally, the bill (1) temporarily extends other provisions under Medicare, including a payment increase under the physician fee schedule; and (2) requires any debits recorded for FY2022 on the statutory pay-as-you-go (PAYGO) scorecards to be deducted from the scorecards for 2022 and added to the scorecards for 2023.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "S.J.Res. 29",
            "First Name": "James “Jim” Inhofe",
            "Vote": "Yea",
            "Bill Number.1": "S.J.Res. 29",
            "Bill Name": "A joint resolution providing for the reappointment of Michael Govan as a citizen regent of the Board of Regents of the Smithsonian Institution.",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "S. 1301",
            "First Name": "James “Jim” Inhofe",
            "Vote": "Nay",
            "Bill Number.1": "S. 1301",
            "Bill Name": "[Increase of Public Debt Limit]",
            "Summary": "This bill became the vehicle for passage of the public debt limit increase with the House vote on September 29, 2021. Prior to the House vote on that date, the bill was the Promoting Physical Activity for Americans Act, a bill on an unrelated subject.  Last updated Oct 8, 2021.View all GovTrack summaries.The summary below was written by the Congressional Research Service, which is a nonpartisan division of the Library of Congress, and was published on Oct 15, 2021.This bill increases the public debt limit by $480 billion.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "S.J.Res. 13 (117th)",
            "First Name": "James “Jim” Inhofe",
            "Vote": "Nay",
            "Bill Number.1": "S.J.Res. 13 (117th)",
            "Bill Name": "A joint resolution providing for congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the Equal Employment Opportunity Commission relating to \\u201cUpdate of Commission\\u2019s Conciliation Procedur",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "S.J.Res. 15 (117th)",
            "First Name": "James “Jim” Inhofe",
            "Vote": "Nay",
            "Bill Number.1": "S.J.Res. 15 (117th)",
            "Bill Name": "A joint resolution providing for congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the Office of the Comptroller of Currency relating to \\u201cNational Banks and Federal Savings Association",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "S. 914 (117th)",
            "First Name": "James “Jim” Inhofe",
            "Vote": "Yea",
            "Bill Number.1": "S. 914 (117th)",
            "Bill Name": "Drinking Water and Wastewater Infrastructure Act of 2021",
            "Summary": "This bill reauthorizes through FY2026 or establishes a variety of programs for water infrastructure. Specifically, it supports programs to provide safe drinking water or treat wastewater, such as sewer overflows or stormwater. For example, the bill reauthorizes and revises the clean water state revolving fund (SRF) and the drinking water SRF.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "S.J.Res. 14 (117th)",
            "First Name": "James “Jim” Inhofe",
            "Vote": "Nay",
            "Bill Number.1": "S.J.Res. 14 (117th)",
            "Bill Name": "A joint resolution providing for congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the Environmental Protection Agency relating to \\u201cOil and Natural Gas Sector: Emission Standards for N",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "S. 937 (117th)",
            "First Name": "James “Jim” Inhofe",
            "Vote": "Yea",
            "Bill Number.1": "S. 937 (117th)",
            "Bill Name": "COVID-19 Hate Crimes Act",
            "Summary": "This bill requires a designated officer or employee of the Department of Justice (DOJ) to facilitate the expedited review of hate crimes and reports of hate crimes.DOJ must issue guidance for state, local, and tribal law enforcement agencies on establishing online hate crime reporting processes, collecting data disaggregated by protected characteristic (e.g., race or national origin), and expanding education campaigns.Additionally, DOJ and the Department of Health and Human Services must issue guidance aimed at raising awareness of hate crimes during the COVID-19 (i.e., coronavirus disease 2019) pandemic.The bill establishes grants for states to create state-run hate crimes reporting hotlines. It also authorizes grants for states and local governments to implement the National Incident-Based Reporting System and to conduct law enforcement activities or crime reduction programs to prevent, address, or respond to hate crimes.Finally, in the case of an individual convicted of a hate crime offense and placed on supervised release, the bill allows a court to order that the individual participate in educational classes or community service as a condition of supervised release.",
            "Status": "Enacted"
        }
    ],
    "CosponsoredBills": [
        {
            "Bill Number": "S. 450 (117th)",
            "First Name": "James “Jim”  Inhofe",
            "Last Name": "cosponsor",
            "Role": "S. 450 (117th)",
            "Bill Name": "Emmett Till and Mamie Till-Mobley Congressional Gold Medal Act of 2021",
            "Subject Areas": "Racial and ethnic relations, Smithsonian Institution, U.S. history",
            "Summary": NaN
        },
        {
            "Bill Number": "S. 2607 (117th)",
            "First Name": "James “Jim”  Inhofe",
            "Last Name": "cosponsor",
            "Role": "S. 2607 (117th)",
            "Bill Name": "Iran Hostages Congressional Gold Medal Act",
            "Subject Areas": "International Affairs, Congressional tributes, Detention of persons, Diplomacy, foreign officials, Americans abroad, Iran, Middle East, Museums, exhibitions, cultural centers, Smithsonian Institution",
            "Summary": "This bill provides for the award of a Congressional Gold Medal to the 53 hostages of the Iran Hostage Crisis (November 4, 1979-January 21, 1981) in recognition of their bravery and endurance throughout their captivity."
        },
        {
            "Bill Number": "S. 3369 (117th)",
            "First Name": "James “Jim”  Inhofe",
            "Last Name": "cosponsor",
            "Role": "S. 3369 (117th)",
            "Bill Name": "Max Cleland VA Medical Center Act",
            "Subject Areas": "Armed Forces and National Security, Congressional tributes, Department of Veterans Affairs, Georgia, Government buildings, facilities, and property, Health facilities and institutions, Veterans' medical care",
            "Summary": NaN
        },
        {
            "Bill Number": "S. 4359 (117th)",
            "First Name": "James “Jim”  Inhofe",
            "Last Name": "cosponsor",
            "Role": "S. 4359 (117th)",
            "Bill Name": "Senator Johnny Isakson VA Regional Office Act of 2022",
            "Subject Areas": "Armed Forces and National Security, Congressional tributes, Department of Veterans Affairs, Georgia, Government buildings, facilities, and property",
            "Summary": NaN
        },
        {
            "Bill Number": "S. 5059 (117th)",
            "First Name": "James “Jim”  Inhofe",
            "Last Name": "cosponsor",
            "Role": "S. 5059 (117th)",
            "Bill Name": "CHIP-IN Improvement Act of 2022",
            "Subject Areas": NaN,
            "Summary": NaN
        },
        {
            "Bill Number": "S. 1872 (117th)",
            "First Name": "James “Jim”  Inhofe",
            "Last Name": "cosponsor",
            "Role": "S. 1872 (117th)",
            "Bill Name": "United States Army Rangers Veterans of World War II Congressional Gold Medal Act",
            "Subject Areas": "Museums, exhibitions, cultural centers, Smithsonian Institution, Veterans' organizations and recognition",
            "Summary": "This bill provides for the award of a single Congressional Gold Medal to the U.S. Army Rangers Veterans of World War II in recognition of their dedicated service during World War II."
        },
        {
            "Bill Number": "S. 3635 (117th)",
            "First Name": "James “Jim”  Inhofe",
            "Last Name": "cosponsor",
            "Role": "S. 3635 (117th)",
            "Bill Name": "Public Safety Officer Support Act of 2022",
            "Subject Areas": "Crime and Law Enforcement, Congressional oversight, Disability assistance, Employee benefits and pensions, Fires, First responders and emergency personnel, Government studies and investigations, Law enforcement officers, Mental health, Neurological disorders",
            "Summary": "This bill extends death and disability benefits under the Public Safety Officers' Benefits Program (PSOB) to certain public safety officers and survivors of public safety officers who suffer from post-traumatic stress disorder or acute stress disorder following a stressful situation while on duty. The PSOB program provides death, disability, and education benefits to public safety officers and survivors of public safety officers who are killed or injured in the line of duty."
        },
        {
            "Bill Number": "S. 1596 (117th)",
            "First Name": "James “Jim”  Inhofe",
            "Last Name": "cosponsor",
            "Role": "S. 1596 (117th)",
            "Bill Name": "Greatest Generation Memorial Act",
            "Subject Areas": "Finance and Financial Sector, Conflicts and wars, Currency, Military history, Monuments and memorials, U.S. history, Veterans' organizations and recognition",
            "Summary": "This bill directs the Department of the Treasury to mint and issue up to 50,000 $5 coins, 400,000 $1 silver coins, and 750,000 half-dollar clad coins in commemoration of the National World War II Memorial in the District of Columbia.The design of the coins shall be emblematic of the memorial and the service and sacrifice of American soldiers and civilians during World War II.All surcharges received from the sale of such coins shall be paid to the Friends of the National World War II Memorial to support the National Park Service in maintaining and repairing the memorial, and for educational and commemorative programs."
        },
        {
            "Bill Number": "S. 812 (117th)",
            "First Name": "James “Jim”  Inhofe",
            "Last Name": "cosponsor",
            "Role": "S. 812 (117th)",
            "Bill Name": "A bill to direct the Secretary of State to develop a strategy to regain observer status for Taiwan in the World Health Organization, and for other purposes.",
            "Subject Areas": "International Affairs, Asia, Congressional oversight, International organizations and cooperation, Taiwan, World health",
            "Summary": "This bill directs the Department of State to include additional information in its annual reports concerning Taiwan's participation at the World Health Organization's World Health Assembly (WHA) as an observer. The report shall describe changes and improvements to the State Department's plan to support Taiwan's observer status at the WHA, following any meetings at which Taiwan did not participate under such status. (China has opposed Taiwan's participation in the WHA.)"
        },
        {
            "Bill Number": "S. 400 (117th)",
            "First Name": "James “Jim”  Inhofe",
            "Last Name": "cosponsor",
            "Role": "S. 400 (117th)",
            "Bill Name": "William T. Coleman, Jr. and Norman Y. Mineta Department of Transportation Headquarters Act",
            "Subject Areas": NaN,
            "Summary": "This bill designates the headquarters building of the Department of Transportation located at 1200 New Jersey Avenue, SE, in Washington, DC, as the William T. Coleman, Jr. and Norman Y. Mineta Federal Building."
        },
        {
            "Bill Number": "S. 2340 (117th)",
            "First Name": "James “Jim”  Inhofe",
            "Last Name": "cosponsor",
            "Role": "S. 2340 (117th)",
            "Bill Name": "Daniel Anderl Judicial Security and Privacy Act of 2021",
            "Subject Areas": "Family relationships, Government information and archives, Judges, Personnel records, Protection of officials, Right of privacy, State and local government operations",
            "Summary": "This bill generally prohibits federal agencies and private businesses from publicly posting certain personal information (e.g., home addresses) of federal judges and their immediate family members. It also (1) requires information to be removed upon written request from the federal judge concerned, (2) prohibits data brokers from purchasing or selling such information, and (3) establishes programs to protect such information at the state and local level and to enhance security for judges."
        },
        {
            "Bill Number": "S. 2647 (117th)",
            "First Name": "James “Jim”  Inhofe",
            "Last Name": "cosponsor",
            "Role": "S. 2647 (117th)",
            "Bill Name": "Harlem Hellfighters Congressional Gold Medal Act",
            "Subject Areas": "Armed Forces and National Security",
            "Summary": "This bill provides for the award of a Congressional Gold Medal to the 369th Infantry Regiment, commonly known as the Harlem Hellfighters, in recognition of their bravery and outstanding service during World War I."
        },
        {
            "Bill Number": "S. 1813 (117th)",
            "First Name": "James “Jim”  Inhofe",
            "Last Name": "cosponsor",
            "Role": "S. 1813 (117th)",
            "Bill Name": "Accelerating Access to Critical Therapies for ALS Act",
            "Subject Areas": "Health care coverage and access, Health programs administration and funding, Health promotion and preventive care, Higher education, Medical research, Medical tests and diagnostic methods, Neurological disorders, Prescription drugs, Public-private cooperation, Research administration and funding, Research and development, Social work, volunteer service, charitable organizations",
            "Summary": "This bill establishes grant programs to address neurodegenerative diseases, such as amyotrophic lateral sclerosis (also known as ALS or Lou Gehrig's disease), and contains other related provisions.The Department of Health and Human Services (HHS) shall award grants to eligible entities to facilitate patients' access to investigational drugs that diagnose or treat ALS. The Food and Drug Administration (FDA) shall award grants to public and private entities to cover the costs of research and development of drugs that diagnose or treat ALS and other severely debilitating neurodegenerative diseases.HHS shall also establish the Public-Private Partnership for Neurodegenerative Diseases between the National Institutes of Health, the FDA, and at least one eligible entity (generally, an institution of higher education or a nonprofit organization). The partnership shall support the development and regulatory review of drugs that address ALS and other rare neurodegenerative diseases.The FDA shall publish on its website a five-year action plan for fostering the development of drugs that improve or extend the lives of people living with rare neurodegenerative diseases."
        },
        {
            "Bill Number": "S. 1817 (117th)",
            "First Name": "James “Jim”  Inhofe",
            "Last Name": "cosponsor",
            "Role": "S. 1817 (117th)",
            "Bill Name": "Bridge Investment Act of 2021",
            "Subject Areas": "Transportation and Public Works, Accidents, Advanced technology and technological innovations, Atmospheric science and weather, Congressional oversight, Floods and storm protection, Government information and archives, Government trust funds, Indian lands and resources rights, Natural disasters, Roads and highways, Transportation programs funding, Transportation safety and security, Wildlife conservation and habitat protection",
            "Summary": "This bill establishes a bridge investment program to award competitive grants to certain governmental entities for projects that improve (1) the condition of bridges; and (2) the safety, efficiency, and reliability of the movement of people and freight over bridges.Among other things, the bill requires grant awards for large projects (projects with total costs of greater than $100 million) to be at least $50 million, and for any other projects not less than $2.5 million; directs the Department of Transportation (DOT) to consider a number of factors in awarding grants, including the extent to which a project demonstrates cost savings by bundling multiple bridge projects; requires DOT to prioritize projects that are located within states for which at least two project applications were submitted in the current fiscal year and an average of two were submitted in prior fiscal years, and fewer than two grants have been awarded for projects within the state; and limits funding for projects that consist solely of culvert replacement or rehabilitation."
        },
        {
            "Bill Number": "S. 321 (117th)",
            "First Name": "James “Jim”  Inhofe",
            "Last Name": "cosponsor",
            "Role": "S. 321 (117th)",
            "Bill Name": "\\u201cSix Triple Eight\\u201d Congressional Gold Medal Act of 2021",
            "Subject Areas": "Military history, Military personnel and dependents, Minority employment, Museums, exhibitions, cultural centers, Postal service, Smithsonian Institution, Women's employment",
            "Summary": "This bill provides for the award of a Congressional Gold Medal to the women of the 6888th Central Postal Directory Battalion (commonly known as the Six Triple Eight) in recognition of their pioneering military service, devotion to duty, and contributions to increase the morale of personnel stationed in the European theater of operations during World War II."
        },
        {
            "Bill Number": "S. 3804 (117th)",
            "First Name": "James “Jim”  Inhofe",
            "Last Name": "cosponsor",
            "Role": "S. 3804 (117th)",
            "Bill Name": "A bill to designate the facility of the United States Postal Service located at 1233 North Cedar Street in Owasso, Oklahoma, as the \\u201cTechnical Sergeant Marshal Roberts Post Office Building\\u201d.",
            "Subject Areas": "Government Operations and Politics, Congressional tributes, Government buildings, facilities, and property, Oklahoma, Postal service",
            "Summary": NaN
        },
        {
            "Bill Number": "S. 1061 (117th)",
            "First Name": "James “Jim”  Inhofe",
            "Last Name": "cosponsor",
            "Role": "S. 1061 (117th)",
            "Bill Name": "Israel Relations Normalization Act of 2021",
            "Subject Areas": "Congressional oversight, Criminal investigation, prosecution, interrogation, Diplomacy, foreign officials, Americans abroad, Economic development, Foreign aid and international relief, Foreign language and bilingual programs, Government information and archives, Health programs administration and funding, Human rights, International exchange and broadcasting, International organizations and cooperation, Iran, Israel, Middle East, Military assistance, sales, and agreements, Museums, exhibitions, cultural centers, Palestinians, Political movements and philosophies, Racial and ethnic relations, Religion, Rule of law and government transparency, Sovereignty, recognition, national governance and status, United Arab Emirates, War crimes, genocide, crimes against humanity, Water use and supply",
            "Summary": "This bill requires the Department of State to take certain actions promoting the normalization of relations between Israel, Arab states, and other relevant countries and regions.Specifically, the State Department must develop a strategy on expanding and strengthening the Abraham Accords (the term used to refer collectively to agreements between Israel and the United Arab Emirates and between Israel and Bahrain marking the public normalization of relations between the two Arab countries and Israel). The strategy must include a description of how the U.S. government will encourage further normalization of relations with Israel.The State Department must report on the status of efforts to promote normalization of relations with Israel and other countries, including information on (1) laws that punish individuals for people-to-people relations with Israelis (i.e., anti-normalization laws), and (2) instances of the use of state-owned or state-operated media outlets to promote the prosecution of citizens or residents of Arab countries calling for peace with Israel."
        },
        {
            "Bill Number": "S. 914 (117th)",
            "First Name": "James “Jim”  Inhofe",
            "Last Name": "cosponsor",
            "Role": "S. 914 (117th)",
            "Bill Name": "Drinking Water and Wastewater Infrastructure Act of 2021",
            "Subject Areas": "Environmental Protection, Water Resources Development, Air quality, Alaska, Alaska Natives and Hawaiians, Alternative and renewable resources, Atmospheric science and weather, Child care and development, Child health, Climate change and greenhouse gases, Computer security and identity theft, Congressional oversight, Educational facilities and institutions, Elementary and secondary education, Employment and training programs, Energy efficiency and conservation, Environmental assessment, monitoring, research, Environmental technology, Floods and storm protection, Government information and archives, Government lending and loan guarantees, Government studies and investigations, Hazardous wastes and toxic substances, Indian social and development programs, Infrastructure development, Minority health, Poverty and welfare assistance, Public utilities and utility rates, Public-private cooperation, Regional and metropolitan planning, Rural conditions and development, Small towns, Social work, volunteer service, charitable organizations, Solid waste and recycling, State and local finance, Water quality, Water resources funding, Water storage, Water use and supply, Watersheds",
            "Summary": "This bill reauthorizes through FY2026 or establishes a variety of programs for water infrastructure. Specifically, it supports programs to provide safe drinking water or treat wastewater, such as sewer overflows or stormwater. For example, the bill reauthorizes and revises the clean water state revolving fund (SRF) and the drinking water SRF."
        },
        {
            "Bill Number": "S. 1408 (117th)",
            "First Name": "James “Jim”  Inhofe",
            "Last Name": "cosponsor",
            "Role": "S. 1408 (117th)",
            "Bill Name": "A bill to posthumously award the Congressional Gold Medal, collectively, to Glen Doherty, Tyrone Woods, J. Christopher Stevens, and Sean Smith, in recognition of their contributions to the Nation.",
            "Subject Areas": "Intelligence activities, surveillance, classified information, Law enforcement officers, Libya, Middle East, Terrorism, Veterans' organizations and recognition",
            "Summary": "This bill provides for the award of Congressional Gold Medals posthumously to Glen Doherty, Tyrone Woods, J. Christopher Stevens, and Sean Smith (four Americans who were killed in the September 11, 2012, attack on the U.S. consulate in Benghazi, Libya) in recognition of their contributions to the nation."
        },
        {
            "Bill Number": "S. 1341 (117th)",
            "First Name": "James “Jim”  Inhofe",
            "Last Name": "cosponsor",
            "Role": "S. 1341 (117th)",
            "Bill Name": "Water Resources Research Amendments Act",
            "Subject Areas": "Water Resources Development, Congressional oversight, Energy efficiency and conservation, Government studies and investigations, Research administration and funding, Water quality, Water resources funding, Water use and supply",
            "Summary": "This bill reauthorizes through FY2025 the Water Resources Research Act Program and otherwise revises the program, including by increasing the federal share of grant funding under the program for water resources research and technology institutes."
        }
    ]
}