{
    "Name": "Jenniffer  González-Colón",
    "CosponsoredBills": [
        {
            "Bill Number": "H.R. 7568",
            "First Name": "Jenniffer  González-Colón",
            "Last Name": "cosponsor",
            "Role": "H.R. 7568",
            "Bill Name": "Disaster Assistance Deadlines Alignment Act",
            "Subject Areas": NaN,
            "Summary": NaN
        },
        {
            "Bill Number": "H.R. 5711",
            "First Name": "Jenniffer  González-Colón",
            "Last Name": "cosponsor",
            "Role": "H.R. 5711",
            "Bill Name": "Airport and Airway Extension Act of 2023",
            "Subject Areas": "Infrastructure development, Land use and conservation, Life, casualty, property insurance, Marshall Islands, Micronesia, Palau, Research and development, Roads and highways, Sales and excise taxes, State and local government operations, Transportation safety and security",
            "Summary": "This bill temporarily extends specific Federal Aviation and Administration (FAA) programs and activities through December 31, 2023.For example, the bill extends the FAA Unmanned Aircraft Systems (UAS) pilot programs (e.g., the UAS Test Site Program and the UAS remote detection and identification pilot program), weather reporting programs, Remote Tower Pilot Program, and Essential Air Service Program. The bill also extends the authorization for the Airport Improvement Program (AIP). (This program provides grants for planning, development, and noise compatibility projects at or associated with certain public-use airports.)Further, the bill extends through December 31, 2023, the FAA's authority for expenditures from the Airport and Airway Trust Fund (AATF) and to collect various taxes and fees to fund the AATF, including taxes on aviation fuel and airline tickets. (The AATF is the primary funding source for all major FAA accounts that fund federal aviation programs, with the remainder coming from general fund appropriations.)"
        },
        {
            "Bill Number": "H.R. 1096",
            "First Name": "Jenniffer  González-Colón",
            "Last Name": "cosponsor",
            "Role": "H.R. 1096",
            "Bill Name": "250th Anniversary of the United States Marine Corps Commemorative Coin Act",
            "Subject Areas": "Military personnel and dependents",
            "Summary": "This bill directs the Department of the Treasury to mint and issue not more than 50,000 $5 gold coins, 400,000 $1 silver coins, and 750,000 half-dollar clad coins emblematic of the 250th anniversary of the United States Marine Corps.All surcharges received by Treasury from the sale of such coins must be paid to the Marine Corps Heritage Foundation and shall only be used for the purposes of supporting the mission of the Marine Corps Heritage Center."
        },
        {
            "Bill Number": "H.R. 1782",
            "First Name": "Jenniffer  González-Colón",
            "Last Name": "cosponsor",
            "Role": "H.R. 1782",
            "Bill Name": "International Port Security Enforcement Act",
            "Subject Areas": "Transportation and Public Works, Coast guard, Foreign aid and international relief, Marine and inland water transportation, Military assistance, sales, and agreements, Navigation, waterways, harbors, Smuggling and trafficking, Terrorism, Transportation safety and security",
            "Summary": "This bill prohibits the Coast Guard from cooperating with a state sponsor of terrorism or foreign terrorist organization when assessing anti-terrorism security measures at a foreign port. It also requires the Coast Guard to apply sanctions to a port controlled by a state sponsor of terrorism.The bill specifies that the Coast Guard cannot (1) adopt a port security assessment conducted by a state sponsor of terrorism, or (2) enter into an agreement with a state sponsor of terrorism or foreign terrorist organization to assess a port's security measures or share information related to such an assessment.If a port is under the jurisdiction of a state sponsor of terrorism, the Coast Guard must deem the port to not have effective anti-terrorism measures and apply certain sanctions, such as requiring vessels arriving from the port to meet certain conditions for entry into the United States."
        },
        {
            "Bill Number": "H.R. 1401",
            "First Name": "Jenniffer  González-Colón",
            "Last Name": "cosponsor",
            "Role": "H.R. 1401",
            "Bill Name": "END FENTANYL Act",
            "Subject Areas": "Immigration",
            "Summary": "This bill requires U.S. Customs and Border Protection to review and update, as necessary, manuals and policies related to inspections at ports of entry to ensure the uniformity of inspection practices to effectively detect illegal activity along the border, such as the smuggling of drugs and humans."
        },
        {
            "Bill Number": "H.R. 1917 (117th)",
            "First Name": "Jenniffer  González-Colón",
            "Last Name": "cosponsor",
            "Role": "H.R. 1917 (117th)",
            "Bill Name": "Hazard Eligibility and Local Projects Act",
            "Subject Areas": "Government trust funds, Natural disasters",
            "Summary": NaN
        },
        {
            "Bill Number": "H.R. 8260 (117th)",
            "First Name": "Jenniffer  González-Colón",
            "Last Name": "cosponsor",
            "Role": "H.R. 8260 (117th)",
            "Bill Name": "Faster Payments to Veterans\\u2019 Survivors Act of 2022",
            "Subject Areas": "Government information and archives, Life, casualty, property insurance, Veterans' pensions and compensation",
            "Summary": NaN
        },
        {
            "Bill Number": "H.R. 2724 (117th)",
            "First Name": "Jenniffer  González-Colón",
            "Last Name": "cosponsor",
            "Role": "H.R. 2724 (117th)",
            "Bill Name": "VA Peer Support Enhancement for MST Survivors Act",
            "Subject Areas": "Armed Forces and National Security, Administrative remedies, Assault and harassment offenses, Crime victims, Department of Veterans Affairs, Sex offenses, Veterans' pensions and compensation",
            "Summary": "This bill requires the Department of Veterans Affairs to ensure that each individual who files a claim relating to military sexual trauma is assigned a peer support specialist during the claims process, unless the individual elects to not have such support.Under the bill, a peer support specialist must be trained as a victim advocate and may not be responsible for any part of adjudicating the individual's claim."
        },
        {
            "Bill Number": "H.R. 7158 (117th)",
            "First Name": "Jenniffer  González-Colón",
            "Last Name": "cosponsor",
            "Role": "H.R. 7158 (117th)",
            "Bill Name": "Long-Term Care Veterans Choice Act",
            "Subject Areas": "Armed Forces and National Security, Congressional oversight, Government studies and investigations, Home and outpatient care, Long-term, rehabilitative, and terminal care, Nursing, Veterans' medical care, Veterans' pensions and compensation",
            "Summary": "This bill authorizes the Department of Veterans Affairs (VA) to enter into contracts to pay for specified veterans (i.e., certain veterans who have service-connected disabilities and require nursing home care) to be placed in medical foster homes at their request. A medical foster home is a home designed to provide non-institutional, long-term, supportive care for veterans who are unable to live independently and prefer a family setting.Veterans receiving such care must agree, as a condition of payment for their care, to accept home health services furnished by the VA.Under the bill, no more than a daily average of 900 veterans may have their care in a medical foster home covered by the VA.The VA must create a monitoring system to assess its workload in carrying out the medical foster home payments. Additionally, the Government Accountability Office must submit to Congress reports that assess the implementation of this program and provide recommendations for improvements.The bill also extends certain loan fee rates through February 15, 2031, under the VA's home loan program."
        },
        {
            "Bill Number": "H.R. 3630 (117th)",
            "First Name": "Jenniffer  González-Colón",
            "Last Name": "cosponsor",
            "Role": "H.R. 3630 (117th)",
            "Bill Name": "Lymphedema Treatment Act",
            "Subject Areas": "Health, Labor and Employment, Cardiovascular and respiratory health, Health care coverage and access, Immunology and vaccination, Medicare",
            "Summary": "This bill provides for Medicare coverage of lymphedema compression treatment items. Specifically, the bill provides for coverage of standard and custom fitted gradient compression garments and other approved items that are prescribed by a physician or other specified health care professional to treat lymphedema."
        },
        {
            "Bill Number": "H.R. 5641 (117th)",
            "First Name": "Jenniffer  González-Colón",
            "Last Name": "cosponsor",
            "Role": "H.R. 5641 (117th)",
            "Bill Name": "Small Project Efficient and Effective Disaster Recovery Act",
            "Subject Areas": "Emergency Management, Congressional oversight, Disaster relief and insurance",
            "Summary": NaN
        },
        {
            "Bill Number": "H.R. 5577 (117th)",
            "First Name": "Jenniffer  González-Colón",
            "Last Name": "cosponsor",
            "Role": "H.R. 5577 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 3900 Crown Road Southwest in Atlanta, Georgia, as the \\u201cJohn R. Lewis Post Office Building\\u201d.",
            "Subject Areas": "Government Operations and Politics, Congressional tributes, Georgia, Government buildings, facilities, and property, Postal service",
            "Summary": "This bill designates the facility of the United States Postal Service located at 3900 Crown Road Southwest in Atlanta, Georgia, as the John R. Lewis Post Office Building."
        },
        {
            "Bill Number": "H.R. 6943 (117th)",
            "First Name": "Jenniffer  González-Colón",
            "Last Name": "cosponsor",
            "Role": "H.R. 6943 (117th)",
            "Bill Name": "Public Safety Officer Support Act of 2022",
            "Subject Areas": "Fires, First responders and emergency personnel, Government studies and investigations, Law enforcement officers, Mental health, Neurological disorders",
            "Summary": "This bill extends death and disability benefits under the Public Safety Officers' Benefits Program (PSOB) to certain public safety officers and survivors of public safety officers who suffer from post-traumatic stress disorder or acute stress disorder following a stressful situation while on duty. The PSOB program provides death, disability, and education benefits to public safety officers and survivors of public safety officers who are killed or injured in the line of duty."
        },
        {
            "Bill Number": "H.R. 7211 (117th)",
            "First Name": "Jenniffer  González-Colón",
            "Last Name": "cosponsor",
            "Role": "H.R. 7211 (117th)",
            "Bill Name": "Small State and Rural Rescue Act",
            "Subject Areas": NaN,
            "Summary": "This bill addresses requests for, and other matters pertaining to, disaster assistance provided through the Federal Emergency Management Agency (FEMA), with a focus on small states and rural communities. The bill expands the duties of FEMA's Small State and Rural Advocate to include assistance for states in the collection and presentation of material in the disaster or emergency declaration request relevant to demonstrate severe localized impacts within the state for a specific incident. Additionally, the Government Accountability Office must review FEMA's implementation of its final rule regarding factors considered when evaluating a governor's request for a major disaster declaration. In particular, the review must focus on requests for a major disaster declaration authorizing individual assistance."
        },
        {
            "Bill Number": "H.R. 1057 (117th)",
            "First Name": "Jenniffer  González-Colón",
            "Last Name": "cosponsor",
            "Role": "H.R. 1057 (117th)",
            "Bill Name": "Greatest Generation Commemorative Coin Act",
            "Subject Areas": "Finance and Financial Sector, Conflicts and wars, Currency, Military history, Monuments and memorials, U.S. history, Veterans' organizations and recognition",
            "Summary": "This bill directs the Department of the Treasury to mint and issue up to 50,000 $5 coins, 400,000 $1 silver coins, and 750,000 half-dollar clad coins in commemoration of the National World War II Memorial in the District of Columbia.The design of the coins shall be emblematic of the memorial and the service and sacrifice of American soldiers and civilians during World War II.All surcharges received from the sale of such coins shall be paid to the Friends of the National World War II Memorial to support the National Park Service in maintaining and repairing the memorial, and for educational and commemorative programs."
        },
        {
            "Bill Number": "H.R. 7242 (117th)",
            "First Name": "Jenniffer  González-Colón",
            "Last Name": "cosponsor",
            "Role": "H.R. 7242 (117th)",
            "Bill Name": "Community Disaster Resilience Zones Act of 2022",
            "Subject Areas": "Emergency Management, Census and government statistics, Emergency planning and evacuation, Government information and archives, Government studies and investigations, Intergovernmental relations, Natural disasters, Presidents and presidential powers, Vice Presidents",
            "Summary": NaN
        },
        {
            "Bill Number": "H.R. 7276 (117th)",
            "First Name": "Jenniffer  González-Colón",
            "Last Name": "cosponsor",
            "Role": "H.R. 7276 (117th)",
            "Bill Name": "Ukraine Invasion War Crimes Deterrence and Accountability Act",
            "Subject Areas": "International Affairs, Arms control and nonproliferation, Asia, Chemical and biological weapons, Conflicts and wars, Congressional oversight, Criminal investigation, prosecution, interrogation, Diplomacy, foreign officials, Americans abroad, Europe, Evidence and witnesses, Georgia (Republic), Government information and archives, Human rights, Intelligence activities, surveillance, classified information, International law and treaties, International organizations and cooperation, Middle East, Military operations and strategy, News media and reporting, Protest and dissent, Refugees, asylum, displaced persons, Russia, Sovereignty, recognition, national governance and status, Syria, Ukraine, War crimes, genocide, crimes against humanity",
            "Summary": "This bill requires the President to report to Congress on atrocities committed during Russia's invasion of Ukraine since February 24, 2022.Specifically, the report must describe in detail (1) U.S. government efforts to collect, analyze, and preserve evidence related to war crimes and other atrocities committed during the invasion; (2) media, public diplomacy, and information operations to make the Russian people, including their military and political leaders, aware of efforts to identify and prosecute those responsible for such atrocities; and (3) the process for a domestic, foreign, or international court or tribunal to obtain information from the U.S. government related to such atrocities."
        },
        {
            "Bill Number": "H.R. 1667 (117th)",
            "First Name": "Jenniffer  González-Colón",
            "Last Name": "cosponsor",
            "Role": "H.R. 1667 (117th)",
            "Bill Name": "Dr. Lorna Breen Health Care Provider Protection Act",
            "Subject Areas": "Health, Cardiovascular and respiratory health, Congressional oversight, Drug, alcohol, tobacco use, Education programs funding, Emergency medical services and trauma care, Government studies and investigations, Health personnel, Health programs administration and funding, Health promotion and preventive care, Infectious and parasitic diseases, Medical education, Mental health, Natural disasters, Nursing, Worker safety and health",
            "Summary": "This bill establishes grants and requires other activities to improve mental and behavioral health among health care providers.Specifically, the Department of Health and Human Services (HHS) must award grants to hospitals, medical professional associations, and other health care entities for programs to promote mental health and resiliency among health care providers. In addition, HHS may award grants for relevant mental and behavioral health training for health care students, residents, or professionals.Additionally, HHS must conduct a campaign to (1) encourage health care providers to seek support and treatment for mental and behavioral health concerns, and (2) disseminate best practices to prevent suicide and improve mental health and resiliency among health care providers.HHS must also study and develop policy recommendations on improving mental and behavioral health among health care providers, removing barriers to accessing care and treatment, and identifying strategies to promote resiliency. Furthermore, the Government Accountability Office must report on the extent to which relevant federal grant programs address the prevalence and severity of mental health conditions and substance use disorders among health care providers."
        },
        {
            "Bill Number": "H.R. 7073 (117th)",
            "First Name": "Jenniffer  González-Colón",
            "Last Name": "cosponsor",
            "Role": "H.R. 7073 (117th)",
            "Bill Name": "Into the Light for MMH and SUD Act of 2022",
            "Subject Areas": NaN,
            "Summary": "This bill reauthorizes through FY2028 a program that addresses maternal depression and, among other changes, expands its scope to include mental health and substance use disorders. It also requires the Department of Health and Human Services to maintain a national hotline to provide mental health and substance use disorder resources to pregnant and postpartum women and their families."
        },
        {
            "Bill Number": "H.R. 1842 (117th)",
            "First Name": "Jenniffer  González-Colón",
            "Last Name": "cosponsor",
            "Role": "H.R. 1842 (117th)",
            "Bill Name": "Harriet Tubman Bicentennial Commemorative Coin Act",
            "Subject Areas": "U.S. history, Women's rights",
            "Summary": "This bill directs the Department of the Treasury to mint and issue 50,000 $5 gold coins, 400,000 $1 silver coins, and 750,000 half-dollar clad coins emblematic of the legacy of Harriet Tubman as an abolitionist.The Secretary may issue coins under this bill only during the period of January 1, 2024, through December 31, 2024.All surcharges received by Treasury from the sale of such coins must be paid equally to the National Underground Railroad Freedom Center in Cincinnati, Ohio, and The Harriet Tubman Home, Inc. in Auburn, New York, for the purpose of accomplishing and advancing their missions."
        },
        {
            "Bill Number": "H.R. 3709 (117th)",
            "First Name": "Jenniffer  González-Colón",
            "Last Name": "cosponsor",
            "Role": "H.R. 3709 (117th)",
            "Bill Name": "Preliminary Damage Assessment Improvement Act of 2021",
            "Subject Areas": "Emergency Management, Administrative law and regulatory procedures, Advisory bodies, Census and government statistics, Congressional oversight, Disaster relief and insurance, Emergency planning and evacuation, Federal Emergency Management Agency (FEMA), Government studies and investigations, Performance measurement",
            "Summary": "This bill directs the Federal Emergency Management Agency (FEMA) to (1) submit to Congress a report describing the preliminary damage assessment process, as carried out by FEMA in the five years before this bill's enactment; and (2) convene an advisory panel to assist FEMA in improving critical components of that process."
        },
        {
            "Bill Number": "H.R. 5453 (117th)",
            "First Name": "Jenniffer  González-Colón",
            "Last Name": "cosponsor",
            "Role": "H.R. 5453 (117th)",
            "Bill Name": "Fishery Resource Disasters Improvement Act",
            "Subject Areas": "Disaster relief and insurance, Economic performance and conditions, Employment and training programs, Floods and storm protection, Government information and archives, Government studies and investigations, Marine and coastal resources, fisheries, Marine and inland water transportation, Marine pollution, Natural disasters, Oil and gas, Water quality, Wildlife conservation and habitat protection",
            "Summary": "This bill revises the Fisheries Resource Disaster Relief Program and repeals or revises certain reporting requirements.The bill revises the procedures and process for determining whether there has been a commercial fishery failure as a result of a fishery resource disaster because of natural, man-made, or undetermined causes.The Department of Commerce shall have the sole authority to determine the existence, extent, and beginning and end dates of a fishery resource disaster. Additionally, Commerce must include in its budget justification materials submitted to Congress in support of the budget of Commerce for each fiscal year, (as submitted with the President's budget) a separate statement of the amount requested to be appropriated for that fiscal year for outstanding unfunded fishery resource disasters.The bill repeals a program that provides disaster relief assistance to fishermen, charter fishing operators, and others affected by a catastrophic regional fishery disaster, known as the regional coastal disaster assistance, transition, and recovery program.With respect to reporting requirements, the bill requires (1) biennial rather than annual reports (under current law, annual reports) relating to the recovery of Klamath River Coho salmon, and (2) inclusion of additional information in the biennial reports on international compliance regarding the conservation of living marine resources.The bill also repeals the requirement for annual reporting to Congress on bycatch reduction agreements."
        },
        {
            "Bill Number": "H.R. 5142 (117th)",
            "First Name": "Jenniffer  González-Colón",
            "Last Name": "cosponsor",
            "Role": "H.R. 5142 (117th)",
            "Bill Name": "To award posthumously a Congressional Gold Medal, in commemoration to the servicemembers who perished in Afghanistan on August 26, 2021, during the evacuation of citizens of the United States and Afghan allies at Hamid Karzai Internati",
            "Subject Areas": "Armed Forces and National Security, International Affairs, Afghanistan, Asia, Conflicts and wars, Congressional tributes, Emergency planning and evacuation, Military operations and strategy, Military personnel and dependents, Museums, exhibitions, cultural centers, Smithsonian Institution, Terrorism",
            "Summary": "This bill posthumously provides for the award of a Congressional Gold Medal in commemoration of the 13 service members who died on August 26, 2021, while stationed at Hamid Karzai International Airport in Afghanistan."
        },
        {
            "Bill Number": "H.R. 1448 (117th)",
            "First Name": "Jenniffer  González-Colón",
            "Last Name": "cosponsor",
            "Role": "H.R. 1448 (117th)",
            "Bill Name": "PAWS for Veterans Therapy Act",
            "Subject Areas": "Armed Forces and National Security, Animal protection and human-animal relationships, Congressional oversight, Disability assistance, Government information and archives, Government studies and investigations, Health programs administration and funding, Mammals, Mental health, Neurological disorders, Service animals, Veterans' education, employment, rehabilitation, Veterans' medical care",
            "Summary": "This bill implements a program and a policy related to service dog therapy for veterans. Specifically, the bill requires the Department of Veterans Affairs (VA) to implement a five-year pilot program to provide canine training to eligible veterans diagnosed with post-traumatic stress disorder as an element of a complementary and integrative health program. Eligible veterans are those who are enrolled in the VA health care system and have been recommended for participation by a qualified mental health care provider or clinical team.The VA must seek to enter agreements containing specified elements with accredited nongovernmental entities that have demonstrated ability to provide canine training.Veterans who participate in the program are authorized to adopt the dog they assisted in training if their health provider determines it is in the best interest of the veteran.The VA must establish processes to document and track the progress of participating veterans with respect to health benefits and improvements. The Government Accountability Office must brief Congress and submit a report on the program.The bill also authorizes the VA to provide service dogs to veterans with mental illnesses, regardless of whether they have a mobility impairment."
        },
        {
            "Bill Number": "H.R. 3642 (117th)",
            "First Name": "Jenniffer  González-Colón",
            "Last Name": "cosponsor",
            "Role": "H.R. 3642 (117th)",
            "Bill Name": "Harlem Hellfighters Congressional Gold Medal Act",
            "Subject Areas": "Armed Forces and National Security, Conflicts and wars, Congressional tributes, Military history, Military personnel and dependents, Museums, exhibitions, cultural centers, New York State, Racial and ethnic relations, Smithsonian Institution, Veterans' organizations and recognition",
            "Summary": "This bill provides for the award of a Congressional Gold Medal to the 369th Infantry Regiment, commonly known as the Harlem Hellfighters, in recognition of their bravery and outstanding service during World War I."
        },
        {
            "Bill Number": "H.R. 2946 (117th)",
            "First Name": "Jenniffer  González-Colón",
            "Last Name": "cosponsor",
            "Role": "H.R. 2946 (117th)",
            "Bill Name": "RENACER Act",
            "Subject Areas": "Digital media, Diplomacy, foreign officials, Americans abroad, Elections, voting, political campaign regulation, Europe, European Union, Foreign aid and international relief, Foreign loans and debt, Government ethics and transparency, public corruption, Human rights, International exchange and broadcasting, International monetary system and foreign exchange, International organizations and cooperation, Latin America, Multilateral development programs, News media and reporting, Nicaragua, Political parties and affiliation, Protest and dissent, Racial and ethnic relations, Russia, Sanctions, Sovereignty, recognition, national governance and status, Television and film, U.S. and foreign investments",
            "Summary": "This bill establishes measures to monitor, report on, and address corruption and human rights abuses in Nicaragua.Specifically, the bill directs U.S. leadership at international financial institutions to advocate for oversight with respect to any loan or financial or technical assistance for projects in Nicaragua.The Department of State and the Department of the Treasury must establish a strategy to align diplomatic engagement with implementing sanctions to facilitate free, fair, and transparent elections in Nicaragua. Pursuant to this strategy, the President must prioritize implementing targeted sanctions on persons obstructing such elections. The State Department must also engage in diplomatic efforts with partner countries to impose targeted sanctions on such individuals.The bill adds Nicaragua to a list of countries whose citizens are subject to visa-blocking sanctions for knowingly engaging in (1) actions undermining democratic processes or institutions, or (2) significant corruption or obstruction of investigations into such corruption.Further, the bill requires the State Department to report on the involvement of President Daniel Ortega, members of his family, and senior government officials in significant acts of public corruption; Russian activities in Nicaragua; and gross human rights violations by the Ortega government against campesinos (i.e., natives of Latin American rural areas, especially Latin American Indian farmers or farm laborers) and indigenous communities. In addition, the State Department must report on obstacles to news and information about domestic and international affairs and submit a strategy for strengthening independent broadcasting, information distribution, and media platforms in Nicaragua."
        },
        {
            "Bill Number": "H.R. 4436 (117th)",
            "First Name": "Jenniffer  González-Colón",
            "Last Name": "cosponsor",
            "Role": "H.R. 4436 (117th)",
            "Bill Name": "Daniel Anderl Judicial Security and Privacy Act of 2021",
            "Subject Areas": NaN,
            "Summary": "This bill generally prohibits federal agencies and private businesses from publicly posting the personally identifiable information (e.g., home addresses) of federal judges and their immediate family members. It also (1) requires information to be removed upon written request from the federal judge concerned, (2) prohibits data brokers from purchasing or selling such information, and (3) establishes programs to protect such information at the state and local level and to enhance security for judges."
        },
        {
            "Bill Number": "H.R. 3577 (117th)",
            "First Name": "Jenniffer  González-Colón",
            "Last Name": "cosponsor",
            "Role": "H.R. 3577 (117th)",
            "Bill Name": "United States Army Rangers Veterans of World War II Congressional Gold Medal Act",
            "Subject Areas": "Armed Forces and National Security, Conflicts and wars, Congressional tributes, Military history, Museums, exhibitions, cultural centers, Smithsonian Institution, Veterans' organizations and recognition",
            "Summary": "This bill provides for the award of a single Congressional Gold Medal to the U.S. Army Rangers Veterans of World War II in recognition of their dedicated service during World War II."
        },
        {
            "Bill Number": "H.R. 707 (117th)",
            "First Name": "Jenniffer  González-Colón",
            "Last Name": "cosponsor",
            "Role": "H.R. 707 (117th)",
            "Bill Name": "Ghost Army Congressional Gold Medal Act",
            "Subject Areas": "Military operations and strategy, Military personnel and dependents, Museums, exhibitions, cultural centers, Smithsonian Institution",
            "Summary": "This bill directs the Speaker of the House of Representatives and the President pro tempore of the Senate to award a Congressional Gold Medal to the 23rd Headquarters Special Troops and the 3133rd Signal Service Company, known as the Ghost Army, collectively, in recognition of its service during World War II."
        },
        {
            "Bill Number": "H.R. 210 (117th)",
            "First Name": "Jenniffer  González-Colón",
            "Last Name": "cosponsor",
            "Role": "H.R. 210 (117th)",
            "Bill Name": "Rural STEM Education Research Act",
            "Subject Areas": "Computers and information technology, Congressional oversight, Education of the disadvantaged, Educational technology and distance education, Elementary and secondary education, Employment and training programs, Government studies and investigations, Higher education, Internet and video services, Manufacturing, Performance measurement, Research administration and funding, Rural conditions and development, Science and engineering education, Teaching, teachers, curricula, Vocational and technical education",
            "Summary": "This bill specifies federal scientific research and development efforts towards STEM (science, technology, engineering, and mathematics, including computer science) workforce development and rural STEM education.(Sec. 3) The bill amends the objectives of the Manufacturing Extension Partnership program to include the provision to secondary schools of information about the job skills needed in manufacturing companies, and the promotion and expansion of certification systems offered through local high schools. The activities of a manufacturing extension center are expanded to include local high schools in the facilitation of collaborations and partnerships between manufacturing companies and schools to help those entities better understand the specific needs of manufacturers and to help manufacturers better understand the skill sets that students learn in school programs.The National Institute of Standards and Technology (NIST) must award prizes to stimulate research and development of creative technologies in order to deploy affordable and reliable broadband connectivity to underserved rural communities. NIST may award not more than a total of $5 million in prizes.(Sec. 4) The Office of Science and Technology Policy must establish a broadband research and development working group to address national research challenges and opportunities for improving broadband access and adoption across the United States.(Sec. 5) The National Science Foundation (NSF) shall enter into an agreement with the National Academy of Sciences under which the National Academy of Sciences agrees to evaluate aspects of STEM education and workforce development in rural areas. (Sec. 6) The Government Accountability Office shall conduct a study on the engagement of rural populations in federal STEM programs.(Sec. 7) Experimental Program to Stimulate Competitive Research (EPSCoR) programs shall consider modifications to award structures to increase the capacity of rural communities to provide quality STEM education and STEM workforce development programming to students and teachers.(Sec. 8) The NSF must award grants to institutions of higher education or nonprofit organizations for (1) research and development to advance innovative approaches to support and sustain high-quality STEM teaching in rural schools, (2) research and development of programming to identify the barriers rural students face in accessing high-quality STEM education, (3) development of innovative solutions to improve the participation and advancement of rural students in grades Pre-K through 12 in STEM studies, and (4) research on online STEM education courses for rural communities.The NSF may establish a pilot program of regional cohorts in rural areas to provide peer support, mentoring, and hands-on research experiences for rural STEM educators of students in grades Pre-K through 12 in order to build an ecosystem of cooperation among educators, researchers, academia, and local industry."
        },
        {
            "Bill Number": "H.R. 2936 (117th)",
            "First Name": "Jenniffer  González-Colón",
            "Last Name": "cosponsor",
            "Role": "H.R. 2936 (117th)",
            "Bill Name": "Protecting America\\u2019s First Responders Act of 2021",
            "Subject Areas": "Crime and Law Enforcement, Administrative remedies, Cardiovascular and respiratory health, Department of Justice, Disability and paralysis, Disability assistance, Emergency medical services and trauma care, Employee benefits and pensions, Fires, First responders and emergency personnel, Health personnel, Infectious and parasitic diseases, Law enforcement officers, Neurological disorders, New York City, Terrorism, Worker safety and health",
            "Summary": "This bill makes changes to the Public Safety Officers' Benefits (PSOB) program. The PSOB program provides death, disability, and education benefits to public safety officers and survivors of public safety officers who are killed in the line of duty or permanently disabled as a result of catastrophic injuries sustained in the line of duty.Among the changes, the bill expands the public safety officers eligible for coverage under the PSOB program to include firefighters whose primary duty during an emergency response is to secure the scene or manage traffic and cadets or trainees in candidate-officer training; extends coverage under the PSOB program to certain public safety officers responding outside their jurisdiction; increases the interim benefit amount payable on a claim for death benefits and requires the interim amount to be adjusted annually for inflation; increases the benefit amount payable on a death or disability claim that has been pending for more than 365 days on the date of the final determination; allows the Department of Justice (DOJ) to use investigative tools, including subpoenas, to expedite the processing of claims and obtain information or documentation from third parties (e.g., public agencies); specifies that an injury resulting from a neurocognitive disorder qualifies as a catastrophic injury for the purposes of disability benefits; requires (currently, authorizes) DOJ to provide retroactive education benefits to qualifying children and spouses; specifies that hearing officers appointed to review claims are special government employees (i.e., employees who perform temporary duties for a limited period of time) and are authorized to conduct examinations; and allows responders to the World Trade Center or their surviving family members to file claims for death or disability benefits in certain circumstances."
        },
        {
            "Bill Number": "H.R. 1215 (117th)",
            "First Name": "Jenniffer  González-Colón",
            "Last Name": "cosponsor",
            "Role": "H.R. 1215 (117th)",
            "Bill Name": "Fraud and Scam Reduction Act",
            "Subject Areas": "Commerce, Advisory bodies, Aging, Congressional oversight, Consumer affairs, Crime prevention, Executive agency funding and structure, Federal Trade Commission (FTC), Financial services and investments, Fraud offenses and financial crimes, Government information and archives, Internet and video services, Marketing and advertising, Postal service, Retail and wholesale trades, State and local government operations, Telephone and wireless communication, Television and film",
            "Summary": "This bill expands activities to address mail, telephone, and internet fraud, particularly such scams targeting older adults.The bill establishes a Senior Scams Prevention Advisory Group, which must create model educational materials to educate employees of retailers, financial-services companies, and wire-transfer companies on how to identify and prevent scams that affect older adults.Further, the Federal Trade Commission (FTC) must establish an advisory office in the Bureau of Consumer Protection to assist the FTC in monitoring scams targeting older adults, educating consumers, and receiving complaints."
        },
        {
            "Bill Number": "H.R. 2151 (117th)",
            "First Name": "Jenniffer  González-Colón",
            "Last Name": "cosponsor",
            "Role": "H.R. 2151 (117th)",
            "Bill Name": "Hire Veteran Health Heroes Act of 2021",
            "Subject Areas": "Armed Forces and National Security, Congressional oversight, Department of Veterans Affairs, Employee hiring, Government employee pay, benefits, personnel management, Health personnel, Military medicine, Military personnel and dependents, Veterans' education, employment, rehabilitation, Veterans' medical care",
            "Summary": "This bill requires the Department of Veterans Affairs (VA) to consult with the Department of Defense to identify members of the Armed Forces in health care occupations who are separating from the Armed Forces.The VA must refer interested members to a recruiter for consideration of open positions in the member's specialty and geography of interest."
        },
        {
            "Bill Number": "H.R. 1085 (117th)",
            "First Name": "Jenniffer  González-Colón",
            "Last Name": "cosponsor",
            "Role": "H.R. 1085 (117th)",
            "Bill Name": "To award three congressional gold medals to the United States Capitol Police and those who protected the U.S. Capitol on January 6, 2021.",
            "Subject Areas": "Assault and harassment offenses, Congress, Congressional tributes, Crimes against property, District of Columbia, Government buildings, facilities, and property, Law enforcement officers, Museums, exhibitions, cultural centers, Protest and dissent, Smithsonian Institution, Subversive activities, Terrorism, U.S. Capitol, Violent crime",
            "Summary": "This bill directs the Speaker of the House and the President pro tempore of the Senate to arrange for the award of three Congressional Gold Medals to the U.S. Capitol Police (USCP) and other law enforcement agencies that protected the U.S. Capitol on January 6, 2021.Following the award of these medals, one medal shall be given to the USCP, one medal shall be given to the Metropolitan Police Department of the District of Columbia, and one medal shall be given to the Smithsonian Institution and displayed with a plaque listing all law enforcement agencies that participated in protecting the Capitol on January 6, 2021."
        },
        {
            "Bill Number": "H.R. 1799 (117th)",
            "First Name": "Jenniffer  González-Colón",
            "Last Name": "cosponsor",
            "Role": "H.R. 1799 (117th)",
            "Bill Name": "PPP Extension Act of 2021",
            "Subject Areas": "Commerce, Business expenses, Cardiovascular and respiratory health, Emergency medical services and trauma care, Government lending and loan guarantees, Infectious and parasitic diseases, Small business, Wages and earnings",
            "Summary": "This bill extends the Paycheck Protection Program, established to support small businesses in response to COVID-19 (i.e., coronavirus disease 2019), through June 30, 2021. Currently, the program is set to expire on March 31, 2021.For the final 30 days of the program (i.e., from June 1 until June 30), the Small Business Administration may only process applications submitted prior to June 1, and it may not accept any new loan applications.The bill excludes the budgetary effects of this bill from PAYGO scorecards under the Statutory Pay-As-You-Go Act of 2010 and from Senate PAYGO scorecards."
        },
        {
            "Bill Number": "H.R. 1652 (117th)",
            "First Name": "Jenniffer  González-Colón",
            "Last Name": "cosponsor",
            "Role": "H.R. 1652 (117th)",
            "Bill Name": "VOCA Fix to Sustain the Crime Victims Fund Act of 2021",
            "Subject Areas": "Crime and Law Enforcement, Civil actions and liability, Crime victims, Criminal investigation, prosecution, interrogation, Emergency medical services and trauma care, Government trust funds, Infectious and parasitic diseases, Law enforcement administration and funding, State and local government operations",
            "Summary": "This bill adds a new source of revenue for the Crime Victims Fund and makes changes to formula grants supported by the fund.Specifically, the bill directs revenues collected from deferred prosecution and non-prosecution agreements to be deposited into the Crime Victims Fund. Currently, such revenues are deposited into the general fund of the Treasury.Additionally, the bill increases the percentage—from 60% to 75%—of state compensation payments to crime victims in the prior fiscal year used to calculate formula grants for state victim compensation programs.Finally, the bill directs states to waive the matching requirement for recipients of state victim assistance formula grants during and for one year after a pandemic-related national emergency. It also allows states to waive the matching requirement pursuant to a policy established by the state."
        },
        {
            "Bill Number": "H.R. 1192 (117th)",
            "First Name": "Jenniffer  González-Colón",
            "Last Name": "cosponsor",
            "Role": "H.R. 1192 (117th)",
            "Bill Name": "PRRADA",
            "Subject Areas": "Caribbean area, Debt collection, Government ethics and transparency, public corruption, Lawyers and legal services, Legal fees and court costs, Puerto Rico, U.S. territories and protectorates",
            "Summary": "This bill requires professionals employed in debt adjustment cases involving Puerto Rico to file verified statements disclosing their connections with interested parties before seeking compensation for their services.The Financial Oversight and Management Board for Puerto Rico must establish a list of such interested parties, which shall include the debtor, creditors, any attorney or accountant of the debtor or creditors, persons employed by the U.S. Trustee Program, persons employed by the board, and any other interested party.Compensation may be denied to such a professional if these disclosures are not filed, are inadequate, or if the professional is found to have certain conflicts of interest."
        },
        {
            "Bill Number": "H.R. 1179 (117th)",
            "First Name": "Jenniffer  González-Colón",
            "Last Name": "cosponsor",
            "Role": "H.R. 1179 (117th)",
            "Bill Name": "Iran Hostages Congressional Gold Medal Act",
            "Subject Areas": "International Affairs, Congressional tributes, Detention of persons, Diplomacy, foreign officials, Americans abroad, Iran, Middle East, Museums, exhibitions, cultural centers, Smithsonian Institution",
            "Summary": "This bill requires the Speaker of the House of Representatives and the President pro tempore of the Senate to arrange for the award of a Congressional Gold Medal commemorating the bravery and endurance of the 53 hostages of the Iran Hostage Crisis.Following its award, the medal shall be given to the National Museum of American History of the Smithsonian Institution for display and research.The Department of the Treasury must strike duplicate medals in silver for presentation to a hostage (or the personal representative of a deceased hostage), and Treasury may also strike and sell duplicate medals in bronze."
        },
        {
            "Bill Number": "H.R. 1012 (117th)",
            "First Name": "Jenniffer  González-Colón",
            "Last Name": "cosponsor",
            "Role": "H.R. 1012 (117th)",
            "Bill Name": "\\u2018Six Triple Eight\\u2019 Congressional Gold Medal Act of 2021",
            "Subject Areas": "Military history, Military personnel and dependents, Minority employment, Museums, exhibitions, cultural centers, Postal service, Smithsonian Institution, Women's employment",
            "Summary": "This bill directs the Speaker of the House of Representatives and the President pro tempore of the Senate to arrange for the award of a Congressional Gold Medal in honor of the women of the 6888th Central Postal Directory Battalion (commonly known as the Six Triple Eight) in recognition of their pioneering military service, devotion to duty, and contributions to increase the morale of personnel stationed in the European theater of operations during World War II. The medal shall be given to the Smithsonian Institution and made available for display and research."
        },
        {
            "Bill Number": "H.R. 7001 (117th)",
            "First Name": "Jenniffer  González-Colón",
            "Last Name": "cosponsor",
            "Role": "H.R. 7001 (117th)",
            "Bill Name": "FEMA Intermittent Personnel Employment and Reemployment Rights Act of 2022",
            "Subject Areas": "Government Operations and Politics",
            "Summary": NaN
        },
        {
            "Bill Number": "H.R. 4233 (117th)",
            "First Name": "Jenniffer  González-Colón",
            "Last Name": "cosponsor",
            "Role": "H.R. 4233 (117th)",
            "Bill Name": "Student Veterans Counseling Centers Eligibility Act",
            "Subject Areas": "Armed Forces and National Security, Congressional oversight, Health care coverage and access, Higher education, Mental health, Military personnel and dependents, Student aid and college costs, Veterans' education, employment, rehabilitation, Veterans' medical care",
            "Summary": "This bill requires the Department of Veterans Affairs (VA) to furnish counseling, including counseling through a Vet Center, to veterans or members of the Armed Forces who are pursuing a course of education using specified Department of Defense or VA educational assistance benefits.Specifically, such counseling must be provided to veterans or members of the Armed Forces who are utilizing educational assistance benefits under the Montgomery GI Bill (Active Duty), Montgomery GI Bill (Selected Reserve), Veteran Readiness and Employment program, Post-Vietnam Era Veterans Educational Assistance Program, Post-9/11 GI Bill, Reserve Educational Assistance Program, VA High Technology Pilot Program, or Veteran Rapid Retraining Assistance Program."
        },
        {
            "Bill Number": "H.R. 2485 (117th)",
            "First Name": "Jenniffer  González-Colón",
            "Last Name": "cosponsor",
            "Role": "H.R. 2485 (117th)",
            "Bill Name": "Access to Congressionally Mandated Reports Act",
            "Subject Areas": "Congress, Congressional agencies, Congressional leadership, Congressional operations and organization, Congressional oversight, Government Publishing Office (GPO), Government information and archives, Legislative rules and procedure, Library of Congress",
            "Summary": "This bill requires the Government Publishing Office (GPO) to establish and maintain a publicly available online portal containing copies of all congressionally mandated reports. A federal agency must submit a congressionally mandated report and specified information about the report to the GPO between 30 and 45 days after submission of the report to either chamber or to any congressional committee or subcommittee. Upon the written request of the chair of a congressional committee or subcommittee to the GPO, a report submitted to that committee or subcommittee shall not be submitted or published on the portal.Federally chartered corporations, the Government Accountability Office, and any elements of the intelligence community are excluded from the requirements of this bill. The Office of Management and Budget must issue guidance to federal agencies on the bill's requirement for agencies to submit copies of congressionally mandated reports and related information to the GPO."
        },
        {
            "Bill Number": "H.R. 4624 (117th)",
            "First Name": "Jenniffer  González-Colón",
            "Last Name": "cosponsor",
            "Role": "H.R. 4624 (117th)",
            "Bill Name": "Guaranteeing Healthcare Access to Personnel Who Served Act",
            "Subject Areas": "Armed Forces and National Security, Asia, Assault and harassment offenses, Congressional oversight, Crime victims, Dental care, Department of Veterans Affairs, Environmental health, Government information and archives, Government studies and investigations, Hazardous wastes and toxic substances, Health care costs and insurance, Health care coverage and access, Health care quality, Health facilities and institutions, Health information and medical records, Health personnel, Health programs administration and funding, Health promotion and preventive care, Health technology, devices, supplies, Hospital care, Immunology and vaccination, Internet and video services, Mental health, Philippines, Rural conditions and development, Sex offenses, Transportation costs, Veterans' medical care, Women's health",
            "Summary": "This bill addresses the administration and provision of health care to veterans through the Department of Veterans Affairs (VA) and non-VA providers.First, the bill provides statutory authority for the eligibility thresholds for when a veteran must receive non-VA care under the Veterans Community Care Program (VCCP) for primary care, mental health care, noninstitutional extended care services, specialty care, or specialty services. Additionally, the bill establishes access to care standards for non-VA care under the VCCP, meaning a veteran's appointment must be within specified distances and time frames.Among other requirements, the VA must also implement an 18-month pilot program to allow certain veterans to use a website or mobile application to request, schedule, and confirm medical appointments with VCCP providers; ensure that VCCP third party administrators and credentials verification organizations comply with specified requirements to help ensure that certain health care providers are excluded from providing non-VA health care services; develop a strategic plan to ensure the effectiveness of the telehealth technologies and modalities delivered by the VA; and establish an online health care education portal for veterans. The bill requires the Government Accountability Office to report on (1) the VA program under which third parties provide transportation for veterans who are seeking VA services or benefits, (2) VA telehealth services, and (3) the VA's Foreign Medical Program.Finally, the Paperwork Reduction Act does not apply to the voluntary collection of information during research conducted by the Veterans Health Administration."
        },
        {
            "Bill Number": "H.R. 2441 (117th)",
            "First Name": "Jenniffer  González-Colón",
            "Last Name": "cosponsor",
            "Role": "H.R. 2441 (117th)",
            "Bill Name": "Sgt. Ketchum Rural Veterans Mental Health Act of 2021",
            "Subject Areas": "Health facilities and institutions, Mental health, Rural conditions and development, Veterans' medical care",
            "Summary": "This bill requires the Department of Veterans Affairs (VA), during FY2022, to establish and maintain three new centers of the Rural Access Network for Growth Enhancement (RANGE) Program in areas with interest from personnel and a need for additional mental health care for rural veterans. The RANGE Program serves veterans in rural areas who are experiencing mental illness.The bill requires the Government Accountability Office to conduct a study and report on whether the VA has sufficient resources to serve rural veterans who need mental health care that is more intensive than traditional outpatient therapy."
        },
        {
            "Bill Number": "H.R. 3593 (117th)",
            "First Name": "Jenniffer  González-Colón",
            "Last Name": "cosponsor",
            "Role": "H.R. 3593 (117th)",
            "Bill Name": "Department of Energy Science for the Future Act",
            "Subject Areas": "Science, Technology, Communications, Air quality, Alternative and renewable resources, Asia, Astronomy, Atmospheric science and weather, Biological and life sciences, Cardiovascular and respiratory health, Chemistry, China, Climate change and greenhouse gases, Computers and information technology, Congressional oversight, Department of Energy, Earth sciences, Electric power generation and transmission, Elementary and secondary education, Emergency medical services and trauma care, Energy efficiency and conservation, Energy research, Energy storage, supplies, demand, Environmental assessment, monitoring, research, Executive agency funding and structure, Foreign and international corporations, Government information and archives, Health promotion and preventive care, Higher education, Infectious and parasitic diseases, International organizations and cooperation, Marine and coastal resources, fisheries, Materials, Medical research, Medical tests and diagnostic methods, Minority education, Minority employment, Nuclear power, Radiation, Research administration and funding, Research and development, Science and engineering education, Solid waste and recycling, Space flight and exploration, Teaching, teachers, curricula, Water use and supply",
            "Summary": "This bill supports specified research and development activities of the Department of Energy (DOE) Office of Science.The bill establishes various programs, including a basic energy sciences research and development program; a program of research and development for the application of advanced computing practices to foundational and emerging research problems in chemistry and materials science; a web-based platform to develop and provide access to a database of computed information on known and predicted materials properties and computational tools to accelerate breakthroughs in materials discovery and design; a biological systems science and climate and environmental science research and development program; research and development activities in biomolecular characterization and imaging science; earth and environmental systems science research; a coastal zone research initiative; an initiative focused on the development of engineered ecosystems; a program to implement a strategy for achieving computing systems with capabilities beyond exascale computing systems; a program of fundamental research and development of energy efficient computing and data center technologies relevant to advanced computing applications; a Quantum User Expansion for Science and Technology program or QUEST program; a collaborative research and development program of fusion energy technologies; a research program in elementary particle physics and advanced technology research and development to improve the understanding of the fundamental properties of the universe, including constituents of matter and energy and the nature of space and time; research activities on the nature of the primary contents of the universe, including the nature of dark energy and dark matter; a research program to discover and understand various forms of nuclear matter; a program across the DOE for the production of isotopes, including the development of techniques to produce isotopes, that the DOE determines are needed for research, medical, industrial, or related purposes; a midscale instrumentation program to enable the development and acquisition of novel, state-of-the-art instruments ranging in cost from $1 million to $20 million each that would significantly accelerate scientific breakthroughs at user facilities; and a high intensity laser research initiative. The DOE Office of Science shall continue to leverage U.S. participation in the Large Hadron Collider and prioritize expanding international partnerships and investments in the Long-Baseline Neutrino Facility and Deep Underground Neutrino Experiment.DOE shall support construction of a Facility for Rare Isotope Beams to advance the understanding of rare nuclear isotopes and the evolution of the cosmos.DOE shall expand opportunities to increase the number, diversity, equity, and inclusion of highly skilled science, technology, engineering, and mathematics (STEM) professionals working in DOE mission-relevant disciplines and broaden the recruitment pool to increase diversity, including expanded partnerships with Historically Black Colleges, Tribal Colleges, Minority Serving Institutions, emerging research institutions, and scientific societies.DOE shall establish within the DOE Office of Science, a cross-cutting research initiative to leverage the federal government's innovative analytical resources and tools, user facilities, and advanced computational and networking capabilities in order to prevent, prepare for, and respond to emerging infectious diseases, including COVID-19.DOE may not carry out gain-of-function research of concern."
        },
        {
            "Bill Number": "H.R. 2225 (117th)",
            "First Name": "Jenniffer  González-Colón",
            "Last Name": "cosponsor",
            "Role": "H.R. 2225 (117th)",
            "Bill Name": "National Science Foundation for the Future Act",
            "Subject Areas": "Agricultural practices and innovations, Agricultural research, Air quality, Biological and life sciences, Chemistry, Climate change and greenhouse gases, Competitiveness, trade promotion, trade deficits, Computer security and identity theft, Computers and information technology, Congressional oversight, Earth sciences, Education of the disadvantaged, Education programs funding, Elementary and secondary education, Energy efficiency and conservation, Energy research, Energy storage, supplies, demand, Environmental assessment, monitoring, research, Executive agency funding and structure, Food supply, safety, and labeling, Government studies and investigations, Higher education, Indian social and development programs, Infectious and parasitic diseases, Minority education, Minority employment, National Science Foundation, Natural disasters, Research administration and funding, Research and development, Research ethics, Rural conditions and development, Science and engineering education, Scientific communication, Student aid and college costs, Teaching, teachers, curricula, Veterans' education, employment, rehabilitation, Violent crime, Water use and supply",
            "Summary": "This bill reauthorizes the National Science Foundation (NSF) through FY2026 and authorizes programs and activities at the NSF.The bill establishes requirements for the NSF, including to enter into a contract with the National Academies of Science, Engineering, and Medicine to assess the status and opportunities for Pre-K through 12 science, technology, engineering, and mathematics, including computer science, (STEM) education research; award grants to establish no fewer than three multidisciplinary Centers for Transformative Education Research and Translation to support research and development of STEM education innovations; provide grants for research on programming that engages students in grades Pre-K through 8, including underrepresented and rural students, in STEM in order to prepare such students to pursue degrees or careers in STEM; award grants to support research and development activities to encourage greater collaboration and coordination between institutions of higher education and industry to enhance education, foster hands-on learning experiences, and improve alignment with workforce needs; award grants to establish a network of centers for science and technical education; award grants to advance research on the nature of learning and teaching at community colleges; award grants to establish traineeship programs for graduate students who pursue artificial intelligence-related research leading to a masters or doctorate degree; award grants to carry out research on the cyber workforce; establish a cybersecurity workforce data initiative; carry out a national initiative to facilitate the development of networks and partnerships to broaden participation in STEM studies and careers of groups historically underrepresented in such studies and careers; maintain a Research Security and Policy office to coordinate all research security policy issues across the NSF; award grants to support research to improve our understanding of the climate system and related human and environmental systems; support research to significantly advance our understanding of the food-energy-water system; award grants to advance knowledge of risk assessment and predictability to improve our ability to predict extreme events and natural hazards, including pandemics; and award grants to support basic research that will accelerate innovation to advance critical minerals mining strategies and technologies. The bill also establishes within the NSF a Directorate for Science and Engineering Solutions to advance research and development solutions to address societal and national challenges."
        },
        {
            "Bill Number": "H.R. 49 (117th)",
            "First Name": "Jenniffer  González-Colón",
            "Last Name": "cosponsor",
            "Role": "H.R. 49 (117th)",
            "Bill Name": "To designate the National Pulse Memorial located at 1912 South Orange Avenue, Orlando, Florida, 32806, and for other purposes.",
            "Subject Areas": "Monuments and memorials, Sex, gender, sexual orientation discrimination, Terrorism, Violent crime",
            "Summary": "This bill redesignates the Pulse Memorial located at 1912 South Orange Avenue in Orlando, Florida, as the National Pulse Memorial."
        },
        {
            "Bill Number": "H.R. 539 (117th)",
            "First Name": "Jenniffer  González-Colón",
            "Last Name": "cosponsor",
            "Role": "H.R. 539 (117th)",
            "Bill Name": "Preventing Disaster Revictimization Act",
            "Subject Areas": "Residential rehabilitation and home repair",
            "Summary": "This bill requires the Federal Emergency Management Agency (FEMA) to waive certain debts owed to the United States related to disaster assistance provided to an individual or household.Specifically, FEMA must waive a debt owed to the United States related to disaster assistance provided to an individual or household if such assistance (1) was distributed based on an error by FEMA and such debt is construed as a hardship, and (2) is subject to a claim or legal action.FEMA must report to Congress on (1) actions that it will take to reduce the assistance payment error rate, and (2) the internal processes used to make decisions regarding the distribution of federal disaster assistance to individuals and households and any changes made to such processes."
        },
        {
            "Bill Number": "H.R. 2848 (117th)",
            "First Name": "Jenniffer  González-Colón",
            "Last Name": "cosponsor",
            "Role": "H.R. 2848 (117th)",
            "Bill Name": "Marine Mammal Research and Response Act of 2021",
            "Subject Areas": "Animals, Alaska, Animal and plant health, Animal protection and human-animal relationships, Aquatic ecology, Arctic and polar regions, Congressional oversight, Government information and archives, Government liability, Government studies and investigations, Government trust funds, Health information and medical records, Mammals, Marine and coastal resources, fisheries, Marine pollution, Veterinary medicine and animal diseases, Wildlife conservation and habitat protection",
            "Summary": "This bill provides support for efforts to protect marine mammals.Specifically, the bill reauthorizes through FY2026 and generally revises the John H. Prescott Marine Mammal Rescue Assistance Grant Program, including by renaming the program as the John H. Prescott Marine Mammal Rescue and Response Grant Program. The bill also establishes the Joseph R. Geraci Marine Mammal Rescue and Rapid Response Fund for providing emergency financial assistance for certain stranded or entangled marine mammals and otherwise provides support for marine mammals."
        },
        {
            "Bill Number": "H.R. 396 (117th)",
            "First Name": "Jenniffer  González-Colón",
            "Last Name": "cosponsor",
            "Role": "H.R. 396 (117th)",
            "Bill Name": "Transit Security Grant Program Flexibility Act",
            "Subject Areas": "Transportation employees, Transportation programs funding, Transportation safety and security",
            "Summary": "This bill establishes periods of performance for the use of public transportation security assistance grant funds. Funds provided pursuant to such a grant for a specified authorized use, including for tunnel protection systems and surveillance equipment, shall remain available for use by a grant recipient for at least 36 months. However, any such funds used for security improvements for public transportation systems or security improvements for stations and other public transportation infrastructure, including those owned by state or local governments, shall remain available for at least 55 months.The Government Accountability Office shall conduct a review of the public transportation security assistance grant program, including an assessment of the manner in which projects under the program address threats to public transportation infrastructure."
        },
        {
            "Bill Number": "H.R. 5141 (117th)",
            "First Name": "Jenniffer  González-Colón",
            "Last Name": "cosponsor",
            "Role": "H.R. 5141 (117th)",
            "Bill Name": "Maximizing Outcomes through Better Investments in Lifesaving Equipment for (MOBILE) Health Care Act",
            "Subject Areas": "Health, Building construction, Dental care, Health care coverage and access, Health facilities and institutions, Health programs administration and funding, Health promotion and preventive care, Health technology, devices, supplies, Motor vehicles",
            "Summary": "This bill allows a health center that currently receives funding through a Health Resources & Services Administration Health Center Program grant to use a New Access Point grant to set up a mobile unit regardless of whether the health center also establishes a permanent health care delivery site.New Access Point grants help health centers establish new delivery sites to provide comprehensive primary care to medically underserved populations. Under current law, health centers may only use the grants to set up a mobile unit if they also establish a permanent site."
        },
        {
            "Bill Number": "H.R. 4814 (117th)",
            "First Name": "Jenniffer  González-Colón",
            "Last Name": "cosponsor",
            "Role": "H.R. 4814 (117th)",
            "Bill Name": "To obtain and direct the placement in the Capitol or on the Capitol Grounds of a statue to honor Associate Justice of the Supreme Court of the United States Sandra Day O\\u2019Connor and a statue to honor Associate Justice of the Supreme Cou",
            "Subject Areas": "Art, artists, authorship, Congress, Congressional tributes, Government buildings, facilities, and property, Judges, Supreme Court, U.S. Capitol",
            "Summary": "This bill requires the Joint Committee on the Library to obtain, and the Architect of the Capitol to permanently install in the U.S. Capitol or on the U.S. Capitol Grounds, statues honoring Associate Justices of the Supreme Court Sandra Day O'Connor and Ruth Bader Ginsburg."
        },
        {
            "Bill Number": "H.R. 3070 (117th)",
            "First Name": "Jenniffer  González-Colón",
            "Last Name": "cosponsor",
            "Role": "H.R. 3070 (117th)",
            "Bill Name": "COPS Counseling Act",
            "Subject Areas": NaN,
            "Summary": "This bill sets forth requirements related to peer support counseling programs. A peer support counseling program is a program provided by a law enforcement agency that provides counseling services from a peer support specialist to a law enforcement officer of the agency.Among other things, the bill does the following: generally prohibits the disclosure of the contents of a peer support communication, and requires the Department of Justice to develop best practices and professional standards for peer support counseling programs."
        }
    ]
}