{
    "Name": "Joseph  Sempolinski",
    "VotingRecord": [
        {
            "Bill Number": "H.R. 2617 (117th)",
            "First Name": "Joseph Sempolinski",
            "Vote": "Nay",
            "Bill Number.1": "H.R. 2617 (117th)",
            "Bill Name": "Consolidated Appropriations Act, 2023",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1917 (117th)",
            "First Name": "Joseph Sempolinski",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1917 (117th)",
            "Bill Name": "Hazard Eligibility and Local Projects Act",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1437 (117th)",
            "First Name": "Joseph Sempolinski",
            "Vote": "Nay",
            "Bill Number.1": "H.R. 1437 (117th)",
            "Bill Name": "Further Continuing Appropriations and Extensions Act, 2023",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3630 (117th)",
            "First Name": "Joseph Sempolinski",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3630 (117th)",
            "Bill Name": "Lymphedema Treatment Act",
            "Summary": "This bill provides for Medicare coverage of lymphedema compression treatment items. Specifically, the bill provides for coverage of standard and custom fitted gradient compression garments and other approved items that are prescribed by a physician or other specified health care professional to treat lymphedema.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 2250 (117th)",
            "First Name": "Joseph Sempolinski",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 2250 (117th)",
            "Bill Name": "Department of Veterans Affairs Information Technology Reform Act of 2021",
            "Summary": "This bill addresses the management and implementation of information technology projects and investments of the Department of Veterans Affairs (VA).Specifically, the bill prohibits the VA from obligating or expending funds for any major information technology project that begins after the date of enactment of this bill unless a report is submitted that includes information on the cost, schedule, and performance of the project, as generated by the business owner of the project. The information in the report must be used as a baseline against which changes or variances are measured and reported on during the life cycle of the project. Projects must be managed by an interdisciplinary team that includes a certified project manager, a functional lead, a technical lead, a contracting officer, and other appropriate personnel.The VA's Chief Information Officer must (1) exercise authority over the management, governance, and oversight processes relating to existing or proposed information technology of the VA's Financial Services Center; and (2) supervise the information technology employees and contractors of the center.The VA must ensure its annual budget justification materials include a list of its active information technology projects and specified information about such projects, projected funding needs for projects, and a prioritized list of every proposed project that is unfunded.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 6833 (117th)",
            "First Name": "Joseph Sempolinski",
            "Vote": "Nay",
            "Bill Number.1": "H.R. 6833 (117th)",
            "Bill Name": "Continuing Appropriations and Ukraine Supplemental Appropriations Act, 2023",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 6965 (117th)",
            "First Name": "Joseph Sempolinski",
            "Vote": "Nay",
            "Bill Number.1": "H.R. 6965 (117th)",
            "Bill Name": "Visit America Act",
            "Summary": "This bill implements measures to support the U.S. travel and tourism industry and to address the declining percentage of international visitors to the United States.Specifically, the bill requires the Department of Commerce to develop a 10-year travel and tourism strategy with annual goals for the number of international visitors to the United States and for tourism commerce. The bill also establishes the role of Assistant Secretary of Commerce for Travel and Tourism, whose responsibilities shall include setting an annual goal for the number of international visitors to the United States and facilitating international business travel to the United States.Further, the assistant secretary must develop and implement a COVID-19 pandemic recovery strategy to assist the recovery of the U.S. travel and tourism industry.The bill also provides statutory authority for the United States Travel and Tourism Advisory Board, which shall aid the assistant secretary in developing and implementing the COVID-19 pandemic recovery strategy.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3843 (117th)",
            "First Name": "Joseph Sempolinski",
            "Vote": "Nay",
            "Bill Number.1": "H.R. 3843 (117th)",
            "Bill Name": "Merger Filing Fee Modernization Act of 2022",
            "Summary": "This bill modifies and expands the schedule for graduated merger filing fees and requires that such fees be adjusted each year based on the Consumer Price Index. It also (1) requires parties to disclose in their premerger notification filings any subsidy received from a foreign entity of concern, (2) modifies the venue rules for multi-district antitrust litigation, and (3) establishes various reporting requirements.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 884 (117th)",
            "First Name": "Joseph Sempolinski",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 884 (117th)",
            "Bill Name": "National Aviation Preparedness Plan Act of 2022",
            "Summary": "This bill directs the Department of Transportation (DOT) to develop a national aviation preparedness plan for communicable disease outbreaks, including to (1) create a process to identify appropriate personal protective equipment to reduce the likelihood of exposure to a communicable disease that has the potential to cause an epidemic or pandemic of infectious disease that would constitute a public health emergency of international concern (i.e., a covered communicable disease); and (2) improve coordination between airports, air carriers, and governmental entities with respect to preparing for and responding to communicable disease outbreaks.In developing the plan, DOT must consult with aviation industry and labor stakeholders such as air carriers.The Government Accountability Office must conduct a study assessing the plan, including (1) whether the plan meets the obligations of the United States under international conventions and treaties, and (2) the extent to which the U.S. aviation system is prepared to respond to an outbreak of a covered communicable disease.",
            "Status": "Enacted"
        }
    ],
    "CosponsoredBills": [
        {
            "Bill Number": "H.R. 9028 (117th)",
            "First Name": "Joseph  Sempolinski",
            "Last Name": "cosponsor",
            "Role": "H.R. 9028 (117th)",
            "Bill Name": "21st Century Assistive Technology Act",
            "Subject Areas": "Social Welfare",
            "Summary": NaN
        }
    ]
}