{
    "Name": "Lori  emer",
    "CosponsoredBills": [
        {
            "Bill Number": "H.R. 1722",
            "First Name": "Lori  emer",
            "Last Name": "cosponsor",
            "Role": "H.R. 1722",
            "Bill Name": "Grand Ronde Reservation Act Amendment of 2023",
            "Subject Areas": "Native Americans, Federal-Indian relations, Gambling, Indian lands and resources rights, Land transfers, Oregon",
            "Summary": "This bill revises the land claims of the Confederated Tribes of the Grand Ronde Community of Oregon. In particular, the bill specifies that only the tribe's claims to the 84 acres of land known as the Thompson Strip, rather than the tribe's claims to any lands within Oregon, are extinguished.Additionally, the bill prohibits gaming on any real property obtained by the tribe as part of a land claim settlement approved by the United States, including any real property purchased with funds granted as part of any land claim settlement."
        },
        {
            "Bill Number": "H.R. 2839",
            "First Name": "Lori  emer",
            "Last Name": "cosponsor",
            "Role": "H.R. 2839",
            "Bill Name": "To amend the Siletz Reservation Act to address the hunting, fishing, trapping, and animal gathering rights of the Confederated Tribes of Siletz Indians, and for other purposes.",
            "Subject Areas": "Native Americans, Public Lands and Natural Resources, Indian lands and resources rights",
            "Summary": "This bill provides a process by which the Confederated Tribes of Siletz Indians and Oregon may negotiate to amend or replace the existing agreement defining the tribe's hunting, fishing, trapping, and animal gathering rights.The current agreement, which was made effective by a May 2, 1980, consent decree by the U.S. District Court for the District of Oregon, serves as the exclusive and final determination of the tribe's hunting, fishing, trapping, and gathering rights. This bill instead allows an April 22, 1980, agreement between the United States, Oregon, and the tribe (known as the Siletz Agreement) to define the tribe's rights until and unless it is amended or replaced upon mutual agreement of the tribe and Oregon (with specified limitations regarding a new agreement).The bill allows the tribe and Oregon to return to the U.S. District Court for the District of Oregon to request the modification or termination of the May 2, 1980, consent decree."
        },
        {
            "Bill Number": "H.R. 5110",
            "First Name": "Lori  emer",
            "Last Name": "cosponsor",
            "Role": "H.R. 5110",
            "Bill Name": "Protecting Hunting Heritage and Education Act",
            "Subject Areas": "Outdoor recreation, School athletics",
            "Summary": NaN
        },
        {
            "Bill Number": "H.R. 5233",
            "First Name": "Lori  emer",
            "Last Name": "cosponsor",
            "Role": "H.R. 5233",
            "Bill Name": "To amend the Passport Act of June 4, 1920, to make certain improvements with respect to expenditure and other authorities, and for other purposes.",
            "Subject Areas": "Immigration",
            "Summary": NaN
        },
        {
            "Bill Number": "H.R. 1096",
            "First Name": "Lori  emer",
            "Last Name": "cosponsor",
            "Role": "H.R. 1096",
            "Bill Name": "250th Anniversary of the United States Marine Corps Commemorative Coin Act",
            "Subject Areas": "Military personnel and dependents",
            "Summary": "This bill directs the Department of the Treasury to mint and issue not more than 50,000 $5 gold coins, 400,000 $1 silver coins, and 750,000 half-dollar clad coins emblematic of the 250th anniversary of the United States Marine Corps.All surcharges received by Treasury from the sale of such coins must be paid to the Marine Corps Heritage Foundation and shall only be used for the purposes of supporting the mission of the Marine Corps Heritage Center."
        },
        {
            "Bill Number": "H.R. 1401",
            "First Name": "Lori  emer",
            "Last Name": "cosponsor",
            "Role": "H.R. 1401",
            "Bill Name": "END FENTANYL Act",
            "Subject Areas": "Immigration",
            "Summary": "This bill requires U.S. Customs and Border Protection to review and update, as necessary, manuals and policies related to inspections at ports of entry to ensure the uniformity of inspection practices to effectively detect illegal activity along the border, such as the smuggling of drugs and humans."
        }
    ],
    "SponsoredBills": [
        {
            "Bill Number": "H.R. 3895",
            "First Name": "Lori  emer",
            "Last Name": "sponsor",
            "Role": "H.R. 3895",
            "Bill Name": "Fiscal Year 2023 Veterans Affairs Major Medical Facility Authorization Act",
            "Subject Areas": "Armed Forces and National Security",
            "Summary": "This bill authorizes the Department of Veterans Affairs to carry out specified major medical facility projects during FY2023. The bill also indicates the maximum amount that can be spent on each project."
        }
    ]
}