{
    "Name": "Marcia  Fudge",
    "VotingRecord": [
        {
            "Bill Number": "H.R. 1319 (117th)",
            "First Name": "Marcia Fudge",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1319 (117th)",
            "Bill Name": "American Rescue Plan Act of 2021",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1319 (117th)",
            "First Name": "Marcia Fudge",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1319 (117th)",
            "Bill Name": "American Rescue Plan Act of 2021",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1192 (117th)",
            "First Name": "Marcia Fudge",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1192 (117th)",
            "Bill Name": "PRRADA",
            "Summary": "This bill requires professionals employed in debt adjustment cases involving Puerto Rico to file verified statements disclosing their connections with interested parties before seeking compensation for their services.The Financial Oversight and Management Board for Puerto Rico must establish a list of such interested parties, which shall include the debtor, creditors, any attorney or accountant of the debtor or creditors, persons employed by the U.S. Trustee Program, persons employed by the board, and any other interested party.Compensation may be denied to such a professional if these disclosures are not filed, are inadequate, or if the professional is found to have certain conflicts of interest.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 208 (117th)",
            "First Name": "Marcia Fudge",
            "Vote": "Not Voting",
            "Bill Number.1": "H.R. 208 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 500 West Main Street, Suite 102 in Tupelo, Mississippi, as the Colonel Carlyle Smitty Harris Post Office.",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 335 (117th)",
            "First Name": "Marcia Fudge",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 335 (117th)",
            "Bill Name": "To provide for an exception to a limitation against appointment of persons as Secretary of Defense within seven years of relief from active duty as a regular commissioned officer of the Armed Forces.",
            "Summary": "This bill allows the first person nominated and appointed as Secretary of Defense after 12 p.m. (Eastern Standard Time) on January 20, 2021, to be a person who is, on the date of appointment, at least four years after relief from active duty as a commissioned officer of a regular component of the Armed Forces. Under current law, an individual may not be appointed as Secretary of Defense within seven years after relief from such active duty.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 22 (117th)",
            "First Name": "Marcia Fudge",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 22 (117th)",
            "Bill Name": "Congressional Budget Justification Transparency Act of 2021",
            "Summary": "This bill requires federal agencies to make budget justification materials available to the public on a website. The bill also requires the Office of Management and Budget to make certain details regarding the materials available to the public, including a list of the agencies that submit budget justification materials to Congress, the dates that the materials are submitted to Congress and posted online, and links to the materials.",
            "Status": "Enacted"
        }
    ],
    "CosponsoredBills": [
        {
            "Bill Number": "H.R. 1057 (117th)",
            "First Name": "Marcia  Fudge",
            "Last Name": "cosponsor",
            "Role": "H.R. 1057 (117th)",
            "Bill Name": "Greatest Generation Commemorative Coin Act",
            "Subject Areas": "Finance and Financial Sector, Conflicts and wars, Currency, Military history, Monuments and memorials, U.S. history, Veterans' organizations and recognition",
            "Summary": "This bill directs the Department of the Treasury to mint and issue up to 50,000 $5 coins, 400,000 $1 silver coins, and 750,000 half-dollar clad coins in commemoration of the National World War II Memorial in the District of Columbia.The design of the coins shall be emblematic of the memorial and the service and sacrifice of American soldiers and civilians during World War II.All surcharges received from the sale of such coins shall be paid to the Friends of the National World War II Memorial to support the National Park Service in maintaining and repairing the memorial, and for educational and commemorative programs."
        },
        {
            "Bill Number": "H.R. 1448 (117th)",
            "First Name": "Marcia  Fudge",
            "Last Name": "cosponsor",
            "Role": "H.R. 1448 (117th)",
            "Bill Name": "PAWS for Veterans Therapy Act",
            "Subject Areas": "Armed Forces and National Security, Animal protection and human-animal relationships, Congressional oversight, Disability assistance, Government information and archives, Government studies and investigations, Health programs administration and funding, Mammals, Mental health, Neurological disorders, Service animals, Veterans' education, employment, rehabilitation, Veterans' medical care",
            "Summary": "This bill implements a program and a policy related to service dog therapy for veterans. Specifically, the bill requires the Department of Veterans Affairs (VA) to implement a five-year pilot program to provide canine training to eligible veterans diagnosed with post-traumatic stress disorder as an element of a complementary and integrative health program. Eligible veterans are those who are enrolled in the VA health care system and have been recommended for participation by a qualified mental health care provider or clinical team.The VA must seek to enter agreements containing specified elements with accredited nongovernmental entities that have demonstrated ability to provide canine training.Veterans who participate in the program are authorized to adopt the dog they assisted in training if their health provider determines it is in the best interest of the veteran.The VA must establish processes to document and track the progress of participating veterans with respect to health benefits and improvements. The Government Accountability Office must brief Congress and submit a report on the program.The bill also authorizes the VA to provide service dogs to veterans with mental illnesses, regardless of whether they have a mobility impairment."
        },
        {
            "Bill Number": "H.R. 1085 (117th)",
            "First Name": "Marcia  Fudge",
            "Last Name": "cosponsor",
            "Role": "H.R. 1085 (117th)",
            "Bill Name": "To award three congressional gold medals to the United States Capitol Police and those who protected the U.S. Capitol on January 6, 2021.",
            "Subject Areas": "Assault and harassment offenses, Congress, Congressional tributes, Crimes against property, District of Columbia, Government buildings, facilities, and property, Law enforcement officers, Museums, exhibitions, cultural centers, Protest and dissent, Smithsonian Institution, Subversive activities, Terrorism, U.S. Capitol, Violent crime",
            "Summary": "This bill directs the Speaker of the House and the President pro tempore of the Senate to arrange for the award of three Congressional Gold Medals to the U.S. Capitol Police (USCP) and other law enforcement agencies that protected the U.S. Capitol on January 6, 2021.Following the award of these medals, one medal shall be given to the USCP, one medal shall be given to the Metropolitan Police Department of the District of Columbia, and one medal shall be given to the Smithsonian Institution and displayed with a plaque listing all law enforcement agencies that participated in protecting the Capitol on January 6, 2021."
        },
        {
            "Bill Number": "H.R. 960 (117th)",
            "First Name": "Marcia  Fudge",
            "Last Name": "cosponsor",
            "Role": "H.R. 960 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 3493 Burnet Avenue in Cincinnati, Ohio, as the John H. Leahr and Herbert M. Heilbrun Post Office.",
            "Subject Areas": "Government Operations and Politics, Congressional tributes, Government buildings, facilities, and property, Ohio, Postal service",
            "Summary": "This bill designates the facility of the United States Postal Service located at 3493 Burnet Avenue in Cincinnati, Ohio, as the John H. Leahr and Herbert M. Heilbrun Post Office."
        }
    ]
}