{
    "Name": "Shelley  Capito",
    "CosponsoredBills": [
        {
            "Bill Number": "S. 788",
            "First Name": "Shelley  Capito",
            "Last Name": "cosponsor",
            "Role": "S. 788",
            "Bill Name": "Duck Stamp Modernization Act of 2023",
            "Subject Areas": "Public Lands and Natural Resources, Birds, Digital media, Postal service, State and local government operations",
            "Summary": NaN
        },
        {
            "Bill Number": "S. 2828",
            "First Name": "Shelley  Capito",
            "Last Name": "cosponsor",
            "Role": "S. 2828",
            "Bill Name": "Protecting Hunting Heritage and Education Act",
            "Subject Areas": NaN,
            "Summary": "This bill authorizes the use of federal elementary and secondary education funds to purchase or use dangerous weapons for purposes of providing students with educational instruction or educational enrichment activities, such as archery, hunting, other shooting sports, or culinary arts.Current law prohibits the use of these funds to provide any person with a dangerous weapon or training in the use of a dangerous weapon. The bill specifies that this prohibition shall not apply to the use of these funds for permissible program activities that provide students with educational instruction or educational enrichment activities, such as archery, hunting, other shooting sports, or culinary arts."
        },
        {
            "Bill Number": "S. 305",
            "First Name": "Shelley  Capito",
            "Last Name": "cosponsor",
            "Role": "S. 305",
            "Bill Name": "250th Anniversary of the United States Marine Corps Commemorative Coin Act",
            "Subject Areas": "Military personnel and dependents",
            "Summary": "This bill directs the Department of the Treasury to mint and issue not more than 50,000 $5 gold coins, 400,000 $1 silver coins, and 750,000 half-dollar clad coins emblematic of the 250th anniversary of the United States Marine Corps.All surcharges received by Treasury from the sale of such coins must be paid to the Marine Corps Heritage Foundation and shall only be used for the purposes of supporting the mission of the Marine Corps Heritage Center."
        },
        {
            "Bill Number": "S. 1280",
            "First Name": "Shelley  Capito",
            "Last Name": "cosponsor",
            "Role": "S. 1280",
            "Bill Name": "Testing, Rapid Analysis, and Narcotic Quality Research Act of 2023",
            "Subject Areas": "Science, Technology, Communications, Advanced technology and technological innovations, Chemistry, Congressional oversight, Drug trafficking and controlled substances, Higher education, Research administration and funding, Science and engineering education",
            "Summary": "This bill requires the National Institute of Standards and Technology (NIST) to support research and other activities related to identifying xylazine (a compound used in veterinary medicine as a nonopioid tranquilizer), novel synthetic opioids, and other new psychoactive substances.In particular, NIST must support basic measurement science and research, including graduate and postgraduate research; near-real time spectrometry capabilities (i.e., a technique for rapidly identifying the chemical composition of a substance); strategies and voluntary best practices for handling, transporting, and analyzing such substances; and collaboration with other government agencies, institutions of higher education, and the private sector to enhance relevant narcotic and opioid detection and analysis capabilities. The Government Accountability Office must evaluate the capability of the federal government to respond to the threats posed by new psychoactive substances like xylazine, including with respect to available technology and laboratories."
        },
        {
            "Bill Number": "S. 66",
            "First Name": "Shelley  Capito",
            "Last Name": "cosponsor",
            "Role": "S. 66",
            "Bill Name": "NOTAM Improvement Act of 2023",
            "Subject Areas": "Transportation and Public Works, Administrative law and regulatory procedures, Advisory bodies, Aviation and airports, Congressional oversight, Department of Transportation, Executive agency funding and structure, Government studies and investigations, Transportation employees, Transportation safety and security",
            "Summary": "This bill directs the Federal Aviation Administration (FAA) to establish the FAA Task Force on NOTAM (notice to air missions required by international or domestic law) Improvement. A NOTAM is a notice containing information essential to personnel concerned with flight operations but not known far enough in advance to be publicized by other means. It states the abnormal status of a component of the National Airspace System.Specifically, the task force must (1) review existing methods for presenting NOTAMs and flight operations information for pilots; (2) review regulations and policies relating to NOTAMs, including their content and presentation to pilots; (3) evaluate and determine best practices to organize, prioritize, and present flight operations information in a manner that optimizes pilot review and retention of relevant information; (4) provide recommendations to improve the presentation of NOTAM information; and (5) report to Congress on its reviews and evaluations."
        },
        {
            "Bill Number": "S.J.Res. 12",
            "First Name": "Shelley  Capito",
            "Last Name": "cosponsor",
            "Role": "S.J.Res. 12",
            "Bill Name": "A joint resolution disapproving the action of the District of Columbia Council in approving the Revised Criminal Code Act of 2022.",
            "Subject Areas": "Government Operations and Politics, Congressional oversight, Criminal procedure and sentencing, District of Columbia, Due process and equal protection, State and local government operations, Violent crime",
            "Summary": NaN
        },
        {
            "Bill Number": "S. 450 (117th)",
            "First Name": "Shelley  Capito",
            "Last Name": "cosponsor",
            "Role": "S. 450 (117th)",
            "Bill Name": "Emmett Till and Mamie Till-Mobley Congressional Gold Medal Act of 2021",
            "Subject Areas": "Racial and ethnic relations, Smithsonian Institution, U.S. history",
            "Summary": NaN
        },
        {
            "Bill Number": "S. 4120 (117th)",
            "First Name": "Shelley  Capito",
            "Last Name": "cosponsor",
            "Role": "S. 4120 (117th)",
            "Bill Name": "Childhood Cancer STAR Reauthorization Act",
            "Subject Areas": "Health, Cancer, Child health, Computers and information technology, Congressional oversight, Government studies and investigations, Health programs administration and funding, Health technology, devices, supplies, Medical research, Research administration and funding, Research and development",
            "Summary": NaN
        },
        {
            "Bill Number": "S. 1942 (117th)",
            "First Name": "Shelley  Capito",
            "Last Name": "cosponsor",
            "Role": "S. 1942 (117th)",
            "Bill Name": "National Heritage Area Act",
            "Subject Areas": "Public Lands and Natural Resources, Congressional oversight, Government studies and investigations, Historic sites and heritage areas",
            "Summary": "This bill establishes a National Heritage Area System.Through administering the heritage areas of such system, the Department of the Interior may provide technical and financial assistance to local coordinating entities to support the establishment, development, and continuity of such areas.The National Heritage Area System shall be composed of each National Heritage Area, National Heritage Corridor, National Heritage Canalway, Cultural Heritage Corridor, National Heritage Route, and National Heritage Partnership designated by Congress before or on enactment of this bill; and each National Heritage Area designated by Congress after enactment of this bill. A National Heritage Area shall not be considered to be a unit of the National Park System nor subject to the authorities applicable to such units.Interior may carry out or review a study to assess the suitability and feasibility of each proposed heritage area for designation as a National Heritage Area. Interior must review and certify whether the proposed area meets specified requirements, including that it has natural, historic, and cultural resources that represent distinctive aspects of the heritage of the United States.An area shall be designated as a National Heritage Area only by an act of Congress.Interior shall conduct a study to assess the suitability and feasibility of designating specified areas in Virginia and North Carolina as the Great Dismal Swamp National Heritage Area.The bill also establishes or extends specified National Heritage Areas.The bill redesignates the America's Agricultural Heritage Partnership in Iowa as the Silos & Smokestacks National Heritage Area.The bill extends the deadline for the management plans for certain heritage areas."
        },
        {
            "Bill Number": "S. 2333 (117th)",
            "First Name": "Shelley  Capito",
            "Last Name": "cosponsor",
            "Role": "S. 2333 (117th)",
            "Bill Name": "Equal Pay for Team USA Act of 2022",
            "Subject Areas": "Sports and Recreation, Athletes, Congressional oversight, Employee benefits and pensions, Employment discrimination and employee rights, Olympic games, Sex, gender, sexual orientation discrimination, Wages and earnings",
            "Summary": "This bill requires that all athletes representing the United States in international amateur athletic competitions receive equal compensation and benefits for their work, regardless of gender.Each national governing body for a sport must report annually on compliance with this requirement.The bill requires full compliance by January 31, 2022."
        },
        {
            "Bill Number": "S. 4003 (117th)",
            "First Name": "Shelley  Capito",
            "Last Name": "cosponsor",
            "Role": "S. 4003 (117th)",
            "Bill Name": "Law Enforcement De-Escalation Training Act of 2022",
            "Subject Areas": "Crime and Law Enforcement, Community life and organization, Congressional oversight, Disability and health-based discrimination, Drug, alcohol, tobacco use, Employment and training programs, Government information and archives, Government studies and investigations, Health personnel, Intergovernmental relations, Law enforcement administration and funding, Law enforcement officers, Mental health, Performance measurement, Public-private cooperation, State and local government operations",
            "Summary": NaN
        },
        {
            "Bill Number": "S. 3115 (117th)",
            "First Name": "Shelley  Capito",
            "Last Name": "cosponsor",
            "Role": "S. 3115 (117th)",
            "Bill Name": "POWER 2.0 Act",
            "Subject Areas": "Crime and Law Enforcement, Assault and harassment offenses, Crime victims, Domestic violence and child abuse, Federal district courts, Lawyers and legal services, Sex offenses, Violent crime",
            "Summary": NaN
        },
        {
            "Bill Number": "S. 198 (117th)",
            "First Name": "Shelley  Capito",
            "Last Name": "cosponsor",
            "Role": "S. 198 (117th)",
            "Bill Name": "Data Mapping to Save Moms\\u2019 Lives Act",
            "Subject Areas": "Health, Congressional oversight, Government studies and investigations, Health information and medical records, Health technology, devices, supplies, Intergovernmental relations, Internet and video services, Women's health",
            "Summary": NaN
        },
        {
            "Bill Number": "S. 3662 (117th)",
            "First Name": "Shelley  Capito",
            "Last Name": "cosponsor",
            "Role": "S. 3662 (117th)",
            "Bill Name": "Preventing PFAS Runoff at Airports Act",
            "Subject Areas": NaN,
            "Summary": NaN
        },
        {
            "Bill Number": "S. 3957 (117th)",
            "First Name": "Shelley  Capito",
            "Last Name": "cosponsor",
            "Role": "S. 3957 (117th)",
            "Bill Name": "STREAM Act",
            "Subject Areas": "Hazardous wastes and toxic substances, Land use and conservation, Mining, Water quality",
            "Summary": "This bill allows a state to set aside up to 30% of its annual grant for abandoned mine reclamation provided under the Infrastructure Investment and Jobs Act for the treatment and abatement of acid mine drainage, which is the release of acidic water from abandoned coal mines."
        },
        {
            "Bill Number": "S. 4587 (117th)",
            "First Name": "Shelley  Capito",
            "Last Name": "cosponsor",
            "Role": "S. 4587 (117th)",
            "Bill Name": "Benjamin Berell Ferencz Congressional Gold Medal Act",
            "Subject Areas": "International Affairs",
            "Summary": "This bill provides for the award of a Congressional Gold Medal to Benjamin Berell Ferencz in recognition of his service to the United States and the international community during the post-World War II Nuremberg trials and his lifelong advocacy for international criminal justice and the rule of law."
        },
        {
            "Bill Number": "S. 1872 (117th)",
            "First Name": "Shelley  Capito",
            "Last Name": "cosponsor",
            "Role": "S. 1872 (117th)",
            "Bill Name": "United States Army Rangers Veterans of World War II Congressional Gold Medal Act",
            "Subject Areas": "Museums, exhibitions, cultural centers, Smithsonian Institution, Veterans' organizations and recognition",
            "Summary": "This bill provides for the award of a single Congressional Gold Medal to the U.S. Army Rangers Veterans of World War II in recognition of their dedicated service during World War II."
        },
        {
            "Bill Number": "S. 1596 (117th)",
            "First Name": "Shelley  Capito",
            "Last Name": "cosponsor",
            "Role": "S. 1596 (117th)",
            "Bill Name": "Greatest Generation Memorial Act",
            "Subject Areas": "Finance and Financial Sector, Conflicts and wars, Currency, Military history, Monuments and memorials, U.S. history, Veterans' organizations and recognition",
            "Summary": "This bill directs the Department of the Treasury to mint and issue up to 50,000 $5 coins, 400,000 $1 silver coins, and 750,000 half-dollar clad coins in commemoration of the National World War II Memorial in the District of Columbia.The design of the coins shall be emblematic of the memorial and the service and sacrifice of American soldiers and civilians during World War II.All surcharges received from the sale of such coins shall be paid to the Friends of the National World War II Memorial to support the National Park Service in maintaining and repairing the memorial, and for educational and commemorative programs."
        },
        {
            "Bill Number": "S. 3522 (117th)",
            "First Name": "Shelley  Capito",
            "Last Name": "cosponsor",
            "Role": "S. 3522 (117th)",
            "Bill Name": "Ukraine Democracy Defense Lend-Lease Act of 2022",
            "Subject Areas": "International Affairs, Alliances, Collective security, Computer security and identity theft, Conflicts and wars, Congressional oversight, Europe, Foreign aid and international relief, Infrastructure development, Military assistance, sales, and agreements, Military operations and strategy, Russia, Sovereignty, recognition, national governance and status, Subversive activities, Ukraine",
            "Summary": "This bill temporarily waives certain requirements related to the President's authority to lend or lease defense articles if the defense articles are intended for Ukraine's government or the governments of other Eastern European countries affected by Russia's invasion of Ukraine.For FY2022 and FY2023, an agreement to lend or lease defense articles under this bill shall not be subject to certain requirements and provisions that typically apply to such lend-lease agreements, including a requirement that generally prohibits a loan or lease period from exceeding five years.The President must establish expedited procedures to ensure the timely delivery of defense articles loaned or leased to Ukraine under this bill."
        },
        {
            "Bill Number": "S. 400 (117th)",
            "First Name": "Shelley  Capito",
            "Last Name": "cosponsor",
            "Role": "S. 400 (117th)",
            "Bill Name": "William T. Coleman, Jr. and Norman Y. Mineta Department of Transportation Headquarters Act",
            "Subject Areas": NaN,
            "Summary": "This bill designates the headquarters building of the Department of Transportation located at 1200 New Jersey Avenue, SE, in Washington, DC, as the William T. Coleman, Jr. and Norman Y. Mineta Federal Building."
        },
        {
            "Bill Number": "S. 3262 (117th)",
            "First Name": "Shelley  Capito",
            "Last Name": "cosponsor",
            "Role": "S. 3262 (117th)",
            "Bill Name": "FREIGHT Act",
            "Subject Areas": NaN,
            "Summary": "This bill makes multiple changes to address the efficiency of ports and the intermodal shipping of cargo.The Bureau of Transportation Statistics of the Department of Transportation must publish data about the dwell time of marine shipping containers and chassis (i.e., the quantity of time such equipment is subject to maintenance versus in use). The bill also requires a study on best practices for operating a chassis pool to optimize supply chains.In addition, the bill modifies duties and authorities of the Federal Maritime Commission (FMC), including by providing statutory authority for an office that offers mediation and related services to resolve issues under the FMC's jurisdiction; and authorizing the FMC to expand data-sharing between port operators, shippers, and other stakeholders to facilitate efficient freight operations if the FMC determines port congestion constitutes an emergency."
        },
        {
            "Bill Number": "S. 120 (117th)",
            "First Name": "Shelley  Capito",
            "Last Name": "cosponsor",
            "Role": "S. 120 (117th)",
            "Bill Name": "Safe Connections Act of 2021",
            "Subject Areas": "Crime and Law Enforcement, Science, Technology, Communications, Administrative law and regulatory procedures, Assault and harassment offenses, Business records, Civil actions and liability, Congressional oversight, Consumer affairs, Crime victims, Crimes against women, Domestic violence and child abuse, Emergency communications systems, Federal Communications Commission (FCC), Government information and archives, Human trafficking, Right of privacy, Sex offenses, Telecommunication rates and fees, Telephone and wireless communication",
            "Summary": "This bill establishes requirements concerning access to communication services for survivors of domestic violence, human trafficking, and related harms.At a survivor's request, a mobile service provider must separate from a shared mobile service contract the survivor's line (and the line of any individual in the survivor's care) from the abuser's line unless separation is operationally or technologically infeasible. A survivor requesting this must (1) verify through appropriate documentation that an individual under the contract committed or allegedly committed an act of domestic violence, trafficking, or a related criminal act against the survivor; and (2) assume financial responsibility for services after a line separation.A provider may not charge fees or impose other requirements on such requests. Additionally, a provider must separate the line within two business days of receiving a request; allow requests to be made remotely (if feasible); meet conditions related to confidentiality of, disposal of, and other matters concerning communications about requests; and make information about the process for requests available through consumer-facing communications (e.g., websites). The bill (1) provides liability protection for providers' acts or omissions undertaken to comply with such requests, and (2) requires the Federal Communications Commission (FCC) to adopt rules for these requests.Additionally, the FCC must (1) expand access to federally subsidized communication services for survivors facing financial hardship, and (2) evaluate this expanded access.The FCC must also consider rules requiring communication service providers to omit from consumer-facing logs calls and texts to hotlines for domestic violence and similar issues while retaining internal records."
        },
        {
            "Bill Number": "S. 1543 (117th)",
            "First Name": "Shelley  Capito",
            "Last Name": "cosponsor",
            "Role": "S. 1543 (117th)",
            "Bill Name": "STANDUP Act of 2021",
            "Subject Areas": "Employment and training programs, Government information and archives, Health programs administration and funding, Health promotion and preventive care, Mental health, Minority education, Minority health",
            "Summary": "This bill requires the Department of Health and Human Services (HHS), when awarding certain grants for priority mental-health needs, to give preference to state, tribal, and local educational agencies that plan to implement evidence-based suicide awareness and prevention training policies. HHS may also consider suicide rates in the applicable jurisdiction and other factors when awarding the grants.In addition, HHS must coordinate with the Department of Education and the Department of the Interior to provide educational agencies with best practices for these training policies."
        },
        {
            "Bill Number": "S. 697 (117th)",
            "First Name": "Shelley  Capito",
            "Last Name": "cosponsor",
            "Role": "S. 697 (117th)",
            "Bill Name": "Harriet Tubman Bicentennial Commemorative Coin Act",
            "Subject Areas": "Finance and Financial Sector, Commemorative events and holidays, Currency, Racial and ethnic relations, U.S. history, Women's rights",
            "Summary": "This bill directs the Department of the Treasury to mint and issue 50,000 $5 gold coins, 400,000 $1 silver coins, and 750,000 half-dollar clad coins emblematic of the legacy of Harriet Tubman as an abolitionist.The Secretary may issue coins under this bill only during the period of January 1, 2024, through December 31, 2024.All surcharges received by Treasury from the sale of such coins must be paid equally to the National Underground Railroad Freedom Center in Cincinnati, Ohio, and The Harriet Tubman Home, Inc. in Auburn, New York, for the purpose of accomplishing and advancing their missions."
        },
        {
            "Bill Number": "S. 3623 (117th)",
            "First Name": "Shelley  Capito",
            "Last Name": "cosponsor",
            "Role": "S. 3623 (117th)",
            "Bill Name": "Violence Against Women Act Reauthorization Act of 2022",
            "Subject Areas": "Crime and Law Enforcement, Administrative remedies, Advisory bodies, Aging, Assault and harassment offenses, Cardiovascular and respiratory health, Child health, Child safety and welfare, Civil actions and liability, Commemorative events and holidays, Computer security and identity theft, Congressional oversight, Crime prevention, Crime victims, Crimes against children, Crimes against women, Criminal investigation, prosecution, interrogation, Criminal justice information and records, Criminal procedure and sentencing, Department of Justice, Detention of persons, Disability and paralysis, Domestic violence and child abuse, Drug, alcohol, tobacco use, Education programs funding, Elementary and secondary education, Emergency medical services and trauma care, Evidence and witnesses, Executive agency funding and structure, Federal officials, Firearms and explosives, Genetics, Government information and archives, Government studies and investigations, Health care coverage and access, Health facilities and institutions, Health information and medical records, Health personnel, Health programs administration and funding, Health promotion and preventive care, Higher education, Homelessness and emergency shelter, Housing and community development funding, Housing supply and affordability, Human trafficking, Indian social and development programs, Infectious and parasitic diseases, Intergovernmental relations, Judicial procedure and administration, Law enforcement administration and funding, Law enforcement officers, Marriage and family status, Medical education, Medical tests and diagnostic methods, Minority health, Nursing, Photography and imaging, Pornography, Rural conditions and development, Separation, divorce, custody, support, Sex offenses, Sex, gender, sexual orientation discrimination, Small business, Smuggling and trafficking, Social work, volunteer service, charitable organizations, State and local courts, State and local government operations, Violent crime, Women's health",
            "Summary": "This bill modifies and reauthorizes through FY2027 programs and activities under the Violence Against Women Act that seek to prevent and respond to domestic violence, sexual assault, dating violence, and stalking.The bill also authorizes new programs, makes changes to federal criminal laws, and establishes new protections to promote housing stability and economic security for victims of domestic violence, sexual assault, dating violence, and stalking."
        },
        {
            "Bill Number": "S. 1404 (117th)",
            "First Name": "Shelley  Capito",
            "Last Name": "cosponsor",
            "Role": "S. 1404 (117th)",
            "Bill Name": "Ghost Army Congressional Gold Medal Act",
            "Subject Areas": NaN,
            "Summary": "This bill provides for the award of a Congressional Gold Medal to the 23rd Headquarters Special Troops and the 3133rd Signal Services Company, known collectively as the Ghost Army, in recognition of unique and highly distinguished service during World War II."
        },
        {
            "Bill Number": "S. 452 (117th)",
            "First Name": "Shelley  Capito",
            "Last Name": "cosponsor",
            "Role": "S. 452 (117th)",
            "Bill Name": "Willie O\\u2019Ree Congressional Gold Medal Act",
            "Subject Areas": "Racial and ethnic relations",
            "Summary": NaN
        },
        {
            "Bill Number": "S. 2342 (117th)",
            "First Name": "Shelley  Capito",
            "Last Name": "cosponsor",
            "Role": "S. 2342 (117th)",
            "Bill Name": "Ending Forced Arbitration of Sexual Assault and Sexual Harassment Act of 2021",
            "Subject Areas": NaN,
            "Summary": "This bill invalidates arbitration agreements that preclude a party from filing a lawsuit in court involving sexual assault or sexual harassment, at the election of the party alleging such conduct."
        },
        {
            "Bill Number": "S. 3122 (117th)",
            "First Name": "Shelley  Capito",
            "Last Name": "cosponsor",
            "Role": "S. 3122 (117th)",
            "Bill Name": "Further Surface Transportation Extension Act of 2021",
            "Subject Areas": NaN,
            "Summary": "This bill extends and revises provisions related to federal-aid highway, transit, highway safety, rail, and other surface transportation programs of the Department of Transportation.Specifically, the bill extends FY2021 enacted levels of funding through December 3, 2021, for federal-aid highway, transit, and safety programs; and extends expenditure authority through December 4, 2021, for the Highway Trust Fund, Sport Fish Restoration and Boating Trust Fund, and the Leaking Underground Storage Tank Trust Fund."
        },
        {
            "Bill Number": "S. 544 (117th)",
            "First Name": "Shelley  Capito",
            "Last Name": "cosponsor",
            "Role": "S. 544 (117th)",
            "Bill Name": "A bill to direct the Secretary of Veterans Affairs to designate one week each year as \\u201cBuddy Check Week\\u201d for the purpose of outreach and education concerning peer wellness checks for veterans, and for other purposes.",
            "Subject Areas": "Health promotion and preventive care, Mental health, Social work, volunteer service, charitable organizations, Telephone and wireless communication, Veterans' medical care",
            "Summary": "This bill requires the Department of Veterans Affairs (VA) to designate one week each year as Buddy Check Week for the purposes of organizing outreach events and educating veterans on how to conduct peer wellness checks. The VA shall ensure that the Veterans Crisis Line has a plan for handling the potential increase in calls that may occur during such week."
        },
        {
            "Bill Number": "S. 2756 (117th)",
            "First Name": "Shelley  Capito",
            "Last Name": "cosponsor",
            "Role": "S. 2756 (117th)",
            "Bill Name": "A bill to posthumously award a Congressional Gold Medal, in commemoration of the service members who perished as a result of the attack in Afghanistan on August 26, 2021, during the evacuation of citizens of the United States and Afghan",
            "Subject Areas": "Armed Forces and National Security, International Affairs, Afghanistan, Asia, Conflicts and wars, Congressional tributes, Emergency planning and evacuation, Military operations and strategy, Military personnel and dependents, Museums, exhibitions, cultural centers, Smithsonian Institution, Terrorism",
            "Summary": "This bill posthumously provides for the award of a Congressional Gold Medal in commemoration of the 13 service members who died on August 26, 2021, while stationed at Hamid Karzai International Airport in Afghanistan."
        },
        {
            "Bill Number": "S. 273 (117th)",
            "First Name": "Shelley  Capito",
            "Last Name": "cosponsor",
            "Role": "S. 273 (117th)",
            "Bill Name": "Driftnet Modernization and Bycatch Reduction Act",
            "Subject Areas": "Marine and coastal resources, fisheries, Pacific Ocean",
            "Summary": "This bill addresses certain driftnet fishing. Driftnet fishing is a method of fishing in which a gillnet composed of a panel or panels of webbing, or a series of such gillnets, is placed in the water and allowed to drift with the currents and winds for the purpose of entangling fish in the webbing.Currently, the use of large-scale drift gillnets with a total length of 2.5 kilometers or more is prohibited in the United States.The bill expands the definition of large-scale driftnet fishing to prohibit the use of gillnets with a mesh size of 14 inches or greater. This expanded prohibition does not apply within the U.S. exclusive economic zone for five years.The Department of Commerce must conduct a transition program to facilitate the phase out of large-scale driftnet fishing and to promote the adoption of alternative fishing practices that minimize the incidental catch of living marine resources.Commerce must award grants to program participants.The North Pacific Fishery Management Council may recommend and Commerce may approve regulations that require charter operators to pay fees on vessels that harvest Pacific halibut in specific International Pacific Halibut Commission regulatory areas."
        },
        {
            "Bill Number": "S. 2647 (117th)",
            "First Name": "Shelley  Capito",
            "Last Name": "cosponsor",
            "Role": "S. 2647 (117th)",
            "Bill Name": "Harlem Hellfighters Congressional Gold Medal Act",
            "Subject Areas": "Armed Forces and National Security",
            "Summary": "This bill provides for the award of a Congressional Gold Medal to the 369th Infantry Regiment, commonly known as the Harlem Hellfighters, in recognition of their bravery and outstanding service during World War I."
        },
        {
            "Bill Number": "S. 3377 (117th)",
            "First Name": "Shelley  Capito",
            "Last Name": "cosponsor",
            "Role": "S. 3377 (117th)",
            "Bill Name": "Capitol Police Emergency Assistance Act of 2021",
            "Subject Areas": "Administrative law and regulatory procedures, Civil disturbances, Congress, Congressional agencies, Congressional leadership, Congressional officers and employees, Congressional operations and organization, Congressional oversight, Crime prevention, Emergency planning and evacuation, Government buildings, facilities, and property, Intergovernmental relations, Law enforcement administration and funding, Law enforcement officers, Military civil functions, Military personnel and dependents, Protection of officials, State and local government operations, U.S. Capitol",
            "Summary": "This bill allows the chief of the U.S. Capitol Police to request emergency assistance from executive departments and executive agencies to prevent significant disruption of governmental function and public order at the U.S. Capitol. The bill also eliminates statutory qualification and approval requirements for law enforcement and uniformed service personnel appointed to serve as special police officers, including during periods of emergency initiated by the chief under the bill. Further, special police regulations prescribed by the U.S. Capitol Police Board are subject to approval by the Speaker of the House and Senate majority leader under the bill. Those regulations are subject to approval by the Speaker and the President pro tempore of the Senate under current law.Finally, the bill requires the Senate Committee on Rules and Administration and the House Committee on House Administration to jointly conduct at least one oversight hearing of the U.S. Capitol Police Board during each Congress."
        },
        {
            "Bill Number": "S. 1953 (117th)",
            "First Name": "Shelley  Capito",
            "Last Name": "cosponsor",
            "Role": "S. 1953 (117th)",
            "Bill Name": "Surface Transportation Reauthorization Act of 2021",
            "Subject Areas": "Transportation and Public Works, Accidents, Advanced technology and technological innovations, Advisory bodies, Appalachian Regional Commission, Atmospheric science and weather, Aviation and airports, Congressional oversight, Disaster relief and insurance, Economic development, Economic performance and conditions, Emergency planning and evacuation, Energy research, Energy storage, supplies, demand, Environmental assessment, monitoring, research, Floods and storm protection, Government information and archives, Government lending and loan guarantees, Government studies and investigations, Government trust funds, Horticulture and plants, Indian lands and resources rights, Infrastructure development, Insects, Kentucky, Materials, Motor carriers, Motor vehicles, Natural disasters, Oil and gas, Oklahoma, Pedestrians and bicycling, Public transit, Public-private cooperation, Regional and metropolitan planning, Roads and highways, Rural conditions and development, State and local government operations, Terrorism, Transportation costs, Transportation programs funding, Transportation safety and security, Wildlife conservation and habitat protection",
            "Summary": "This bill reauthorizes through FY2026, revises, and establishes multiple transportation programs and activities, including those supported by the Highway Trust Fund.This includes incorporating data-driven practices and other changes to transportation planning activities; modifying requirements concerning contracting methods, compliance with federal environmental laws, and additional aspects of delivering and improving processes related to transportation projects; mitigating climate change through, among other efforts, programs to reduce emissions and supporting alternative fueling infrastructure; and addressing transportation safety, new transportation technologies and systems, storm water management, cybersecurity, active transportation, and other miscellaneous matters. In addition, the bill modifies eligibility criteria and other elements of a program that provides loans and other types of credit for surface transportation projects of regional and national significance.Further, the bill makes changes to research and related activities carried out by the Department of Transportation (DOT). For example, DOT must carry out and support research on (1) user-based alternative revenue mechanisms to support the Highway Trust Fund, (2) automated vehicles and other new technologies, and (3) development of data sets to measure performance and other aspects of transportation programs.The bill also authorizes through FY2026 funding for the Department of the Interior for road maintenance and otherwise addresses transportation programs for Indian tribes."
        },
        {
            "Bill Number": "S. 1813 (117th)",
            "First Name": "Shelley  Capito",
            "Last Name": "cosponsor",
            "Role": "S. 1813 (117th)",
            "Bill Name": "Accelerating Access to Critical Therapies for ALS Act",
            "Subject Areas": "Health care coverage and access, Health programs administration and funding, Health promotion and preventive care, Higher education, Medical research, Medical tests and diagnostic methods, Neurological disorders, Prescription drugs, Public-private cooperation, Research administration and funding, Research and development, Social work, volunteer service, charitable organizations",
            "Summary": "This bill establishes grant programs to address neurodegenerative diseases, such as amyotrophic lateral sclerosis (also known as ALS or Lou Gehrig's disease), and contains other related provisions.The Department of Health and Human Services (HHS) shall award grants to eligible entities to facilitate patients' access to investigational drugs that diagnose or treat ALS. The Food and Drug Administration (FDA) shall award grants to public and private entities to cover the costs of research and development of drugs that diagnose or treat ALS and other severely debilitating neurodegenerative diseases.HHS shall also establish the Public-Private Partnership for Neurodegenerative Diseases between the National Institutes of Health, the FDA, and at least one eligible entity (generally, an institution of higher education or a nonprofit organization). The partnership shall support the development and regulatory review of drugs that address ALS and other rare neurodegenerative diseases.The FDA shall publish on its website a five-year action plan for fostering the development of drugs that improve or extend the lives of people living with rare neurodegenerative diseases."
        },
        {
            "Bill Number": "S. 1720 (117th)",
            "First Name": "Shelley  Capito",
            "Last Name": "cosponsor",
            "Role": "S. 1720 (117th)",
            "Bill Name": "Postal Service Reform Act of 2021",
            "Subject Areas": "Government Operations and Politics, Congressional oversight, Executive agency funding and structure, Government employee pay, benefits, personnel management, Government information and archives, Government studies and investigations, Health care costs and insurance, Health care coverage and access, Intergovernmental relations, Medicare, Performance measurement, Postal Regulatory Commission, Postal service, Public participation and lobbying, Retail and wholesale trades, State and local government operations, U.S. Postal Service",
            "Summary": "This bill addresses the finances and operations of the U.S. Postal Service (USPS).The bill requires the Office of Personnel Management to establish, within the Federal Employees Health Benefits Program, the Postal Service Health Benefits Program for USPS employees and retirees and provides for coordinated enrollment of retirees under this program and Medicare. The bill repeals the requirement that the USPS annually prepay future retirement health benefits.Additionally, the USPS may establish a program to enter into agreements with an agency of any state government, local government, or tribal government, and with other government agencies, to provide certain nonpostal products and services that reasonably contribute to the costs of the USPS and meet other specified criteria.The USPS must develop and maintain a publicly available dashboard to track service performance and must report regularly on its operations and financial condition.The bill requires mail delivery to occur at least six days a week.The Postal Regulatory Commission must annually submit to the USPS a budget of its expenses. It must also conduct a study to identify the causes and effects of postal inefficiencies relating to flats (e.g., large envelopes).The USPS Office of Inspector General shall perform oversight of the Postal Regulatory Commission."
        },
        {
            "Bill Number": "S. 935 (117th)",
            "First Name": "Shelley  Capito",
            "Last Name": "cosponsor",
            "Role": "S. 935 (117th)",
            "Bill Name": "Rural Health Clinic Protection Act",
            "Subject Areas": "Hospital care, Infectious and parasitic diseases, Medicare, Rural conditions and development",
            "Summary": "This bill applies certain modified payment limits to rural health clinics that temporarily enrolled in Medicare during the public health emergency relating to COVID-19 or that applied to enroll by December 31, 2020."
        },
        {
            "Bill Number": "S. 1301",
            "First Name": "Shelley  Capito",
            "Last Name": "cosponsor",
            "Role": "S. 1301",
            "Bill Name": "[Increase of Public Debt Limit]",
            "Subject Areas": "Economics and Public Finance, Health, Budget deficits and national debt, Government information and archives, Health promotion and preventive care, Physical fitness and lifestyle",
            "Summary": "This bill became the vehicle for passage of the public debt limit increase with the House vote on September 29, 2021. Prior to the House vote on that date, the bill was the Promoting Physical Activity for Americans Act, a bill on an unrelated subject.  Last updated Oct 8, 2021.View all GovTrack summaries.The summary below was written by the Congressional Research Service, which is a nonpartisan division of the Library of Congress, and was published on Oct 15, 2021.This bill increases the public debt limit by $480 billion."
        },
        {
            "Bill Number": "S. 866 (117th)",
            "First Name": "Shelley  Capito",
            "Last Name": "cosponsor",
            "Role": "S. 866 (117th)",
            "Bill Name": "Repairing Existing Public Land by Adding Necessary Trees Act",
            "Subject Areas": "Animal and plant health, Atmospheric science and weather, Climate change and greenhouse gases, Congressional oversight, Ecology, Fires, Forests, forestry, trees, Government trust funds, Insects, Land use and conservation, Outdoor recreation, Pest management, Water quality, Wildlife conservation and habitat protection",
            "Summary": "This bill directs the Department of Agriculture (USDA) annually for each of the 10 years after enactment of this bill to transmit to Congress an estimate of the sums necessary to be appropriated, in addition to the funds available from other sources, to replant and otherwise treat an acreage equal to the acreage to be cut over that year, plus a sufficient portion of the backlog of lands found to be in need of treatment to eliminate the backlog within the 10-year period.After such 10-year period, USDA shall transmit annually to Congress an estimate of the sums necessary to replant and otherwise treat all lands being cut over and maintain planned timber production on all other forested lands in the National Forest System to prevent the development of a backlog of needed work larger than the needed work at the beginning of the fiscal year.Each reforestation activity included in a renewable resource assessment shall be carried out in accordance with applicable Forest Service management practices and definitions, including definitions relating to silvicultural practices and forest management.The Forest Service shall, based on recommendations from regional foresters, create a priority list of reforestation projects that primarily take place on priority land, promote effective reforestation following unplanned events, and may include activities to ensure adequate and appropriate seed availability.USDA shall give priority to projects on the priority list."
        },
        {
            "Bill Number": "S. 799 (117th)",
            "First Name": "Shelley  Capito",
            "Last Name": "cosponsor",
            "Role": "S. 799 (117th)",
            "Bill Name": "SCALE Act",
            "Subject Areas": "Environmental technology, Government lending and loan guarantees, Labor standards, Licensing and registrations, Manufacturing, Metals, Public contracts and procurement, Public utilities and utility rates, Technology transfer and commercialization, Wages and earnings, Water quality, Water use and supply",
            "Summary": "This bill establishes programs within the Department of Energy that provide financial support and incentives to develop infrastructure for carbon dioxide capture, transport, utilization, and storage."
        },
        {
            "Bill Number": "S. 723 (117th)",
            "First Name": "Shelley  Capito",
            "Last Name": "cosponsor",
            "Role": "S. 723 (117th)",
            "Bill Name": "PPP Extension Act of 2021",
            "Subject Areas": "Commerce, Business expenses, Cardiovascular and respiratory health, Emergency medical services and trauma care, Government lending and loan guarantees, Infectious and parasitic diseases, Small business, Wages and earnings",
            "Summary": "This bill extends the Paycheck Protection Program, established to support small businesses in response to COVID-19 (i.e., coronavirus disease 2019), through June 30, 2021. Currently, the program is set to expire on March 31, 2021.For the final 30 days of the program (i.e., from June 1 until June 30), the Small Business Administration may only process applications submitted prior to June 1, and it may not accept any new loan applications."
        },
        {
            "Bill Number": "S. 611 (117th)",
            "First Name": "Shelley  Capito",
            "Last Name": "cosponsor",
            "Role": "S. 611 (117th)",
            "Bill Name": "VOCA Fix to Sustain the Crime Victims Fund Act of 2021",
            "Subject Areas": "Crime and Law Enforcement, Civil actions and liability, Crime victims, Criminal investigation, prosecution, interrogation, Emergency medical services and trauma care, Government trust funds, Infectious and parasitic diseases, Law enforcement administration and funding, State and local government operations",
            "Summary": "This bill adds a new source of revenue for the Crime Victims Fund and makes changes to formula grants supported by the fund.Specifically, the bill directs revenues collected from deferred prosecution and non-prosecution agreements to be deposited into the Crime Victims Fund. Currently, such revenues are deposited into the general fund of the Treasury.Additionally, the bill increases the percentage—from 60% to 75%—of state compensation payments to crime victims in the prior fiscal year used to calculate formula grants for state victim compensation programs.Finally, the bill directs states to waive the matching requirement for recipients of state victim assistance formula grants during and for one year after a pandemic-related national emergency. It also allows states to waive the matching requirement pursuant to a policy established by the state."
        },
        {
            "Bill Number": "S. 435 (117th)",
            "First Name": "Shelley  Capito",
            "Last Name": "cosponsor",
            "Role": "S. 435 (117th)",
            "Bill Name": "Secure Rural Schools Reauthorization Act of 2021",
            "Subject Areas": "Education programs funding, Educational technology and distance education, Elementary and secondary education, Fires, First responders and emergency personnel, Forests, forestry, trees, Internet and video services, Land use and conservation, Montana, Property tax, Public contracts and procurement, Rural conditions and development, State and local finance, State and local taxation",
            "Summary": "This bill extends through FY2023 payments made to states and eligible counties containing certain federal land under the Secure Rural Schools and Community Self-Determination Act of 2000.The Department of the Interior and the Department of Agriculture shall carry out a pilot program to allow the Chief of the Forest Service or the Director of the Bureau of Land Management to nominate members of resource advisory committees.County funds may be used to provide or expand access to (1) broadband telecommunications services at local schools, or (2) the technology and connectivity necessary for students to use a digital learning tool at or outside of a local school campus.Any county funds that were obligated by a county before October 1, 2017, but are unspent on October 1, 2020, may be used by the county for any authorized use and shall be available for projects initiated after October 1, 2020.No county funds may be used for lobbying activity, regardless of the purpose for which the funds are obligated on or before the enactment of this bill."
        },
        {
            "Bill Number": "S. 321 (117th)",
            "First Name": "Shelley  Capito",
            "Last Name": "cosponsor",
            "Role": "S. 321 (117th)",
            "Bill Name": "\\u201cSix Triple Eight\\u201d Congressional Gold Medal Act of 2021",
            "Subject Areas": "Military history, Military personnel and dependents, Minority employment, Museums, exhibitions, cultural centers, Postal service, Smithsonian Institution, Women's employment",
            "Summary": "This bill provides for the award of a Congressional Gold Medal to the women of the 6888th Central Postal Directory Battalion (commonly known as the Six Triple Eight) in recognition of their pioneering military service, devotion to duty, and contributions to increase the morale of personnel stationed in the European theater of operations during World War II."
        },
        {
            "Bill Number": "S. 26 (117th)",
            "First Name": "Shelley  Capito",
            "Last Name": "cosponsor",
            "Role": "S. 26 (117th)",
            "Bill Name": "Drug-Free Communities Pandemic Relief Act",
            "Subject Areas": "Health, Cardiovascular and respiratory health, Drug, alcohol, tobacco use, Emergency medical services and trauma care, Health programs administration and funding, Health promotion and preventive care, Infectious and parasitic diseases",
            "Summary": "This bill authorizes the Drug-Free Communities Support Program, subject to certain limitations, to waive matching funds requirements applicable to certain grants for reducing substance use among youth. Before waiving these requirements, the program must determine that a grantee is unable to raise funds because of the COVID-19 (i.e. coronavirus disease 2019) emergency.Currently, the Office of National Drug Control Policy administers this program, and community coalitions that receive the grants must match a specified percentage of the federal award amount with nonfederal funds, including in-kind contributions."
        },
        {
            "Bill Number": "S. 3975 (117th)",
            "First Name": "Shelley  Capito",
            "Last Name": "cosponsor",
            "Role": "S. 3975 (117th)",
            "Bill Name": "Victims of Child Abuse Act Reauthorization Act of 2022",
            "Subject Areas": "Crime and Law Enforcement",
            "Summary": NaN
        },
        {
            "Bill Number": "S. 3824 (117th)",
            "First Name": "Shelley  Capito",
            "Last Name": "cosponsor",
            "Role": "S. 3824 (117th)",
            "Bill Name": "Into the Light for MMH and SUD Act of 2022",
            "Subject Areas": NaN,
            "Summary": "This bill reauthorizes through FY2028 a program that addresses maternal depression and, among other changes, expands its scope to include mental health and substance use disorders. It also requires the Department of Health and Human Services to maintain a national hotline to provide mental health and substance use disorder resources to pregnant and postpartum women and their families."
        },
        {
            "Bill Number": "S. 610 (117th)",
            "First Name": "Shelley  Capito",
            "Last Name": "cosponsor",
            "Role": "S. 610 (117th)",
            "Bill Name": "Protecting Medicare and American Farmers from Sequester Cuts Act",
            "Subject Areas": "Health, Administrative law and regulatory procedures, Budget deficits and national debt, Budget process, Cancer, Cardiovascular and respiratory health, Congressional oversight, Department of Health and Human Services, Drug, alcohol, tobacco use, Education programs funding, Emergency medical services and trauma care, Government studies and investigations, Health care costs and insurance, Health care quality, Health personnel, Health programs administration and funding, Health promotion and preventive care, Infectious and parasitic diseases, Legislative rules and procedure, Medical education, Medicare, Mental health, Natural disasters, Nursing, Radiation, Worker safety and health",
            "Summary": "This bill makes several budgetary, technical, and procedural changes, particularly in relation to Medicare and increasing the debt limit.Specifically, the bill continues to exempt Medicare from sequestration until March 31, 2022. (Sequestration is a process of automatic, usually across-the-board spending reductions under which budgetary resources are permanently cancelled to enforce specific budget policy goals.)The bill also establishes expedited Senate procedures for considering legislation to increase the debt limit. The procedures limit debate, waive points of order, and prohibit amendments. The procedures may only be used once and expire after January 16, 2022.Additionally, the bill (1) temporarily extends other provisions under Medicare, including a payment increase under the physician fee schedule; and (2) requires any debits recorded for FY2022 on the statutory pay-as-you-go (PAYGO) scorecards to be deducted from the scorecards for 2022 and added to the scorecards for 2023."
        },
        {
            "Bill Number": "S. 372 (117th)",
            "First Name": "Shelley  Capito",
            "Last Name": "cosponsor",
            "Role": "S. 372 (117th)",
            "Bill Name": "Ensuring Quality Care for Our Veterans Act",
            "Subject Areas": "Hospital care, Licensing and registrations, Public contracts and procurement, Veterans' medical care",
            "Summary": "This bill directs the Department of Veterans Affairs (VA) to contract with a nonfederal organization to conduct a quality management review of hospital care or medical services furnished by each Veterans Health Administration (VHA) provider whose license was terminated by a state licensing board based upon care or services provided in a non-VHA facility.If a review determines that the standard of care was not met, the VA shall notify the individual who received such care or services."
        },
        {
            "Bill Number": "S. 1061 (117th)",
            "First Name": "Shelley  Capito",
            "Last Name": "cosponsor",
            "Role": "S. 1061 (117th)",
            "Bill Name": "Israel Relations Normalization Act of 2021",
            "Subject Areas": "Congressional oversight, Criminal investigation, prosecution, interrogation, Diplomacy, foreign officials, Americans abroad, Economic development, Foreign aid and international relief, Foreign language and bilingual programs, Government information and archives, Health programs administration and funding, Human rights, International exchange and broadcasting, International organizations and cooperation, Iran, Israel, Middle East, Military assistance, sales, and agreements, Museums, exhibitions, cultural centers, Palestinians, Political movements and philosophies, Racial and ethnic relations, Religion, Rule of law and government transparency, Sovereignty, recognition, national governance and status, United Arab Emirates, War crimes, genocide, crimes against humanity, Water use and supply",
            "Summary": "This bill requires the Department of State to take certain actions promoting the normalization of relations between Israel, Arab states, and other relevant countries and regions.Specifically, the State Department must develop a strategy on expanding and strengthening the Abraham Accords (the term used to refer collectively to agreements between Israel and the United Arab Emirates and between Israel and Bahrain marking the public normalization of relations between the two Arab countries and Israel). The strategy must include a description of how the U.S. government will encourage further normalization of relations with Israel.The State Department must report on the status of efforts to promote normalization of relations with Israel and other countries, including information on (1) laws that punish individuals for people-to-people relations with Israelis (i.e., anti-normalization laws), and (2) instances of the use of state-owned or state-operated media outlets to promote the prosecution of citizens or residents of Arab countries calling for peace with Israel."
        },
        {
            "Bill Number": "S. 475 (117th)",
            "First Name": "Shelley  Capito",
            "Last Name": "cosponsor",
            "Role": "S. 475 (117th)",
            "Bill Name": "Juneteenth National Independence Day Act",
            "Subject Areas": "Civil Rights and Liberties, Minority Issues, Commemorative events and holidays, Racial and ethnic relations, U.S. history",
            "Summary": "This bill establishes Juneteenth National Independence Day, June 19, as a legal public holiday."
        },
        {
            "Bill Number": "S. 1491 (117th)",
            "First Name": "Shelley  Capito",
            "Last Name": "cosponsor",
            "Role": "S. 1491 (117th)",
            "Bill Name": "Rural MOMS Act",
            "Subject Areas": "Department of Health and Human Services, Drug, alcohol, tobacco use, Employment and training programs, Executive agency funding and structure, Government studies and investigations, Health care coverage and access, Health care quality, Health facilities and institutions, Health information and medical records, Health personnel, Health programs administration and funding, Health promotion and preventive care, Health technology, devices, supplies, Higher education, Indian social and development programs, Medical education, Mental health, Minority health, Nursing, Performance measurement, Rural conditions and development, Sex and reproductive health, Teaching, teachers, curricula, Telephone and wireless communication, Women's health",
            "Summary": "This bill expands initiatives to address maternal health in rural areas.The bill requires the Health Resources and Services Administration (HRSA) to establish rural obstetric networks. These networks must foster collaboration to improve birth outcomes and reduce maternal morbidity in rural areas. HRSA also must award demonstration grants to medical schools and other health professional training programs to support education and training on maternal health in rural areas.In addition, the bill incorporates maternal health services in certain telehealth grant programs. It also revises various research and other activities of the Department of Health and Human Services that pertain to maternal health."
        },
        {
            "Bill Number": "S. 914 (117th)",
            "First Name": "Shelley  Capito",
            "Last Name": "cosponsor",
            "Role": "S. 914 (117th)",
            "Bill Name": "Drinking Water and Wastewater Infrastructure Act of 2021",
            "Subject Areas": "Environmental Protection, Water Resources Development, Air quality, Alaska, Alaska Natives and Hawaiians, Alternative and renewable resources, Atmospheric science and weather, Child care and development, Child health, Climate change and greenhouse gases, Computer security and identity theft, Congressional oversight, Educational facilities and institutions, Elementary and secondary education, Employment and training programs, Energy efficiency and conservation, Environmental assessment, monitoring, research, Environmental technology, Floods and storm protection, Government information and archives, Government lending and loan guarantees, Government studies and investigations, Hazardous wastes and toxic substances, Indian social and development programs, Infrastructure development, Minority health, Poverty and welfare assistance, Public utilities and utility rates, Public-private cooperation, Regional and metropolitan planning, Rural conditions and development, Small towns, Social work, volunteer service, charitable organizations, Solid waste and recycling, State and local finance, Water quality, Water resources funding, Water storage, Water use and supply, Watersheds",
            "Summary": "This bill reauthorizes through FY2026 or establishes a variety of programs for water infrastructure. Specifically, it supports programs to provide safe drinking water or treat wastewater, such as sewer overflows or stormwater. For example, the bill reauthorizes and revises the clean water state revolving fund (SRF) and the drinking water SRF."
        },
        {
            "Bill Number": "S. 1418 (117th)",
            "First Name": "Shelley  Capito",
            "Last Name": "cosponsor",
            "Role": "S. 1418 (117th)",
            "Bill Name": "Bioeconomy Research and Development Act of 2021",
            "Subject Areas": "Alternative and renewable resources, Biological and life sciences, Cell biology and embryology, Competitiveness, trade promotion, trade deficits, Computers and information technology, Congressional oversight, Economic performance and conditions, Education programs funding, Elementary and secondary education, Environmental assessment, monitoring, research, Environmental technology, Executive Office of the President, Executive agency funding and structure, Genetics, Higher education, Industrial facilities, Manufacturing, Medical ethics, Medical research, Military education and training, Military procurement, research, weapons development, Minority education, Product development and innovation, Public-private cooperation, Research administration and funding, Research and development, Research ethics, Science and engineering education, Small business, Space flight and exploration, Teaching, teachers, curricula, Technology assessment, Technology transfer and commercialization",
            "Summary": "This bill directs the Office of Science and Technology Policy (OSTP) to implement a National Engineering Biology Research and Development Initiative to advance societal well-being, national security, sustainability, and economic productivity and competitiveness. Among other activities, the initiative must include sustained support for research centers, individual investigators, technologies, and training.The initiative shall include outreach to primarily undergraduate and minority-serving institutions about initiative opportunities, and shall encourage the development of research collaborations between research-intensive universities and such institutions.The OSTP shall designate an interagency committee to coordinate initiative activities as appropriate.The interagency committee shall submit triennial reports to Congress through FY2028 in support of the initiative.The National Science Foundation (NSF) shall seek to enter into an agreement with the National Academies of Sciences, Engineering, and Medicine to conduct a review of, and make recommendations with respect to, the ethical, legal, environmental, safety, security, and other appropriate societal issues related to engineering biology research and development. The NSF, National Institute of Standards and Technology, Department of Energy, Department of Defense, National Aeronautics and Space Administration (NASA), Department of Agriculture, and Department of Health and Human Services shall carry out related activities as part of the initiative."
        },
        {
            "Bill Number": "S. 1408 (117th)",
            "First Name": "Shelley  Capito",
            "Last Name": "cosponsor",
            "Role": "S. 1408 (117th)",
            "Bill Name": "A bill to posthumously award the Congressional Gold Medal, collectively, to Glen Doherty, Tyrone Woods, J. Christopher Stevens, and Sean Smith, in recognition of their contributions to the Nation.",
            "Subject Areas": "Intelligence activities, surveillance, classified information, Law enforcement officers, Libya, Middle East, Terrorism, Veterans' organizations and recognition",
            "Summary": "This bill provides for the award of Congressional Gold Medals posthumously to Glen Doherty, Tyrone Woods, J. Christopher Stevens, and Sean Smith (four Americans who were killed in the September 11, 2012, attack on the U.S. consulate in Benghazi, Libya) in recognition of their contributions to the nation."
        },
        {
            "Bill Number": "S. 1352 (117th)",
            "First Name": "Shelley  Capito",
            "Last Name": "cosponsor",
            "Role": "S. 1352 (117th)",
            "Bill Name": "A bill to improve the quality and timeliness of Federal permitting and review processes with respect to critical mineral production on Federal land, and for other purposes.",
            "Subject Areas": "Energy, Competitiveness, trade promotion, trade deficits, Congressional oversight, Energy efficiency and conservation, Energy storage, supplies, demand, Federal-Indian relations, Government information and archives, Intergovernmental relations, Land use and conservation, Licensing and registrations, Mining, Performance measurement, State and local government operations",
            "Summary": "This bill establishes deadlines for the Bureau of Land Management and the Forest Service to complete the federal permitting and review process with respect to critical mineral production on federal lands. It also establishes related requirements to expedite the process and remove impediments to the production of critical minerals and the mineral security of the United States."
        },
        {
            "Bill Number": "S. 3294 (117th)",
            "First Name": "Shelley  Capito",
            "Last Name": "cosponsor",
            "Role": "S. 3294 (117th)",
            "Bill Name": "A bill to obtain and direct the placement in the Capitol or on the Capitol Grounds of a statue to honor Associate Justice of the Supreme Court of the United States Sandra Day O\\u2019Connor and a statue to honor Associate Justice of the Suprem",
            "Subject Areas": "Art, artists, authorship, Congress, Congressional tributes, Government buildings, facilities, and property, Judges, Supreme Court, U.S. Capitol",
            "Summary": "This bill requires the Joint Committee on the Library to obtain, and the Architect of the Capitol to permanently install in the U.S. Capitol or on the U.S. Capitol Grounds, statues honoring Associate Justices of the Supreme Court Sandra Day O'Connor and Ruth Bader Ginsburg."
        },
        {
            "Bill Number": "S. 4573 (117th)",
            "First Name": "Shelley  Capito",
            "Last Name": "cosponsor",
            "Role": "S. 4573 (117th)",
            "Bill Name": "Electoral Count Reform and Presidential Transition Improvement Act of 2022",
            "Subject Areas": "Constitution and constitutional amendments, Elections, voting, political campaign regulation, Federal district courts, Federal officials, Government information and archives, Intergovernmental relations, Judges, Judicial review and appeals, Legislative rules and procedure, Presidents and presidential powers, Vice Presidents, State and local government operations, Supreme Court, Voting rights",
            "Summary": "This bill would mark the biggest correction to the process of counting since John-John corrected Herry Monster on Sesame Street.Context: 2020–21Joe Biden defeated Donald Trump in the 2020 presidential election. He won by both 306–232 in the Electoral College and by 51.3% to 46.8% in the popular vote, a difference of roughly seven million votes.During the subsequent two months between the election and its official certification in Congress, numerous attempts were made to change that result: by Donald Trump himself, by his legal team, by his Republican allies in Congress, and by thousands of his supporters during the violent insurrection upon the Capitol Building on January 6, 2021 while Congress officially counted and certified the Electoral College results.None of the Trump team’s attempts proved successful.The Supreme Court rejected all of the Trump team’s legal challenges. State election officials, even Republican ones, refused to change their election certifications. Congressional Republicans’ attempts to challenge several states’ results, notably for Biden-supporting Arizona and Pennsylvania, failed. And Vice President Mike Pence refused to go along with an obscure legal theory pushed by Trump and his allies that, as vice president, he could unilaterally refuse to certify the election results.Context: 1887Most of the current rules regarding all these procedures date back more than a century, to the Electoral Count Act of 1887.The law was inspired by the convoluted and heavily-disputed presidential election of 1876.First, the candidate who received a majority of the popular vote (Democrat Samuel Tilden) failed to earn a majority of the Electoral College. Then, several states sent competing rival slates of electors to Congress — the Democrats sending a Democratic slate, the Republicans sending a Republican slate. On top of that, Congress appointed an unprecedented 15-member commission to essentially decide which candidate should be declared the winner.By only a single vote, 8–7, the commission declared in favor of Republican Rutherford B. Hayes. That single deciding vote was cast by Supreme Court Justice David Davis, who had originally been nominated 14 years earlier by Abraham Lincoln.The 1887 law was controversial even at the time; a law review article only the next year called it “very confused, almost unintelligible.” One of the law’s sentences even runs 275 words long.For about 134 years, though, it arguably worked well enough. That is, until the events of 2020–21 laid bare several potential landmines in America’s electoral system which the law wouldn’t prevent — or, in some cases, would even inadvertently create.What the bill doesThe Electoral Count Reform and Presidential Transition Improvement Act would make several policy changes:Clarify the vice president’s role. Under current law, Congress counts and certifies the Electoral College votes to make it official, during a process led by the vice president, per their role as the president of the Senate%20presides.). This bill would clarify that the vice president’s role in the Electoral College certification is purely ceremonial, and that they don’t actually have the power to change, overrule, or nullify any part of the count.Raises the threshold for Congress to object. Under current law, only one House member and one senator need to object to a state’s Electoral College certification, in order for Congress to vote on whether to exclude that state’s electors. For the 2020 election, those two thresholds were far exceeded: for Arizona, 121 House members and six senators objected; for Pennsylvania, 138 House members and seven senators. This bill would increase both thresholds for objection to one-fifth of both the House and Senate. Had this bill been law at the time, the Senate wouldn’t have met that threshold (although the House still would have).Clarifies which electors count. In case two or more factions within a state each try to send competing slates of electors to Congress for the official count, this bill lays out means for Congress to identify a single slate of electors from each state. It requires Congress to identify one state official (often the secretary of state) responsible for certifying their state’s electors, and requires the state’s electors themselves to be appointed prior to Election Day.**Harder to declare a “failed election.” **The bill also overturns a provision from the Presidential Election Day Act of 1845, which allows a state’s legislature to override their state’s popular vote if the legislature declares a “failed election.” Several states considered this option, namely ones in which the populace voted for Biden even though the legislature was still controlled by Republicans. (No state actually followed through.) This bill would only allow a legislature to override in case of “extraordinary and catastrophic” events.The bill was introduced in the Senate on July 20 as S. 4573, by Sen. Susan Collins (R-ME).What supporters saySupporters argue that the 2020 election was a near-disaster for the American system’s peaceful transfer of power, and 2024 or another future election could be a breaking point unless we fix the laws now.“We have before us an historic opportunity to modernize and strengthen our system of certifying and counting the electoral votes for president and vice president,” Sen. Collins said in committee testimony. “The idea that any vice president would have the power to unilaterally accept, reject, change, or halt the counting of electoral votes is antithetical to our constitutional structure and basic democratic principles.”“Nothing is more essential to the survival of a democracy than the orderly transfer of power,” Sen. Collins continued. “And there is nothing more essential to the orderly transfer of power than clear rules for effecting it.”What opponents sayThere are very few public objectors to this legislation. “There has been notably little public opposition to the heart of the bill,” University of Iowa law professor Derek T. Muller wrote in congressional testimony, “and the bulk of that rare concern rests largely on misunderstandings of the text or technical problems that can be readily corrected.”Norm Eisen — formerly Ambassador to the Czech Republic and now senior fellow in governance studies at Brookings — supports the legislation overall, but noted at least three further changes he still found necessary.The bill “allows the extension of Election Day due to ‘extraordinary and catastrophic events,’” Eisen wrote in his own congressional testimony. “The phrase ‘extraordinary and catastrophic events’ should be better defined to avoid manipulation by the election-denying officials now running to take control of the electoral process.”“Adjustments must be made to the scant six-day window for federal litigation under the [bill],” Eisen continued. “There must be adequate time for any federal litigation should governors or others wrongly certify or refuse to certify electors or otherwise abuse the process. Six days is insufficient.”“To strengthen safeguards when the process moves to Congress, [the bill] should consider clarifying the grounds for objection by replacing undefined and malleable terms preserved from the current [law] such as ‘lawfully certified’ and ‘regularly given,’” Eisen concluded, “terms which have been a proven source of abuse in the past.”Odds of passageIn addition to its Republican lead sponsor, the bill has attracted 17 bipartisan cosponsors: nine Republicans and eight Democrats. It awaits a potential vote in the Senate Rules and Administration Committee, which held a hearing on the bill in August.  Last updated Sep 16, 2022.View all GovTrack summaries.The summary below was written by the Congressional Research Service, which is a nonpartisan division of the Library of Congress, and was published on Oct 25, 2022.Electoral Count Reform and Presidential Transition Improvement Act of 2022This bill revises the process of casting and counting electoral votes for presidential elections. The bill also revises provisions related to the presidential transition process.The bill specifies that the choice of electors must occur in accordance with the laws of the state enacted prior to election day.Additionally, the bill identifies each state's governor (unless otherwise identified in the laws or constitution of a state in effect on election day) as responsible for submitting the certificate of ascertainment identifying the state's electors. Further, the bill provides for expedited judicial review for any action brought by an aggrieved presidential or vice-presidential candidate arising under the U.S. Constitution or U.S. laws with respect to the issuance or transmission of such a certificate.The bill revises the framework for the joint session of Congress to count electoral votes and make a formal declaration of which candidates have been elected President and Vice President. Among other changes, the bill (1) specifies that the role of the Vice President during the joint session shall be ministerial in nature, and (2) raises the objection threshold in Congress to at least one-fifth of the duly chosen and sworn members of both the House of Representatives and the Senate.The bill also revises the presidential transition process, including to (1) allow more than one candidate to receive federal transition resources under certain circumstances, and (2) require additional reporting by the General Services Administration."
        },
        {
            "Bill Number": "S. 1568 (117th)",
            "First Name": "Shelley  Capito",
            "Last Name": "cosponsor",
            "Role": "S. 1568 (117th)",
            "Bill Name": "TRAIN Act",
            "Subject Areas": "Health, Allied health services, Education programs funding, Health programs administration and funding, Hospital care, Medical education, Medicare, Nursing",
            "Summary": "This bill modifies the methodology and application of Medicare Advantage nursing and allied health education payments for hospitals. Specifically, for 2010-2019, the bill eliminates the annual cap on total payments and excludes any resulting increase from factoring into calculations for graduate medical education payments for such hospitals. (The Centers for Medicare & Medicaid Services recently issued guidance providing for the recalculation and correction of certain payments to account for the annual payment cap.)"
        }
    ],
    "SponsoredBills": [
        {
            "Bill Number": "S. 539 (117th)",
            "First Name": "Shelley  Capito",
            "Last Name": "sponsor",
            "Role": "S. 539 (117th)",
            "Bill Name": "A bill to direct the Secretary of Veterans Affairs to submit to Congress a report on the use of video cameras for patient safety and law enforcement at medical centers of the Department of Veterans Affairs.",
            "Subject Areas": "Armed Forces and National Security, Congressional oversight, Department of Veterans Affairs, Government buildings, facilities, and property, Government employee pay, benefits, personnel management, Health facilities and institutions, Health personnel, Health technology, devices, supplies, Photography and imaging, Right of privacy, Veterans' medical care",
            "Summary": "This bill requires the Department of Veterans Affairs (VA) to report on its policies and procedures relating to the usage and maintenance of video cameras for patient safety and law enforcement at VA medical centers."
        }
    ]
}