{
    "Name": "Cathy McMorris Rodgers",
    "Profile": {
        "Public Office": {
            "Chair of the House Energy and Commerce Committee": {
                "Incumbent": "Incumbent",
                "Assumed office": "January 3, 2023",
                "Preceded by": "Frank Pallone"
            },
            "Ranking Member of the House Energy and Commerce Committee": {
                "In office": "January 3, 2021 – January 3, 2023",
                "Preceded by": "Greg Walden",
                "Succeeded by": "Frank Pallone"
            },
            "Chair of the House Republican Conference": {
                "In office": "January 3, 2013 – January 3, 2019",
                "Deputy": "Lynn Jenkins,Doug Collins",
                "Leader": "John Boehner,Paul Ryan",
                "Preceded by": "Jeb Hensarling",
                "Succeeded by": "Liz Cheney"
            },
            "Vice Chair of the House Republican Conference": {
                "In office": "January 3, 2009 – January 3, 2013",
                "Leader": "John Boehner",
                "Preceded by": "Kay Granger",
                "Succeeded by": "Lynn Jenkins"
            },
            "Member of the U.S. House of Representativesfrom Washington's 5th district": {
                "Incumbent": "Incumbent",
                "Assumed office": "January 3, 2005",
                "Preceded by": "George Nethercutt",
                "District Info": {
                    "Median householdincome": "",
                    "Distribution": "",
                    "Population": "",
                    "Ethnicity": ""
                }
            },
            "Minority Leader of the Washington House of Representatives": {
                "In office": "January 13, 2003 – January 10, 2004",
                "Preceded by": "Clyde Ballard",
                "Succeeded by": "Richard DeBolt"
            },
            "Member of the Washington House of Representativesfrom the 7th district": {
                "In office": "January 7, 1994 – January 3, 2005",
                "Preceded by": "Bob Morton",
                "Succeeded by": "Joel Kretz"
            }
        },
        "Personal Details": {
            "Personal details": {
                "Born": "Cathy Anne McMorris, (,1969-05-22,) ,May 22, 1969, (age 53),Salem, Oregon,, U.S.",
                "Political party": "Republican",
                "Spouse": "Brian Rodgers, ,,(,m., ,.mw-parser-output .tooltip-dotted{border-bottom:1px dotted;cursor:help},2006,),",
                "Children": "3",
                "Education": "Pensacola Christian College, (,BA,),University of Washington, (,MBA,)",
                "Website": "House website"
            }
        }
    },
    "UnusedVotingRecords": [],
    "CosponsoredBills": [
        {
            "Bill Number": "H.R. 4702 (117th)",
            "First Name": "Cathy  McMorris Rodgers",
            "Last Name": "cosponsor",
            "Role": "H.R. 4702 (117th)",
            "Bill Name": "Military Spouse Tax Act",
            "Subject Areas": "Armed Forces and National Security, Housing finance and home ownership, Military personnel and dependents, Tax treatment of families",
            "Summary": "This bill provides that a spouse of a service member may retain their personal residence or domicile for purposes of taxation.The bill authorizes a service member and the spouse of the member to elect to use the following locations for purposes of taxation: the residence or domicile of the member, the residence or domicile of the spouse, or the permanent duty station of the member."
        },
        {
            "Bill Number": "H.R. 2915 (117th)",
            "First Name": "Cathy  McMorris Rodgers",
            "Last Name": "cosponsor",
            "Role": "H.R. 2915 (117th)",
            "Bill Name": "HOPR Act",
            "Subject Areas": "Government employee pay, benefits, personnel management, Government studies and investigations, Public contracts and procurement, Small business, War and emergency powers",
            "Summary": "This bill directs the Department of Homeland Security (DHS) to ensure that procurement of certain items, such as body armor and other protective gear, meets specified requirements, including that a fraction of procurement funds be used for items manufactured by U.S. small businesses.The bill sets forth requirements for waivers based on a national emergency.DHS shall (1) ensure that covered items are purchased at a fair and reasonable price, and (2) study the adequacy of uniform allowances provided to employees of frontline operational components (i.e., Customs and Border Protection and other listed agencies and entities).DHS must report to Congress with recommendations on how it could procure additional items from domestic sources and bolster the domestic supply chain for specified national security-related items, including personal protective equipment and other items necessary to respond to a pandemic such as that caused by COVID-19."
        },
        {
            "Bill Number": "H.R. 6332 (117th)",
            "First Name": "Cathy  McMorris Rodgers",
            "Last Name": "cosponsor",
            "Role": "H.R. 6332 (117th)",
            "Bill Name": "Planning for Aging Veterans Act of 2021",
            "Subject Areas": "Armed Forces and National Security",
            "Summary": "This bill addresses the long-term care of veterans, including by implementing policies for the administration of state homes.First, the bill requires the Department of Veterans Affairs (VA) to develop a strategy for the long-term care of veterans.The VA must develop a standardized process for entering into sharing agreements between state homes and VA medical centers. A state home is a home established by a state for veterans who are disabled by age, disease, or otherwise and incapable of earning a living because of such disability. The term also includes a home that furnishes nursing home care for veterans.Under the bill, the VA must furnish prescribed drugs and medicines to veterans who are catastrophically disabled and for whom the VA is paying a per diem for nursing home or domiciliary care in a state home. Generally, veterans are catastrophically disabled if they have a permanent severely disabling injury, disorder, or disease that compromises the ability to carry out the activities of daily living.The VA must monitor any contractor it uses to conduct inspections of state homes, including by reviewing inspections, reporting deficiencies, and publishing inspection results and any planned corrective actions on a public VA website.The VA must implement a two-year pilot program to provide geriatric psychiatry assistance to eligible veterans at state homes.Finally, the VA must work with public housing authorities and local organizations to assist aging homeless veterans in accessing existing housing and supportive services."
        },
        {
            "Bill Number": "H.R. 7667 (117th)",
            "First Name": "Cathy  McMorris Rodgers",
            "Last Name": "cosponsor",
            "Role": "H.R. 7667 (117th)",
            "Bill Name": "Food and Drug Amendments of 2022",
            "Subject Areas": "Health, Advanced technology and technological innovations, Advisory bodies, Animal protection and human-animal relationships, Blood and blood diseases, Business records, Cardiovascular and respiratory health, Child health, Computer security and identity theft, Congressional oversight, Criminal investigation, prosecution, interrogation, Department of Health and Human Services, Drug safety, medical device, and laboratory regulation, Emergency medical services and trauma care, Employee hiring, Evidence and witnesses, Executive agency funding and structure, Food and Drug Administration (FDA), Genetics, Government employee pay, benefits, personnel management, Government information and archives, Government studies and investigations, Health care coverage and access, Health programs administration and funding, Health technology, devices, supplies, Industrial facilities, Infectious and parasitic diseases, Inflation and prices, Licensing and registrations, Manufacturing, Marketing and advertising, Medical research, Minority health, Musculoskeletal and skin diseases, Organ and tissue donation and transplantation, Performance measurement, Photography and imaging, Prescription drugs, Product development and innovation, Public participation and lobbying, Public-private cooperation, Radiation, Research and development, Small business, User charges and fees",
            "Summary": "This bill reauthorizes Food and Drug Administration (FDA) user fee programs for certain drugs and devices, establishes requirements to increase diversity in clinical trials, and modifies requirements relating to the overall supply chain for drugs and devices.Specifically, the bill reauthorizes through FY2027 the FDA user fee programs for prescription drugs, medical devices, generic drugs, and biosimilars.The bill also requires the development of action plans and related reporting to increase the diversity of participants in clinical trials.In addition, the bill requires the FDA to inform generic drug applicants, upon request or during review, whether the drug is qualitatively and quantitatively the same as the listed brand-name drug (and if not, the reasons why).The bill also (1) establishes requirements and reauthorizes programs to support the development of specific categories of drugs and devices (e.g., pediatric drugs) and inspections of drug manufacturing facilities; and (2) establishes and revises requirements relating to the approval of drugs and devices, including requirements for postapproval studies and guidance about using real-world evidence to support drug and device applications."
        },
        {
            "Bill Number": "H.R. 1012 (117th)",
            "First Name": "Cathy  McMorris Rodgers",
            "Last Name": "cosponsor",
            "Role": "H.R. 1012 (117th)",
            "Bill Name": "\\u2018Six Triple Eight\\u2019 Congressional Gold Medal Act of 2021",
            "Subject Areas": "Military history, Military personnel and dependents, Minority employment, Museums, exhibitions, cultural centers, Postal service, Smithsonian Institution, Women's employment",
            "Summary": "This bill directs the Speaker of the House of Representatives and the President pro tempore of the Senate to arrange for the award of a Congressional Gold Medal in honor of the women of the 6888th Central Postal Directory Battalion (commonly known as the Six Triple Eight) in recognition of their pioneering military service, devotion to duty, and contributions to increase the morale of personnel stationed in the European theater of operations during World War II. The medal shall be given to the Smithsonian Institution and made available for display and research."
        },
        {
            "Bill Number": "H.R. 1652 (117th)",
            "First Name": "Cathy  McMorris Rodgers",
            "Last Name": "cosponsor",
            "Role": "H.R. 1652 (117th)",
            "Bill Name": "VOCA Fix to Sustain the Crime Victims Fund Act of 2021",
            "Subject Areas": "Crime and Law Enforcement, Civil actions and liability, Crime victims, Criminal investigation, prosecution, interrogation, Emergency medical services and trauma care, Government trust funds, Infectious and parasitic diseases, Law enforcement administration and funding, State and local government operations",
            "Summary": "This bill adds a new source of revenue for the Crime Victims Fund and makes changes to formula grants supported by the fund.Specifically, the bill directs revenues collected from deferred prosecution and non-prosecution agreements to be deposited into the Crime Victims Fund. Currently, such revenues are deposited into the general fund of the Treasury.Additionally, the bill increases the percentage—from 60% to 75%—of state compensation payments to crime victims in the prior fiscal year used to calculate formula grants for state victim compensation programs.Finally, the bill directs states to waive the matching requirement for recipients of state victim assistance formula grants during and for one year after a pandemic-related national emergency. It also allows states to waive the matching requirement pursuant to a policy established by the state."
        },
        {
            "Bill Number": "H.R. 1799 (117th)",
            "First Name": "Cathy  McMorris Rodgers",
            "Last Name": "cosponsor",
            "Role": "H.R. 1799 (117th)",
            "Bill Name": "PPP Extension Act of 2021",
            "Subject Areas": "Commerce, Business expenses, Cardiovascular and respiratory health, Emergency medical services and trauma care, Government lending and loan guarantees, Infectious and parasitic diseases, Small business, Wages and earnings",
            "Summary": "This bill extends the Paycheck Protection Program, established to support small businesses in response to COVID-19 (i.e., coronavirus disease 2019), through June 30, 2021. Currently, the program is set to expire on March 31, 2021.For the final 30 days of the program (i.e., from June 1 until June 30), the Small Business Administration may only process applications submitted prior to June 1, and it may not accept any new loan applications.The bill excludes the budgetary effects of this bill from PAYGO scorecards under the Statutory Pay-As-You-Go Act of 2010 and from Senate PAYGO scorecards."
        },
        {
            "Bill Number": "H.R. 2099 (117th)",
            "First Name": "Cathy  McMorris Rodgers",
            "Last Name": "cosponsor",
            "Role": "H.R. 2099 (117th)",
            "Bill Name": "Secure Rural Schools Reauthorization Act of 2021",
            "Subject Areas": "Public Lands and Natural Resources, Advisory bodies, Arizona, Congressional oversight, Education programs funding, Educational technology and distance education, Elementary and secondary education, Fires, First responders and emergency personnel, Forests, forestry, trees, Internet and video services, Land use and conservation, Montana, Property tax, Public contracts and procurement, Rural conditions and development, State and local finance, State and local taxation",
            "Summary": "This bill extends through FY2023 payments made to states and eligible counties containing certain federal land under the Secure Rural Schools and Community Self-Determination Act of 2000.The Department of the Interior and the Department of Agriculture shall carry out a pilot program to allow the Chief of the Forest Service or the Director of the Bureau of Land Management to nominate members of resource advisory committees.County funds may be used to provide or expand access to (1) broadband telecommunications services at local schools, or (2) the technology and connectivity necessary for students to use a digital learning tool at or outside of a local school campus.Any county funds that were obligated by a county before October 1, 2017, but are unspent on October 1, 2020, may be used by the county for any authorized use and shall be available for projects initiated after October 1, 2020.No county funds may be used for lobbying activity, regardless of the purpose for which the funds are obligated on or before the enactment of this bill."
        },
        {
            "Bill Number": "H.R. 2252 (117th)",
            "First Name": "Cathy  McMorris Rodgers",
            "Last Name": "cosponsor",
            "Role": "H.R. 2252 (117th)",
            "Bill Name": "Emmett Till and Mamie Till-Mobley Congressional Gold Medal Act of 2021",
            "Subject Areas": "Racial and ethnic relations, Smithsonian Institution, U.S. history",
            "Summary": "This bill provides for the posthumous presentation of a Congressional Gold Medal in commemoration of Emmett Till and Mamie Till-Mobley.After the award the medal shall be given to the National Museum of African American History and Culture."
        },
        {
            "Bill Number": "H.R. 1145 (117th)",
            "First Name": "Cathy  McMorris Rodgers",
            "Last Name": "cosponsor",
            "Role": "H.R. 1145 (117th)",
            "Bill Name": "To direct the Secretary of State to develop a strategy to regain observer status for Taiwan in the World Health Organization, and for other purposes.",
            "Subject Areas": "International Affairs, Asia, Congressional oversight, International organizations and cooperation, Taiwan, World health",
            "Summary": "This bill directs the Department of State to include additional information in its annual reports concerning Taiwan's participation at the World Health Organization's World Health Assembly (WHA) as an observer. The report shall describe changes and improvements to the State Department's plan to support Taiwan's observer status at the WHA, following any meetings at which Taiwan did not participate under such status. (China has opposed Taiwan's participation in the WHA.)"
        },
        {
            "Bill Number": "H.R. 707 (117th)",
            "First Name": "Cathy  McMorris Rodgers",
            "Last Name": "cosponsor",
            "Role": "H.R. 707 (117th)",
            "Bill Name": "Ghost Army Congressional Gold Medal Act",
            "Subject Areas": "Military operations and strategy, Military personnel and dependents, Museums, exhibitions, cultural centers, Smithsonian Institution",
            "Summary": "This bill directs the Speaker of the House of Representatives and the President pro tempore of the Senate to award a Congressional Gold Medal to the 23rd Headquarters Special Troops and the 3133rd Signal Service Company, known as the Ghost Army, collectively, in recognition of its service during World War II."
        },
        {
            "Bill Number": "H.R. 3577 (117th)",
            "First Name": "Cathy  McMorris Rodgers",
            "Last Name": "cosponsor",
            "Role": "H.R. 3577 (117th)",
            "Bill Name": "United States Army Rangers Veterans of World War II Congressional Gold Medal Act",
            "Subject Areas": "Armed Forces and National Security, Conflicts and wars, Congressional tributes, Military history, Museums, exhibitions, cultural centers, Smithsonian Institution, Veterans' organizations and recognition",
            "Summary": "This bill provides for the award of a single Congressional Gold Medal to the U.S. Army Rangers Veterans of World War II in recognition of their dedicated service during World War II."
        },
        {
            "Bill Number": "H.R. 3642 (117th)",
            "First Name": "Cathy  McMorris Rodgers",
            "Last Name": "cosponsor",
            "Role": "H.R. 3642 (117th)",
            "Bill Name": "Harlem Hellfighters Congressional Gold Medal Act",
            "Subject Areas": "Armed Forces and National Security, Conflicts and wars, Congressional tributes, Military history, Military personnel and dependents, Museums, exhibitions, cultural centers, New York State, Racial and ethnic relations, Smithsonian Institution, Veterans' organizations and recognition",
            "Summary": "This bill provides for the award of a Congressional Gold Medal to the 369th Infantry Regiment, commonly known as the Harlem Hellfighters, in recognition of their bravery and outstanding service during World War I."
        },
        {
            "Bill Number": "H.R. 4961 (117th)",
            "First Name": "Cathy  McMorris Rodgers",
            "Last Name": "cosponsor",
            "Role": "H.R. 4961 (117th)",
            "Bill Name": "Rural Veterans Travel Enhancement Act of 2021",
            "Subject Areas": "Government studies and investigations, Health care coverage and access, Health facilities and institutions, Intergovernmental relations, Mental health, Rural conditions and development, State and local finance, State and local government operations, Transportation costs, Veterans' medical care, Veterans' pensions and compensation",
            "Summary": "This bill addresses Department of Veterans Affairs (VA) transportation benefits for certain veterans.First, the bill makes permanent the authority for the VA to transport any person to or from a VA facility or other place in connection with vocational rehabilitation, required counseling, or for an examination, treatment, or care.The bill also permanently extends the authorization of appropriations for grants provided to state veterans service agencies and veterans service organizations to transport highly rural veterans for medical care.The bill requires the Government Accountability Office (GAO) to study fraud, waste, and abuse of benefits under the VA beneficiary travel program and report the findings to Congress. The GAO must also study and report on (1) the efficacy of the current mileage reimbursement rate under the program in mitigating the financial burden of transportation costs for traveling to and from VA medical facilities for care, (2) the origins of the amount of the deductible and its impact on the efficacy of the benefits provided in mitigating the financial burden on veterans seeking medical care, and (3) recommendations for how this program or another program could further encourage veterans to seek medical care.The bill also requires the VA to implement various pilot programs related to transportation benefits for veterans for specified purposes."
        },
        {
            "Bill Number": "H.R. 1448 (117th)",
            "First Name": "Cathy  McMorris Rodgers",
            "Last Name": "cosponsor",
            "Role": "H.R. 1448 (117th)",
            "Bill Name": "PAWS for Veterans Therapy Act",
            "Subject Areas": "Armed Forces and National Security, Animal protection and human-animal relationships, Congressional oversight, Disability assistance, Government information and archives, Government studies and investigations, Health programs administration and funding, Mammals, Mental health, Neurological disorders, Service animals, Veterans' education, employment, rehabilitation, Veterans' medical care",
            "Summary": "This bill implements a program and a policy related to service dog therapy for veterans. Specifically, the bill requires the Department of Veterans Affairs (VA) to implement a five-year pilot program to provide canine training to eligible veterans diagnosed with post-traumatic stress disorder as an element of a complementary and integrative health program. Eligible veterans are those who are enrolled in the VA health care system and have been recommended for participation by a qualified mental health care provider or clinical team.The VA must seek to enter agreements containing specified elements with accredited nongovernmental entities that have demonstrated ability to provide canine training.Veterans who participate in the program are authorized to adopt the dog they assisted in training if their health provider determines it is in the best interest of the veteran.The VA must establish processes to document and track the progress of participating veterans with respect to health benefits and improvements. The Government Accountability Office must brief Congress and submit a report on the program.The bill also authorizes the VA to provide service dogs to veterans with mental illnesses, regardless of whether they have a mobility impairment."
        },
        {
            "Bill Number": "H.R. 5142 (117th)",
            "First Name": "Cathy  McMorris Rodgers",
            "Last Name": "cosponsor",
            "Role": "H.R. 5142 (117th)",
            "Bill Name": "To award posthumously a Congressional Gold Medal, in commemoration to the servicemembers who perished in Afghanistan on August 26, 2021, during the evacuation of citizens of the United States and Afghan allies at Hamid Karzai Internati",
            "Subject Areas": "Armed Forces and National Security, International Affairs, Afghanistan, Asia, Conflicts and wars, Congressional tributes, Emergency planning and evacuation, Military operations and strategy, Military personnel and dependents, Museums, exhibitions, cultural centers, Smithsonian Institution, Terrorism",
            "Summary": "This bill posthumously provides for the award of a Congressional Gold Medal in commemoration of the 13 service members who died on August 26, 2021, while stationed at Hamid Karzai International Airport in Afghanistan."
        },
        {
            "Bill Number": "H.R. 6015 (117th)",
            "First Name": "Cathy  McMorris Rodgers",
            "Last Name": "cosponsor",
            "Role": "H.R. 6015 (117th)",
            "Bill Name": "Benjamin Berell Ferencz Congressional Gold Medal Act",
            "Subject Areas": "International Affairs, Congressional tributes, Criminal investigation, prosecution, interrogation, Europe, Germany, International law and treaties, Lawyers and legal services, Museums, exhibitions, cultural centers, War crimes, genocide, crimes against humanity",
            "Summary": "This bill provides for the award of a Congressional Gold Medal to Benjamin Berell Ferencz in recognition of his service to the United States and the international community during the post-World War II Nuremberg trials and his lifelong advocacy for international criminal justice and the rule of law."
        },
        {
            "Bill Number": "H.R. 1057 (117th)",
            "First Name": "Cathy  McMorris Rodgers",
            "Last Name": "cosponsor",
            "Role": "H.R. 1057 (117th)",
            "Bill Name": "Greatest Generation Commemorative Coin Act",
            "Subject Areas": "Finance and Financial Sector, Conflicts and wars, Currency, Military history, Monuments and memorials, U.S. history, Veterans' organizations and recognition",
            "Summary": "This bill directs the Department of the Treasury to mint and issue up to 50,000 $5 coins, 400,000 $1 silver coins, and 750,000 half-dollar clad coins in commemoration of the National World War II Memorial in the District of Columbia.The design of the coins shall be emblematic of the memorial and the service and sacrifice of American soldiers and civilians during World War II.All surcharges received from the sale of such coins shall be paid to the Friends of the National World War II Memorial to support the National Park Service in maintaining and repairing the memorial, and for educational and commemorative programs."
        },
        {
            "Bill Number": "H.R. 4591 (117th)",
            "First Name": "Cathy  McMorris Rodgers",
            "Last Name": "cosponsor",
            "Role": "H.R. 4591 (117th)",
            "Bill Name": "VA Electronic Health Record Transparency Act of 2021",
            "Subject Areas": "Armed Forces and National Security, Appropriations, Congressional oversight, Department of Veterans Affairs, Executive agency funding and structure, Government employee pay, benefits, personnel management, Health care costs and insurance, Health care quality, Health facilities and institutions, Health information and medical records, Health programs administration and funding, Performance measurement, Veterans' medical care",
            "Summary": "This bill requires the Department of Veterans Affairs to report quarterly on (1) the costs of its Electronic Health Record Modernization Program, including by describing all expenses driven by the program; and (2) the performance metrics and outcomes of the program."
        },
        {
            "Bill Number": "H.R. 5577 (117th)",
            "First Name": "Cathy  McMorris Rodgers",
            "Last Name": "cosponsor",
            "Role": "H.R. 5577 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 3900 Crown Road Southwest in Atlanta, Georgia, as the \\u201cJohn R. Lewis Post Office Building\\u201d.",
            "Subject Areas": "Government Operations and Politics, Congressional tributes, Georgia, Government buildings, facilities, and property, Postal service",
            "Summary": "This bill designates the facility of the United States Postal Service located at 3900 Crown Road Southwest in Atlanta, Georgia, as the John R. Lewis Post Office Building."
        },
        {
            "Bill Number": "H.R. 8876 (117th)",
            "First Name": "Cathy  McMorris Rodgers",
            "Last Name": "cosponsor",
            "Role": "H.R. 8876 (117th)",
            "Bill Name": "Jackie Walorski Maternal and Child Home Visiting Reauthorization Act of 2022",
            "Subject Areas": "Health, Appropriations, Census and government statistics, Child care and development, Child health, Child safety and welfare, Computers and information technology, Congressional oversight, Family planning and birth control, Family services, Government information and archives, Government studies and investigations, Health promotion and preventive care, Health technology, devices, supplies, Home and outpatient care, Intergovernmental relations, Performance measurement, Social work, volunteer service, charitable organizations, State and local finance, State and local government operations, Women's health",
            "Summary": "This bill reauthorizes through FY2027, increases funding for, and modifies the Maternal, Infant, and Early Childhood Home Visiting Program. This program supports home visits for expectant and new parents who live in communities that are at-risk for poor maternal and child health outcomes.Changes to the program include setting out requirements for allocating program funds; increasing the percentage of funds reserved for tribal entities; establishing a publicly available dashboard that reports program outcomes; requiring activities to reduce unnecessary data collection, reporting, and other administrative requirements of the program; and allowing for virtual home visits (provided certain conditions are met)."
        },
        {
            "Bill Number": "H.R. 6964 (117th)",
            "First Name": "Cathy  McMorris Rodgers",
            "Last Name": "cosponsor",
            "Role": "H.R. 6964 (117th)",
            "Bill Name": "To authorize leases of up to 99 years for lands held in trust for the Confederated Tribes of the Chehalis Reservation.",
            "Subject Areas": "Native Americans, Indian lands and resources rights, Land transfers, Washington State",
            "Summary": "This bill authorizes the Confederated Tribes of the Chehalis Reservation to lease their land held in trust for a term of up to 99 years. The tribe is located in western Washington State."
        },
        {
            "Bill Number": "H.R. 310 (117th)",
            "First Name": "Cathy  McMorris Rodgers",
            "Last Name": "cosponsor",
            "Role": "H.R. 310 (117th)",
            "Bill Name": "To posthumously award the Congressional Gold Medal, collectively, to Glen Doherty, Tyrone Woods, J. Christopher Stevens, and Sean Smith, in recognition of their contributions to the Nation.",
            "Subject Areas": "Intelligence activities, surveillance, classified information, Law enforcement officers, Libya, Middle East, Terrorism, Veterans' organizations and recognition",
            "Summary": NaN
        },
        {
            "Bill Number": "H.R. 1096",
            "First Name": "Cathy  McMorris Rodgers",
            "Last Name": "cosponsor",
            "Role": "H.R. 1096",
            "Bill Name": "250th Anniversary of the United States Marine Corps Commemorative Coin Act",
            "Subject Areas": "Military personnel and dependents",
            "Summary": "This bill directs the Department of the Treasury to mint and issue not more than 50,000 $5 gold coins, 400,000 $1 silver coins, and 750,000 half-dollar clad coins emblematic of the 250th anniversary of the United States Marine Corps.All surcharges received by Treasury from the sale of such coins must be paid to the Marine Corps Heritage Foundation and shall only be used for the purposes of supporting the mission of the Marine Corps Heritage Center."
        }
    ],
    "SponsoredBills": [
        {
            "Bill Number": "H.R. 6435 (117th)",
            "First Name": "Cathy  McMorris Rodgers",
            "Last Name": "sponsor",
            "Role": "H.R. 6435 (117th)",
            "Bill Name": "To provide for the application of certain provisions of the Secure Rural Schools and Community Self-Determination Act of 2000 for fiscal year 2021.",
            "Subject Areas": "Public Lands and Natural Resources, Forests, forestry, trees, State and local finance, State and local taxation",
            "Summary": "This bill extends through FY2021 the inapplicability of the requirement for counties to elect to receive certain payments under the Secure Rural Schools and Community Self-Determination Act of 2000. That act provides compensation to counties for the presence of untaxable federal land within their borders."
        },
        {
            "Bill Number": "H.R. 2973",
            "First Name": "Cathy  McMorris Rodgers",
            "Last Name": "sponsor",
            "Role": "H.R. 2973",
            "Bill Name": "MARITIME Act of 2023",
            "Subject Areas": "International Affairs, Alliances, Arab-Israeli relations, Collective security, Congressional oversight, Crime prevention, Diplomacy, foreign officials, Americans abroad, Intelligence activities, surveillance, classified information, Iran, Israel, Middle East, Military assistance, sales, and agreements, Military operations and strategy, Navigation, waterways, harbors, Performance measurement, Terrorism",
            "Summary": "This bill requires the Department of Defense (DOD) to seek to develop an integrated maritime domain awareness and interdiction capability for the Middle East to protect against specified maritime threats in the region.DOD must also submit to Congress (1) a strategy for achieving this capability in cooperation with regional partners and allies; and (2) a study on the feasibility and advisability of establishing a fund to support this effort, including an assessment of contributions that could be made by allies and partner countries."
        }
    ]
}