{
    "Name": "Stacey Plaskett",
    "Profile": {
        "Public Office": {
            "Delegate to theU.S. House of Representativesfrom the U.S. Virgin Islands' at-large district": {
                "Incumbent": "Incumbent",
                "Assumed office": "January 3, 2015",
                "Preceded by": "Donna Christian-Christensen"
            }
        }
    },
    "UnusedVotingRecords": [],
    "CosponsoredBills": [
        {
            "Bill Number": "H.R. 2249 (117th)",
            "First Name": "Stacey  Plaskett",
            "Last Name": "cosponsor",
            "Role": "H.R. 2249 (117th)",
            "Bill Name": "Willie O\\u2019Ree Congressional Gold Medal Act",
            "Subject Areas": "Racial and ethnic relations",
            "Summary": "This bill provides for the award of a Congressional Gold Medal to Willie O'Ree or, if unavailable, to a member of his family, in recognition of his contributions and commitment to hockey, inclusion, and recreational opportunity."
        },
        {
            "Bill Number": "H.R. 539 (117th)",
            "First Name": "Stacey  Plaskett",
            "Last Name": "cosponsor",
            "Role": "H.R. 539 (117th)",
            "Bill Name": "Preventing Disaster Revictimization Act",
            "Subject Areas": "Residential rehabilitation and home repair",
            "Summary": "This bill requires the Federal Emergency Management Agency (FEMA) to waive certain debts owed to the United States related to disaster assistance provided to an individual or household.Specifically, FEMA must waive a debt owed to the United States related to disaster assistance provided to an individual or household if such assistance (1) was distributed based on an error by FEMA and such debt is construed as a hardship, and (2) is subject to a claim or legal action.FEMA must report to Congress on (1) actions that it will take to reduce the assistance payment error rate, and (2) the internal processes used to make decisions regarding the distribution of federal disaster assistance to individuals and households and any changes made to such processes."
        },
        {
            "Bill Number": "H.R. 2954 (117th)",
            "First Name": "Stacey  Plaskett",
            "Last Name": "cosponsor",
            "Role": "H.R. 2954 (117th)",
            "Bill Name": "Securing a Strong Retirement Act of 2021",
            "Subject Areas": "Labor and Employment, Administrative law and regulatory procedures, Bank accounts, deposits, capital, Banking and financial institutions regulation, Business records, Congressional oversight, Criminal procedure and sentencing, Department of Labor, Department of the Treasury, Disability and paralysis, Disability assistance, Drug trafficking and controlled substances, Employee benefits and pensions, Employment taxes, Financial services and investments, First responders and emergency personnel, Higher education, Income tax deferral, Income tax exclusion, Inflation and prices, Interest, dividends, interest rates, Life, casualty, property insurance, Military personnel and dependents, Sales and excise taxes, Securities, Small business, Student aid and college costs, Tax administration and collection, taxpayers, Wages and earnings",
            "Summary": "This bill makes various changes with respect to employer-sponsored retirement plans, including providing for the automatic enrollment of employees in certain plans and increasing the age at which participants are required to begin receiving mandatory distributions."
        },
        {
            "Bill Number": "H.R. 3525 (117th)",
            "First Name": "Stacey  Plaskett",
            "Last Name": "cosponsor",
            "Role": "H.R. 3525 (117th)",
            "Bill Name": "Commission To Study the Potential Creation of a National Museum of Asian Pacific American History and Culture Act",
            "Subject Areas": NaN,
            "Summary": "This bill establishes a Commission to Study the Potential Creation of a National Museum of Asian Pacific American History and Culture.The commission must (1) report recommendations for a plan of action for the establishment and maintenance of a National Museum of Asian Pacific American History and Culture in Washington, DC; (2) develop a fundraising plan to support the establishment, operation, and maintenance of the museum through public contributions; (3) obtain an independent review of this fundraising plan, including an analysis of the resources necessary to fund the construction of the museum and its operations and maintenance in perpetuity without reliance on federal funds; and (4) submit a legislative plan of action to establish and construct the museum.The commission may convene a national conference relating to the museum.The commission shall be solely responsible for acceptance of contributions to it and payment of its expenses.No federal funding may be obligated to carry out this bill."
        },
        {
            "Bill Number": "H.R. 1012 (117th)",
            "First Name": "Stacey  Plaskett",
            "Last Name": "cosponsor",
            "Role": "H.R. 1012 (117th)",
            "Bill Name": "\\u2018Six Triple Eight\\u2019 Congressional Gold Medal Act of 2021",
            "Subject Areas": "Military history, Military personnel and dependents, Minority employment, Museums, exhibitions, cultural centers, Postal service, Smithsonian Institution, Women's employment",
            "Summary": "This bill directs the Speaker of the House of Representatives and the President pro tempore of the Senate to arrange for the award of a Congressional Gold Medal in honor of the women of the 6888th Central Postal Directory Battalion (commonly known as the Six Triple Eight) in recognition of their pioneering military service, devotion to duty, and contributions to increase the morale of personnel stationed in the European theater of operations during World War II. The medal shall be given to the Smithsonian Institution and made available for display and research."
        },
        {
            "Bill Number": "H.R. 1799 (117th)",
            "First Name": "Stacey  Plaskett",
            "Last Name": "cosponsor",
            "Role": "H.R. 1799 (117th)",
            "Bill Name": "PPP Extension Act of 2021",
            "Subject Areas": "Commerce, Business expenses, Cardiovascular and respiratory health, Emergency medical services and trauma care, Government lending and loan guarantees, Infectious and parasitic diseases, Small business, Wages and earnings",
            "Summary": "This bill extends the Paycheck Protection Program, established to support small businesses in response to COVID-19 (i.e., coronavirus disease 2019), through June 30, 2021. Currently, the program is set to expire on March 31, 2021.For the final 30 days of the program (i.e., from June 1 until June 30), the Small Business Administration may only process applications submitted prior to June 1, and it may not accept any new loan applications.The bill excludes the budgetary effects of this bill from PAYGO scorecards under the Statutory Pay-As-You-Go Act of 2010 and from Senate PAYGO scorecards."
        },
        {
            "Bill Number": "H.R. 1085 (117th)",
            "First Name": "Stacey  Plaskett",
            "Last Name": "cosponsor",
            "Role": "H.R. 1085 (117th)",
            "Bill Name": "To award three congressional gold medals to the United States Capitol Police and those who protected the U.S. Capitol on January 6, 2021.",
            "Subject Areas": "Assault and harassment offenses, Congress, Congressional tributes, Crimes against property, District of Columbia, Government buildings, facilities, and property, Law enforcement officers, Museums, exhibitions, cultural centers, Protest and dissent, Smithsonian Institution, Subversive activities, Terrorism, U.S. Capitol, Violent crime",
            "Summary": "This bill directs the Speaker of the House and the President pro tempore of the Senate to arrange for the award of three Congressional Gold Medals to the U.S. Capitol Police (USCP) and other law enforcement agencies that protected the U.S. Capitol on January 6, 2021.Following the award of these medals, one medal shall be given to the USCP, one medal shall be given to the Metropolitan Police Department of the District of Columbia, and one medal shall be given to the Smithsonian Institution and displayed with a plaque listing all law enforcement agencies that participated in protecting the Capitol on January 6, 2021."
        },
        {
            "Bill Number": "H.R. 2252 (117th)",
            "First Name": "Stacey  Plaskett",
            "Last Name": "cosponsor",
            "Role": "H.R. 2252 (117th)",
            "Bill Name": "Emmett Till and Mamie Till-Mobley Congressional Gold Medal Act of 2021",
            "Subject Areas": "Racial and ethnic relations, Smithsonian Institution, U.S. history",
            "Summary": "This bill provides for the posthumous presentation of a Congressional Gold Medal in commemoration of Emmett Till and Mamie Till-Mobley.After the award the medal shall be given to the National Museum of African American History and Culture."
        },
        {
            "Bill Number": "H.R. 3642 (117th)",
            "First Name": "Stacey  Plaskett",
            "Last Name": "cosponsor",
            "Role": "H.R. 3642 (117th)",
            "Bill Name": "Harlem Hellfighters Congressional Gold Medal Act",
            "Subject Areas": "Armed Forces and National Security, Conflicts and wars, Congressional tributes, Military history, Military personnel and dependents, Museums, exhibitions, cultural centers, New York State, Racial and ethnic relations, Smithsonian Institution, Veterans' organizations and recognition",
            "Summary": "This bill provides for the award of a Congressional Gold Medal to the 369th Infantry Regiment, commonly known as the Harlem Hellfighters, in recognition of their bravery and outstanding service during World War I."
        },
        {
            "Bill Number": "H.R. 1842 (117th)",
            "First Name": "Stacey  Plaskett",
            "Last Name": "cosponsor",
            "Role": "H.R. 1842 (117th)",
            "Bill Name": "Harriet Tubman Bicentennial Commemorative Coin Act",
            "Subject Areas": "U.S. history, Women's rights",
            "Summary": "This bill directs the Department of the Treasury to mint and issue 50,000 $5 gold coins, 400,000 $1 silver coins, and 750,000 half-dollar clad coins emblematic of the legacy of Harriet Tubman as an abolitionist.The Secretary may issue coins under this bill only during the period of January 1, 2024, through December 31, 2024.All surcharges received by Treasury from the sale of such coins must be paid equally to the National Underground Railroad Freedom Center in Cincinnati, Ohio, and The Harriet Tubman Home, Inc. in Auburn, New York, for the purpose of accomplishing and advancing their missions."
        },
        {
            "Bill Number": "H.R. 6015 (117th)",
            "First Name": "Stacey  Plaskett",
            "Last Name": "cosponsor",
            "Role": "H.R. 6015 (117th)",
            "Bill Name": "Benjamin Berell Ferencz Congressional Gold Medal Act",
            "Subject Areas": "International Affairs, Congressional tributes, Criminal investigation, prosecution, interrogation, Europe, Germany, International law and treaties, Lawyers and legal services, Museums, exhibitions, cultural centers, War crimes, genocide, crimes against humanity",
            "Summary": "This bill provides for the award of a Congressional Gold Medal to Benjamin Berell Ferencz in recognition of his service to the United States and the international community during the post-World War II Nuremberg trials and his lifelong advocacy for international criminal justice and the rule of law."
        },
        {
            "Bill Number": "H.R. 5577 (117th)",
            "First Name": "Stacey  Plaskett",
            "Last Name": "cosponsor",
            "Role": "H.R. 5577 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 3900 Crown Road Southwest in Atlanta, Georgia, as the \\u201cJohn R. Lewis Post Office Building\\u201d.",
            "Subject Areas": "Government Operations and Politics, Congressional tributes, Georgia, Government buildings, facilities, and property, Postal service",
            "Summary": "This bill designates the facility of the United States Postal Service located at 3900 Crown Road Southwest in Atlanta, Georgia, as the John R. Lewis Post Office Building."
        },
        {
            "Bill Number": "H.R. 8982 (117th)",
            "First Name": "Stacey  Plaskett",
            "Last Name": "cosponsor",
            "Role": "H.R. 8982 (117th)",
            "Bill Name": "Bulk Infant Formula to Retail Shelves Act",
            "Subject Areas": NaN,
            "Summary": NaN
        },
        {
            "Bill Number": "H.R. 8876 (117th)",
            "First Name": "Stacey  Plaskett",
            "Last Name": "cosponsor",
            "Role": "H.R. 8876 (117th)",
            "Bill Name": "Jackie Walorski Maternal and Child Home Visiting Reauthorization Act of 2022",
            "Subject Areas": "Health, Appropriations, Census and government statistics, Child care and development, Child health, Child safety and welfare, Computers and information technology, Congressional oversight, Family planning and birth control, Family services, Government information and archives, Government studies and investigations, Health promotion and preventive care, Health technology, devices, supplies, Home and outpatient care, Intergovernmental relations, Performance measurement, Social work, volunteer service, charitable organizations, State and local finance, State and local government operations, Women's health",
            "Summary": "This bill reauthorizes through FY2027, increases funding for, and modifies the Maternal, Infant, and Early Childhood Home Visiting Program. This program supports home visits for expectant and new parents who live in communities that are at-risk for poor maternal and child health outcomes.Changes to the program include setting out requirements for allocating program funds; increasing the percentage of funds reserved for tribal entities; establishing a publicly available dashboard that reports program outcomes; requiring activities to reduce unnecessary data collection, reporting, and other administrative requirements of the program; and allowing for virtual home visits (provided certain conditions are met)."
        },
        {
            "Bill Number": "H.R. 4004",
            "First Name": "Stacey  Plaskett",
            "Last Name": "cosponsor",
            "Role": "H.R. 4004",
            "Bill Name": "United States-Taiwan Initiative on 21st-Century Trade First Agreement Implementation Act",
            "Subject Areas": NaN,
            "Summary": "This bill expresses the approval of Congress for the June 1, 2023, agreement regarding trade between the United States and Taiwan. The bill also imposes requirements on the negotiations of certain further trade agreements between the United States and Taiwan. (The June 1, 2023, agreement, which addresses issues such as customs administration and regulatory practices, is the first of several expected agreements under the United States-Taiwan Initiative on 21st-Century Trade.)The June 1, 2023, agreement may enter into force no earlier than 30 days after the President certifies in writing to Congress that Taiwan has taken measures necessary to comply with the agreement.The bill also imposes requirements on the negotiation of further agreements under the United States-Taiwan Initiative on 21st-Century Trade, such as requiring the U.S. Trade Representative (USTR) to (1) share any U.S. negotiating texts with Congress prior to sharing the text with Taiwan or any parties outside of the executive branch, (2) share any negotiating texts from Taiwan within three days of receipt, and (3) provide daily briefings to certain Members of Congress during negotiating rounds. A further agreement shall not take effect unless (1) the President, at least 60 days before entering into the further agreement, makes the text publicly available on a USTR website; and (2) a bill is enacted into law expressly approving the further agreement."
        }
    ],
    "VotingRecord": []
}