{
    "Name": "Ashley Hinson",
    "Profile": {
        "Public Office": {
            "Member of the U.S. House of Representativesfrom Iowa": {
                "Incumbent": "Incumbent",
                "Assumed office": "January 3, 2021",
                "Preceded by": "Abby Finkenauer",
                "Constituency": ".mw-parser-output .plainlist ol,.mw-parser-output .plainlist ul{line-height:inherit;list-style:none;margin:0;padding:0}.mw-parser-output .plainlist ol li,.mw-parser-output .plainlist ul li{margin-bottom:0},1st district, (2021–2023),2nd district, (2023–present)"
            },
            "Member of the Iowa House of Representativesfrom the 67th district": {
                "In office": "January 9, 2017 – January 3, 2021",
                "Preceded by": "Kraig Paulsen",
                "Succeeded by": "Eric Gjerde"
            }
        },
        "Personal Details": {
            "Personal details": {
                "Born": "Ashley Elizabeth Hinson, (,1983-06-27,) ,June 27, 1983, (age 39),Des Moines, Iowa,, U.S.",
                "Political party": "Republican",
                "Spouse": "Matthew Arenholz, ,,(,m., 2008),",
                "Children": "2",
                "Education": "University of Southern California, (,BA,)",
                "Signature": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/36/Ashleyhinsonsig.png/128px-Ashleyhinsonsig.png",
                "Website": "House website"
            }
        }
    },
    "UnusedVotingRecords": [
        {
            "Bill Number": "H.R. 2911 (117th)",
            "First Name": "Ashley Hinson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 2911 (117th)",
            "Bill Name": "VA Transparency & Trust Act of 2021",
            "Summary": "This bill requires the Department of Veterans Affairs (VA) to submit a plan for obligating and expending covered funds, which are funds made available to the VA for response to the COVID-19 pandemic.The bill requires the VA to submit biweekly reports regarding obligations, expenditures, and planned uses of the funds until seven days after the VA has expended all covered funds.The Inspector General of the VA must submit reports examining the obligations and expenditures made using covered funds during the specified reporting period.Finally, the Government Accountability Office must submit an interim report and final report containing a review of obligations and expenditures made using covered funds.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 92 (117th)",
            "First Name": "Ashley Hinson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 92 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 110 Johnson Street in Pickens, South Carolina, as the \\u201cSpecialist Four Charles Johnson Post Office\\u201d.",
            "Summary": "This bill designates the facility of the United States Postal Service located at 110 Johnson Street in Pickens, South Carolina, as the Specialist Four Charles Johnson Post Office.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 91 (117th)",
            "First Name": "Ashley Hinson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 91 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 810 South Pendleton Street in Easley, South Carolina, as the \\u201cPrivate First Class Barrett Lyle Austin Post Office Building\\u201d.",
            "Summary": "This bill designates the facility of the United States Postal Service located at 810 South Pendleton Street in Easley, South Carolina, as the Private First Class Barrett Lyle Austin Post Office Building.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1096",
            "First Name": "Ashley Hinson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1096",
            "Bill Name": "250th Anniversary of the United States Marine Corps Commemorative Coin Act",
            "Summary": "This bill directs the Department of the Treasury to mint and issue not more than 50,000 $5 gold coins, 400,000 $1 silver coins, and 750,000 half-dollar clad coins emblematic of the 250th anniversary of the United States Marine Corps.All surcharges received by Treasury from the sale of such coins must be paid to the Marine Corps Heritage Foundation and shall only be used for the purposes of supporting the mission of the Marine Corps Heritage Center.",
            "Status": "Enacted",
            "Democrat_Yea": 0.9528301886792452,
            "Democrat_Nay": 0.0,
            "Republican_Yea": 0.9366515837104072,
            "Republican_Nay": 0.004524886877828
        },
        {
            "Bill Number": "H.R. 6386 (117th)",
            "First Name": "Ashley Hinson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 6386 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 450 West Schaumburg Road in Schaumburg, Illinois, as the \\u201cVeterans of Iraq and Afghanistan Memorial Post Office Building\\u201d.",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 700 (117th)",
            "First Name": "Ashley Hinson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 700 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 303 East Mississippi Avenue in Elwood, Illinois, as the \\u201cLawrence M. \\u2018Larry\\u2019 Walsh Sr. Post Office\\u201d.",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 5900 (117th)",
            "First Name": "Ashley Hinson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 5900 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 2016 East 1st Street in Los Angeles, California, as the \\u201cMarine Corps Reserve PVT Jacob Cruz Post Office\\u201d.",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 224 (117th)",
            "First Name": "Ashley Hinson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 224 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 5302 Galveston Road in Houston, Texas, as the Vanessa Guill\\u00e9n Post Office Building.",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1437 (117th)",
            "First Name": "Ashley Hinson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1437 (117th)",
            "Bill Name": "Further Continuing Appropriations and Extensions Act, 2023",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 7077 (117th)",
            "First Name": "Ashley Hinson",
            "Vote": "Nay",
            "Bill Number.1": "H.R. 7077 (117th)",
            "Bill Name": "Empowering the U.S. Fire Administration Act",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 935 (117th)",
            "First Name": "Ashley Hinson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 935 (117th)",
            "Bill Name": "Small Business Mergers, Acquisitions, Sales, and Brokerage Simplification Act of 2021",
            "Summary": "This bill exempts from securities registration requirements certain merger-and-acquisition brokers that facilitate transfer of ownership in privately held companies with earnings or revenues under a specified threshold. However, this exemption shall not apply to certain brokers, including those that provide financing related to the transfer of ownership, engage on behalf of any party in a transaction involving specified shell companies, or have been barred or suspended from association with a broker or dealer.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3672",
            "First Name": "Ashley Hinson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3672",
            "Bill Name": "To designate the clinic of the Department of Veterans Affairs in Indian River, Michigan, as the \\u201cPfc. Justin T. Paton Department of Veterans Affairs Clinic\\u201d.",
            "Summary": NaN,
            "Status": "Enacted",
            "Democrat_Yea": 0.9386792452830188,
            "Democrat_Nay": 0.0,
            "Republican_Yea": 0.9502262443438914,
            "Republican_Nay": 0.0
        },
        {
            "Bill Number": "H.R. 1899 (117th)",
            "First Name": "Ashley Hinson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1899 (117th)",
            "Bill Name": "Ensuring Compliance Against Drug Diversion Act of 2021",
            "Summary": "This bill provides statutory authority for certain regulations governing the modification, transfer, and termination of a registration to manufacture, distribute, or dispense controlled substances. It terminates the registration of individuals and entities when they die, cease legal existence, discontinue business, or surrender such registration. It sets forth notification requirements, as well as conditions for transferring or assigning a registration.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1762 (117th)",
            "First Name": "Ashley Hinson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1762 (117th)",
            "Bill Name": "Protecting Indian Tribes from Scams Act",
            "Summary": "This bill requires the Federal Trade Commission (FTC), after consultation with Indian tribes, to report on unfair or deceptive practices that target tribes or tribal members. The FTC must submit the report to Congress and make it publicly available. Further, the FTC must update its website to include information for consumers and businesses on identifying and avoiding unfair or deceptive practices that target tribes or tribal members.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1002 (117th)",
            "First Name": "Ashley Hinson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1002 (117th)",
            "Bill Name": "DEBAR Act of 2021",
            "Summary": "This bill authorizes the Drug Enforcement Administration (DEA) to bar an entity from registering to manufacture, distribute, or dispense controlled substances under certain circumstances.Specifically, the DEA may bar—temporarily or permanently—the registration of an entity that (1) meets or has met any condition for suspension or revocation of the registration, and (2) has a history of prior suspensions or revocations.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 941 (117th)",
            "First Name": "Ashley Hinson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 941 (117th)",
            "Bill Name": "TRANSPLANT Act of 2021",
            "Summary": "This bill modifies and reauthorizes through FY2026 the C.W. Bill Young Cell Transplantation Program, which provides support to patients who need a potentially life-saving bone marrow transplant or umbilical cord blood transplant.The bill also requires the Department of Health and Human Services to conduct a periodic review of the science of using adult stem cells and birthing tissues in therapeutic treatments.In addition, the Government Accountability Office must report on the regenerative medicine workforce.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1460 (117th)",
            "First Name": "Ashley Hinson",
            "Vote": "Nay",
            "Bill Number.1": "H.R. 1460 (117th)",
            "Bill Name": "Nicholas and Zachary Burt Memorial Carbon Monoxide Poisoning Prevention Act of 2021",
            "Summary": "This bill directs the Consumer Product Safety Commission to award grants to states and tribal organizations to install carbon monoxide alarms in the homes of low-income families and older adults and facilities that commonly serve children or older adults. Such carbon monoxide alarms must comply with specified standards.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1215 (117th)",
            "First Name": "Ashley Hinson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1215 (117th)",
            "Bill Name": "Fraud and Scam Reduction Act",
            "Summary": "This bill expands activities to address mail, telephone, and internet fraud, particularly such scams targeting older adults.The bill establishes a Senior Scams Prevention Advisory Group, which must create model educational materials to educate employees of retailers, financial-services companies, and wire-transfer companies on how to identify and prevent scams that affect older adults.Further, the Federal Trade Commission (FTC) must establish an advisory office in the Bureau of Consumer Protection to assist the FTC in monitoring scams targeting older adults, educating consumers, and receiving complaints.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 172 (117th)",
            "First Name": "Ashley Hinson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 172 (117th)",
            "Bill Name": "United States Anti-Doping Agency Reauthorization Act of 2021",
            "Summary": "This bill authorizes appropriations for the U.S. Anti-Doping Agency (USADA) through FY2030.The bill adds requirements that USADA be responsible for certifying in advance any testing conducted by international organizations under the World Anti-Doping Code for international amateur athletes and athletic competitions occurring within the jurisdiction of the United States; and promote a positive youth sport experience by using a portion of its funding to provide educational materials on sportsmanship, character building, and healthy performance for those participating in youth sports. The bill requires any action taken by USADA to enforce a policy, procedure, or requirement against a person with respect to a violation of federal law, including an investigation, disciplinary action, sanction, or any other administrative action, to be carried out in a manner that provides due process protection.The Department of Justice, the Department of Homeland Security, and the Food and Drug Administration must provide to USADA information relating to the prevention of the use of performance-enhancing drugs or the prohibition of performance-enhancing methods.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1868 (117th)",
            "First Name": "Ashley Hinson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1868 (117th)",
            "Bill Name": "To prevent across-the-board direct spending cuts, and for other purposes.",
            "Summary": "This bill makes several budgetary and technical changes to provisions under Medicare and Medicaid. The bill continues to exempt Medicare from sequestration until December 31, 2021. (Sequestration is a process of automatic, usually across-the-board spending reductions under which budgetary resources are permanently cancelled to enforce specific budget policy goals.)The bill also specifically applies certain modified payment limits to rural health clinics that temporarily enrolled in Medicare during the public health emergency relating to COVID-19 (i.e., coronavirus disease 2019) or that applied to enroll by December 31, 2020; and preserves higher Medicaid disproportionate-share hospital payments for public hospitals in California under forthcoming payment methodology changes.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1868 (117th)",
            "First Name": "Ashley Hinson",
            "Vote": "Nay",
            "Bill Number.1": "H.R. 1868 (117th)",
            "Bill Name": "To prevent across-the-board direct spending cuts, and for other purposes.",
            "Summary": "This bill makes several budgetary and technical changes to provisions under Medicare and Medicaid. The bill continues to exempt Medicare from sequestration until December 31, 2021. (Sequestration is a process of automatic, usually across-the-board spending reductions under which budgetary resources are permanently cancelled to enforce specific budget policy goals.)The bill also specifically applies certain modified payment limits to rural health clinics that temporarily enrolled in Medicare during the public health emergency relating to COVID-19 (i.e., coronavirus disease 2019) or that applied to enroll by December 31, 2020; and preserves higher Medicaid disproportionate-share hospital payments for public hospitals in California under forthcoming payment methodology changes.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3746",
            "First Name": "Ashley Hinson",
            "Vote": "Aye",
            "Bill Number.1": "H.R. 3746",
            "Bill Name": "Fiscal Responsibility Act of 2023",
            "Summary": NaN,
            "Status": "Enacted",
            "Democrat_Yea": 0.9166666666666666,
            "Democrat_Nay": 0.0833333333333333,
            "Republican_Yea": 0.3469387755102041,
            "Republican_Nay": 0.6326530612244898
        },
        {
            "Bill Number": "H.R. 7276 (117th)",
            "First Name": "Ashley Hinson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 7276 (117th)",
            "Bill Name": "Ukraine Invasion War Crimes Deterrence and Accountability Act",
            "Summary": "This bill requires the President to report to Congress on atrocities committed during Russia's invasion of Ukraine since February 24, 2022.Specifically, the report must describe in detail (1) U.S. government efforts to collect, analyze, and preserve evidence related to war crimes and other atrocities committed during the invasion; (2) media, public diplomacy, and information operations to make the Russian people, including their military and political leaders, aware of efforts to identify and prosecute those responsible for such atrocities; and (3) the process for a domestic, foreign, or international court or tribunal to obtain information from the U.S. government related to such atrocities.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1652 (117th)",
            "First Name": "Ashley Hinson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1652 (117th)",
            "Bill Name": "VOCA Fix to Sustain the Crime Victims Fund Act of 2021",
            "Summary": "This bill adds a new source of revenue for the Crime Victims Fund and makes changes to formula grants supported by the fund.Specifically, the bill directs revenues collected from deferred prosecution and non-prosecution agreements to be deposited into the Crime Victims Fund. Currently, such revenues are deposited into the general fund of the Treasury.Additionally, the bill increases the percentage—from 60% to 75%—of state compensation payments to crime victims in the prior fiscal year used to calculate formula grants for state victim compensation programs.Finally, the bill directs states to waive the matching requirement for recipients of state victim assistance formula grants during and for one year after a pandemic-related national emergency. It also allows states to waive the matching requirement pursuant to a policy established by the state.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1085 (117th)",
            "First Name": "Ashley Hinson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1085 (117th)",
            "Bill Name": "To award three congressional gold medals to the United States Capitol Police and those who protected the U.S. Capitol on January 6, 2021.",
            "Summary": "This bill directs the Speaker of the House and the President pro tempore of the Senate to arrange for the award of three Congressional Gold Medals to the U.S. Capitol Police (USCP) and other law enforcement agencies that protected the U.S. Capitol on January 6, 2021.Following the award of these medals, one medal shall be given to the USCP, one medal shall be given to the Metropolitan Police Department of the District of Columbia, and one medal shall be given to the Smithsonian Institution and displayed with a plaque listing all law enforcement agencies that participated in protecting the Capitol on January 6, 2021.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1651 (117th)",
            "First Name": "Ashley Hinson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1651 (117th)",
            "Bill Name": "COVID-19 Bankruptcy Relief Extension Act of 2021",
            "Summary": "This bill extends existing provisions that provide relief to debtors in bankruptcy, including those related to the COVID-19 (i.e., coronavirus disease 2019) pandemic.These provisions (1) exclude certain COVID-19 aid payments from income for the purposes of bankruptcy, and (2) increase the debt eligibility threshold for businesses qualifying for certain types of Chapter 11 reorganization bankruptcy. Currently, these provisions expire March 27, 2021. The bill extends these provisions for one year.The bill also allows for modification of a Chapter 13 repayment plan for plans confirmed before the date of enactment of this bill if the debtor is experiencing material financial hardship due to COVID-19. Currently, such a modification is only available for plans confirmed before March 27, 2020.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1799 (117th)",
            "First Name": "Ashley Hinson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1799 (117th)",
            "Bill Name": "PPP Extension Act of 2021",
            "Summary": "This bill extends the Paycheck Protection Program, established to support small businesses in response to COVID-19 (i.e., coronavirus disease 2019), through June 30, 2021. Currently, the program is set to expire on March 31, 2021.For the final 30 days of the program (i.e., from June 1 until June 30), the Small Business Administration may only process applications submitted prior to June 1, and it may not accept any new loan applications.The bill excludes the budgetary effects of this bill from PAYGO scorecards under the Statutory Pay-As-You-Go Act of 2010 and from Senate PAYGO scorecards.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1218 (117th)",
            "First Name": "Ashley Hinson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1218 (117th)",
            "Bill Name": "Data Mapping to Save Moms\\u2019 Lives Act",
            "Summary": "This bill directs the Federal Communications Commission (FCC) to include data on certain maternal health outcomes in its broadband health mapping tool. This is an online platform that allows users to visualize, overlay, and analyze broadband and health data at national, state, and county levels.The FCC must consult with the Centers for Disease Control and Prevention to determine which maternal health outcomes should be incorporated.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1319 (117th)",
            "First Name": "Ashley Hinson",
            "Vote": "Nay",
            "Bill Number.1": "H.R. 1319 (117th)",
            "Bill Name": "American Rescue Plan Act of 2021",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 6833 (117th)",
            "First Name": "Ashley Hinson",
            "Vote": "Nay",
            "Bill Number.1": "H.R. 6833 (117th)",
            "Bill Name": "Continuing Appropriations and Ukraine Supplemental Appropriations Act, 2023",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1734",
            "First Name": "Ashley Hinson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1734",
            "Bill Name": "TRANQ Research Act of 2023",
            "Summary": "This bill requires the National Institute of Standards and Technology (NIST) to support research and other activities related to identifying xylazine (a compound used in veterinary medicine as a nonopioid tranquilizer), novel synthetic opioids, and other new psychoactive substances.In particular, NIST must support basic measurement science and research; near-real time spectrometry capabilities (i.e., a technique for rapidly identifying the chemical composition of a substance); strategies and voluntary best practices for handling, transporting, and analyzing such substances; and collaboration with other government agencies, institutions of higher education, and the private sector to enhance relevant narcotic and opioid detection and analysis capabilities. Additionally, the Government Accountability Office must conduct a study on the capabilities of the federal government to detect, identify, and otherwise respond to threats of new psychoactive substances, such as xylazine.",
            "Status": "Enacted",
            "Democrat_Yea": 0.9671361502347418,
            "Democrat_Nay": 0.0,
            "Republican_Yea": 0.9864864864864864,
            "Republican_Nay": 0.0
        },
        {
            "Bill Number": "H.R. 2954 (117th)",
            "First Name": "Ashley Hinson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 2954 (117th)",
            "Bill Name": "Securing a Strong Retirement Act of 2021",
            "Summary": "This bill makes various changes with respect to employer-sponsored retirement plans, including providing for the automatic enrollment of employees in certain plans and increasing the age at which participants are required to begin receiving mandatory distributions.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3359 (117th)",
            "First Name": "Ashley Hinson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3359 (117th)",
            "Bill Name": "Homicide Victims\\u2019 Families\\u2019 Rights Act of 2021",
            "Summary": "This bill establishes a framework for immediate family members of a victim of murder under federal law to request a review of the victim's case file if the murder was committed more than three years prior, the murder was investigated by a federal law enforcement entity, all probative investigative leads have been exhausted, and no likely perpetrator has been identified.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3197 (117th)",
            "First Name": "Ashley Hinson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3197 (117th)",
            "Bill Name": "Save the Liberty Theatre Act of 2021",
            "Summary": NaN,
            "Status": NaN
        },
        {
            "Bill Number": "H.R. 3113 (117th)",
            "First Name": "Ashley Hinson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3113 (117th)",
            "Bill Name": "Modernizing Access to Our Public Land Act",
            "Summary": "This bill directs the Department of the Interior, the Forest Service, and the U.S. Army Corps of Engineers to jointly develop and adopt interagency standards to ensure compatibility and interoperability among federal databases for the collection and dissemination of outdoor recreation data related to federal lands and used to depict locations at which recreation uses are available to the public.Interior, the Forest Service, and the Corps of Engineers must digitize and publish geographic information system data that includes federal interests, including easements and rights-of-way, in private land; status information as to whether roads and trails are open or closed; the dates on which roads and trails are seasonally opened and closed; the types of vehicles and recreational uses that are allowed on each segment of roads and trails; and the boundaries of areas where hunting or recreational shooting is permanently restricted or closed. Interior, the Forest Service, and the Corps of Engineers may work with the U.S. Geological Survey to collect, digitize, standardize, or publish data to meet the requirements of this bill.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1319 (117th)",
            "First Name": "Ashley Hinson",
            "Vote": "Nay",
            "Bill Number.1": "H.R. 1319 (117th)",
            "Bill Name": "American Rescue Plan Act of 2021",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1192 (117th)",
            "First Name": "Ashley Hinson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1192 (117th)",
            "Bill Name": "PRRADA",
            "Summary": "This bill requires professionals employed in debt adjustment cases involving Puerto Rico to file verified statements disclosing their connections with interested parties before seeking compensation for their services.The Financial Oversight and Management Board for Puerto Rico must establish a list of such interested parties, which shall include the debtor, creditors, any attorney or accountant of the debtor or creditors, persons employed by the U.S. Trustee Program, persons employed by the board, and any other interested party.Compensation may be denied to such a professional if these disclosures are not filed, are inadequate, or if the professional is found to have certain conflicts of interest.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 2471 (117th)",
            "First Name": "Ashley Hinson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 2471 (117th)",
            "Bill Name": "Consolidated Appropriations Act, 2022",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 2471 (117th)",
            "First Name": "Ashley Hinson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 2471 (117th)",
            "Bill Name": "Consolidated Appropriations Act, 2022",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 208 (117th)",
            "First Name": "Ashley Hinson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 208 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 500 West Main Street, Suite 102 in Tupelo, Mississippi, as the Colonel Carlyle Smitty Harris Post Office.",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 55 (117th)",
            "First Name": "Ashley Hinson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 55 (117th)",
            "Bill Name": "Emmett Till Antilynching Act",
            "Summary": "This bill makes lynching a federal hate crime offense.Specifically, the bill imposes criminal penalties—a fine, a prison term of up to 30 years, or both—on an individual who conspires to commit a hate crime offense that results in death or serious bodily injury or that includes kidnapping or an attempt to kidnap, aggravated sexual abuse or an attempt to commit aggravated sexual abuse, or an attempt to kill.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3539 (117th)",
            "First Name": "Ashley Hinson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3539 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 223 West Chalan Santo Papa in Hagatna, Guam, as the \\u201cAtanasio Taitano Perez Post Office\\u201d.",
            "Summary": "This bill designates the facility of the United States Postal Service located at 223 West Chalan Santo Papa in Hagatna, Guam, as the Atanasio Taitano Perez Post Office.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 735 (117th)",
            "First Name": "Ashley Hinson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 735 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 502 East Cotati Avenue in Cotati, California, as the \\u201cArturo L. Ibleto Post Office Building\\u201d.",
            "Summary": "This bill designates the facility of the United States Postal Service located at 502 East Cotati Avenue in Cotati, California, as the Arturo L. Ibleto Post Office Building.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3076 (117th)",
            "First Name": "Ashley Hinson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3076 (117th)",
            "Bill Name": "Postal Service Reform Act of 2022",
            "Summary": "This bill addresses the finances and operations of the U.S. Postal Service (USPS).The bill requires the Office of Personnel Management (OPM) to establish the Postal Service Health Benefits Program within the Federal Employees Health Benefits Program under which OPM may contract with carriers to offer health benefits plans for USPS employees and retirees.The bill provides for coordinated enrollment of retirees under this program and Medicare.The bill repeals the requirement that the USPS annually prepay future retirement health benefits.Additionally, the USPS may establish a program to enter into agreements with an agency of any state government, local government, or tribal government, and with other government agencies, to provide certain nonpostal products and services that reasonably contribute to the costs of the USPS and meet other specified criteria.The USPS must develop and maintain a publicly available dashboard to track service performance and must report regularly on its operations and financial condition.The Postal Regulatory Commission must annually submit to the USPS a budget of its expenses. It must also conduct a study to identify the causes and effects of postal inefficiencies relating to flats (e.g., large envelopes).The USPS Office of Inspector General shall perform oversight of the Postal Regulatory Commission.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 2324 (117th)",
            "First Name": "Ashley Hinson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 2324 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 2800 South Adams Street in Tallahassee, Florida, as the \\u201cD. Edwina Stephens Post Office\\u201d.",
            "Summary": "This bill designates the facility of the United States Postal Service located at 2800 South Adams Street in Tallahassee, Florida, as the D. Edwina Stephens Post Office.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 335 (117th)",
            "First Name": "Ashley Hinson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 335 (117th)",
            "Bill Name": "To provide for an exception to a limitation against appointment of persons as Secretary of Defense within seven years of relief from active duty as a regular commissioned officer of the Armed Forces.",
            "Summary": "This bill allows the first person nominated and appointed as Secretary of Defense after 12 p.m. (Eastern Standard Time) on January 20, 2021, to be a person who is, on the date of appointment, at least four years after relief from active duty as a commissioned officer of a regular component of the Armed Forces. Under current law, an individual may not be appointed as Secretary of Defense within seven years after relief from such active duty.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 22 (117th)",
            "First Name": "Ashley Hinson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 22 (117th)",
            "Bill Name": "Congressional Budget Justification Transparency Act of 2021",
            "Summary": "This bill requires federal agencies to make budget justification materials available to the public on a website. The bill also requires the Office of Management and Budget to make certain details regarding the materials available to the public, including a list of the agencies that submit budget justification materials to Congress, the dates that the materials are submitted to Congress and posted online, and links to the materials.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1226",
            "First Name": "Ashley Hinson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1226",
            "Bill Name": "Wounded Warrior Access Act",
            "Summary": NaN,
            "Status": "Enacted",
            "Democrat_Yea": 0.9575471698113208,
            "Democrat_Nay": 0.0,
            "Republican_Yea": 0.9864864864864864,
            "Republican_Nay": 0.0
        },
        {
            "Bill Number": "H.R. 5577 (117th)",
            "First Name": "Ashley Hinson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 5577 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 3900 Crown Road Southwest in Atlanta, Georgia, as the \\u201cJohn R. Lewis Post Office Building\\u201d.",
            "Summary": "This bill designates the facility of the United States Postal Service located at 3900 Crown Road Southwest in Atlanta, Georgia, as the John R. Lewis Post Office Building.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 346",
            "First Name": "Ashley Hinson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 346",
            "Bill Name": "NOTAM Improvement Act of 2023",
            "Summary": "This bill directs the Federal Aviation Administration (FAA) to establish the FAA Task Force on NOTAM (notice to air missions required by international or domestic law) Improvement and requires the FAA to implement a federal NOTAM system. A NOTAM is a notice containing information essential to personnel concerned with flight operations but not known far enough in advance to be publicized by other means. It states the abnormal status of a component of the National Airspace System.Specifically, the task force must (1) review existing methods for publishing NOTAMs and flight operations information for pilots; (2) review regulations, policies, systems, and international standards relating to NOTAMs, including their content and presentation to pilots; (3) evaluate and determine best practices to organize, prioritize, and present flight operations information in a manner that optimizes pilot review and retention of relevant information; (4) provide recommendations to improve the publication and delivery of NOTAM information; and (5) report to Congress on its reviews and evaluations.By September 30, 2024, the FAA must (1) complete implementation of a federal NOTAM system and implement a back-up system, and (2) brief Congress on a plan to enhance information delivery through this federal system to promote further global harmonization and provide users of the National Airspace System a consistent format for domestic and international operations.",
            "Status": "Enacted",
            "Democrat_Yea": 0.9764150943396226,
            "Democrat_Nay": 0.0,
            "Republican_Yea": 0.9774774774774776,
            "Republican_Nay": 0.018018018018018
        }
    ],
    "CosponsoredBills": [
        {
            "Bill Number": "H.R. 5110",
            "First Name": "Ashley  Hinson",
            "Last Name": "cosponsor",
            "Role": "H.R. 5110",
            "Bill Name": "Protecting Hunting Heritage and Education Act",
            "Subject Areas": "Outdoor recreation, School athletics",
            "Summary": NaN
        },
        {
            "Bill Number": "H.R. 5233",
            "First Name": "Ashley  Hinson",
            "Last Name": "cosponsor",
            "Role": "H.R. 5233",
            "Bill Name": "To amend the Passport Act of June 4, 1920, to make certain improvements with respect to expenditure and other authorities, and for other purposes.",
            "Subject Areas": "Immigration",
            "Summary": NaN
        },
        {
            "Bill Number": "H.R. 1096",
            "First Name": "Ashley  Hinson",
            "Last Name": "cosponsor",
            "Role": "H.R. 1096",
            "Bill Name": "250th Anniversary of the United States Marine Corps Commemorative Coin Act",
            "Subject Areas": "Military personnel and dependents",
            "Summary": "This bill directs the Department of the Treasury to mint and issue not more than 50,000 $5 gold coins, 400,000 $1 silver coins, and 750,000 half-dollar clad coins emblematic of the 250th anniversary of the United States Marine Corps.All surcharges received by Treasury from the sale of such coins must be paid to the Marine Corps Heritage Foundation and shall only be used for the purposes of supporting the mission of the Marine Corps Heritage Center."
        },
        {
            "Bill Number": "H.R. 310 (117th)",
            "First Name": "Ashley  Hinson",
            "Last Name": "cosponsor",
            "Role": "H.R. 310 (117th)",
            "Bill Name": "To posthumously award the Congressional Gold Medal, collectively, to Glen Doherty, Tyrone Woods, J. Christopher Stevens, and Sean Smith, in recognition of their contributions to the Nation.",
            "Subject Areas": "Intelligence activities, surveillance, classified information, Law enforcement officers, Libya, Middle East, Terrorism, Veterans' organizations and recognition",
            "Summary": NaN
        },
        {
            "Bill Number": "H.R. 1193 (117th)",
            "First Name": "Ashley  Hinson",
            "Last Name": "cosponsor",
            "Role": "H.R. 1193 (117th)",
            "Bill Name": "Cardiovascular Advances in Research and Opportunities Legacy Act",
            "Subject Areas": "Health, Advanced technology and technological innovations, Cardiovascular and respiratory health, Government information and archives, Health information and medical records, Health programs administration and funding, Health promotion and preventive care, Health technology, devices, supplies, Medical research, Medical tests and diagnostic methods, Photography and imaging, Research administration and funding",
            "Summary": NaN
        },
        {
            "Bill Number": "H.R. 8876 (117th)",
            "First Name": "Ashley  Hinson",
            "Last Name": "cosponsor",
            "Role": "H.R. 8876 (117th)",
            "Bill Name": "Jackie Walorski Maternal and Child Home Visiting Reauthorization Act of 2022",
            "Subject Areas": "Health, Appropriations, Census and government statistics, Child care and development, Child health, Child safety and welfare, Computers and information technology, Congressional oversight, Family planning and birth control, Family services, Government information and archives, Government studies and investigations, Health promotion and preventive care, Health technology, devices, supplies, Home and outpatient care, Intergovernmental relations, Performance measurement, Social work, volunteer service, charitable organizations, State and local finance, State and local government operations, Women's health",
            "Summary": "This bill reauthorizes through FY2027, increases funding for, and modifies the Maternal, Infant, and Early Childhood Home Visiting Program. This program supports home visits for expectant and new parents who live in communities that are at-risk for poor maternal and child health outcomes.Changes to the program include setting out requirements for allocating program funds; increasing the percentage of funds reserved for tribal entities; establishing a publicly available dashboard that reports program outcomes; requiring activities to reduce unnecessary data collection, reporting, and other administrative requirements of the program; and allowing for virtual home visits (provided certain conditions are met)."
        },
        {
            "Bill Number": "H.R. 3630 (117th)",
            "First Name": "Ashley  Hinson",
            "Last Name": "cosponsor",
            "Role": "H.R. 3630 (117th)",
            "Bill Name": "Lymphedema Treatment Act",
            "Subject Areas": "Health, Labor and Employment, Cardiovascular and respiratory health, Health care coverage and access, Immunology and vaccination, Medicare",
            "Summary": "This bill provides for Medicare coverage of lymphedema compression treatment items. Specifically, the bill provides for coverage of standard and custom fitted gradient compression garments and other approved items that are prescribed by a physician or other specified health care professional to treat lymphedema."
        },
        {
            "Bill Number": "H.R. 4693 (117th)",
            "First Name": "Ashley  Hinson",
            "Last Name": "cosponsor",
            "Role": "H.R. 4693 (117th)",
            "Bill Name": "Global Malnutrition Prevention and Treatment Act of 2021",
            "Subject Areas": "International Affairs, Child health, Congressional oversight, Executive agency funding and structure, Food assistance and relief, Foreign aid and international relief, Health programs administration and funding, Health promotion and preventive care, International organizations and cooperation, Multilateral development programs, Nutrition and diet, Performance measurement, U.S. Agency for International Development (USAID), Women's education, World health",
            "Summary": NaN
        },
        {
            "Bill Number": "H.R. 5577 (117th)",
            "First Name": "Ashley  Hinson",
            "Last Name": "cosponsor",
            "Role": "H.R. 5577 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 3900 Crown Road Southwest in Atlanta, Georgia, as the \\u201cJohn R. Lewis Post Office Building\\u201d.",
            "Subject Areas": "Government Operations and Politics, Congressional tributes, Georgia, Government buildings, facilities, and property, Postal service",
            "Summary": "This bill designates the facility of the United States Postal Service located at 3900 Crown Road Southwest in Atlanta, Georgia, as the John R. Lewis Post Office Building."
        },
        {
            "Bill Number": "H.R. 8656 (117th)",
            "First Name": "Ashley  Hinson",
            "Last Name": "cosponsor",
            "Role": "H.R. 8656 (117th)",
            "Bill Name": "To designate the clinic of the Department of Veterans Affairs in Mishawaka, Indiana, as the \\u201cJackie Walorski VA Clinic\\u201d.",
            "Subject Areas": "Armed Forces and National Security, Congressional tributes, Department of Veterans Affairs, Government buildings, facilities, and property, Health facilities and institutions, Indiana, Veterans' medical care",
            "Summary": NaN
        },
        {
            "Bill Number": "H.R. 3843 (117th)",
            "First Name": "Ashley  Hinson",
            "Last Name": "cosponsor",
            "Role": "H.R. 3843 (117th)",
            "Bill Name": "Merger Filing Fee Modernization Act of 2022",
            "Subject Areas": "Commerce, Competition and antitrust, Corporate finance and management, Department of Justice, Executive agency funding and structure, Federal Trade Commission (FTC), Inflation and prices, User charges and fees",
            "Summary": "This bill modifies and expands the schedule for graduated merger filing fees and requires that such fees be adjusted each year based on the Consumer Price Index. It also (1) requires parties to disclose in their premerger notification filings any subsidy received from a foreign entity of concern, (2) modifies the venue rules for multi-district antitrust litigation, and (3) establishes various reporting requirements."
        },
        {
            "Bill Number": "H.R. 1057 (117th)",
            "First Name": "Ashley  Hinson",
            "Last Name": "cosponsor",
            "Role": "H.R. 1057 (117th)",
            "Bill Name": "Greatest Generation Commemorative Coin Act",
            "Subject Areas": "Finance and Financial Sector, Conflicts and wars, Currency, Military history, Monuments and memorials, U.S. history, Veterans' organizations and recognition",
            "Summary": "This bill directs the Department of the Treasury to mint and issue up to 50,000 $5 coins, 400,000 $1 silver coins, and 750,000 half-dollar clad coins in commemoration of the National World War II Memorial in the District of Columbia.The design of the coins shall be emblematic of the memorial and the service and sacrifice of American soldiers and civilians during World War II.All surcharges received from the sale of such coins shall be paid to the Friends of the National World War II Memorial to support the National Park Service in maintaining and repairing the memorial, and for educational and commemorative programs."
        },
        {
            "Bill Number": "H.R. 7705 (117th)",
            "First Name": "Ashley  Hinson",
            "Last Name": "cosponsor",
            "Role": "H.R. 7705 (117th)",
            "Bill Name": "Supreme Court Police Parity Act of 2022",
            "Subject Areas": "Government Operations and Politics, Family relationships, Government employee pay, benefits, personnel management, Judges, Law enforcement administration and funding, Law enforcement officers, Protection of officials, Supreme Court",
            "Summary": "This bill grants the Marshal of the Supreme Court and the Supreme Court Police the authority to protect any member of the immediate family of the Chief Justice, any Associate Justice, or any officer of the Supreme Court if the Marshal determines that such protection is necessary."
        },
        {
            "Bill Number": "H.R. 5142 (117th)",
            "First Name": "Ashley  Hinson",
            "Last Name": "cosponsor",
            "Role": "H.R. 5142 (117th)",
            "Bill Name": "To award posthumously a Congressional Gold Medal, in commemoration to the servicemembers who perished in Afghanistan on August 26, 2021, during the evacuation of citizens of the United States and Afghan allies at Hamid Karzai Internati",
            "Subject Areas": "Armed Forces and National Security, International Affairs, Afghanistan, Asia, Conflicts and wars, Congressional tributes, Emergency planning and evacuation, Military operations and strategy, Military personnel and dependents, Museums, exhibitions, cultural centers, Smithsonian Institution, Terrorism",
            "Summary": "This bill posthumously provides for the award of a Congressional Gold Medal in commemoration of the 13 service members who died on August 26, 2021, while stationed at Hamid Karzai International Airport in Afghanistan."
        },
        {
            "Bill Number": "H.R. 1448 (117th)",
            "First Name": "Ashley  Hinson",
            "Last Name": "cosponsor",
            "Role": "H.R. 1448 (117th)",
            "Bill Name": "PAWS for Veterans Therapy Act",
            "Subject Areas": "Armed Forces and National Security, Animal protection and human-animal relationships, Congressional oversight, Disability assistance, Government information and archives, Government studies and investigations, Health programs administration and funding, Mammals, Mental health, Neurological disorders, Service animals, Veterans' education, employment, rehabilitation, Veterans' medical care",
            "Summary": "This bill implements a program and a policy related to service dog therapy for veterans. Specifically, the bill requires the Department of Veterans Affairs (VA) to implement a five-year pilot program to provide canine training to eligible veterans diagnosed with post-traumatic stress disorder as an element of a complementary and integrative health program. Eligible veterans are those who are enrolled in the VA health care system and have been recommended for participation by a qualified mental health care provider or clinical team.The VA must seek to enter agreements containing specified elements with accredited nongovernmental entities that have demonstrated ability to provide canine training.Veterans who participate in the program are authorized to adopt the dog they assisted in training if their health provider determines it is in the best interest of the veteran.The VA must establish processes to document and track the progress of participating veterans with respect to health benefits and improvements. The Government Accountability Office must brief Congress and submit a report on the program.The bill also authorizes the VA to provide service dogs to veterans with mental illnesses, regardless of whether they have a mobility impairment."
        },
        {
            "Bill Number": "H.R. 3642 (117th)",
            "First Name": "Ashley  Hinson",
            "Last Name": "cosponsor",
            "Role": "H.R. 3642 (117th)",
            "Bill Name": "Harlem Hellfighters Congressional Gold Medal Act",
            "Subject Areas": "Armed Forces and National Security, Conflicts and wars, Congressional tributes, Military history, Military personnel and dependents, Museums, exhibitions, cultural centers, New York State, Racial and ethnic relations, Smithsonian Institution, Veterans' organizations and recognition",
            "Summary": "This bill provides for the award of a Congressional Gold Medal to the 369th Infantry Regiment, commonly known as the Harlem Hellfighters, in recognition of their bravery and outstanding service during World War I."
        },
        {
            "Bill Number": "H.R. 4498 (117th)",
            "First Name": "Ashley  Hinson",
            "Last Name": "cosponsor",
            "Role": "H.R. 4498 (117th)",
            "Bill Name": "To make emergency appropriations to the National Guard.",
            "Subject Areas": "Armed Forces and National Security, Appropriations, Assault and harassment offenses, Civil disturbances, Crimes against property, Defense spending, Department of Defense, Executive agency funding and structure, Government buildings, facilities, and property, Military personnel and dependents, National Guard and reserves, Protest and dissent, Subversive activities, Terrorism, U.S. Capitol, Violent crime",
            "Summary": "This bill provides supplemental FY2021 appropriations to the National Guard for its response to the events at the U.S. Capitol on January 6, 2021. The bill designates the funding as emergency spending, which is exempt from discretionary spending limits."
        },
        {
            "Bill Number": "H.R. 3577 (117th)",
            "First Name": "Ashley  Hinson",
            "Last Name": "cosponsor",
            "Role": "H.R. 3577 (117th)",
            "Bill Name": "United States Army Rangers Veterans of World War II Congressional Gold Medal Act",
            "Subject Areas": "Armed Forces and National Security, Conflicts and wars, Congressional tributes, Military history, Museums, exhibitions, cultural centers, Smithsonian Institution, Veterans' organizations and recognition",
            "Summary": "This bill provides for the award of a single Congressional Gold Medal to the U.S. Army Rangers Veterans of World War II in recognition of their dedicated service during World War II."
        },
        {
            "Bill Number": "H.R. 3537 (117th)",
            "First Name": "Ashley  Hinson",
            "Last Name": "cosponsor",
            "Role": "H.R. 3537 (117th)",
            "Bill Name": "Accelerating Access to Critical Therapies for ALS Act",
            "Subject Areas": "Health, Drug safety, medical device, and laboratory regulation, Drug therapy, Government information and archives, Health care coverage and access, Health programs administration and funding, Health promotion and preventive care, Higher education, Medical research, Medical tests and diagnostic methods, Neurological disorders, Prescription drugs, Public-private cooperation, Research administration and funding, Research and development, Social work, volunteer service, charitable organizations",
            "Summary": "This bill establishes grant programs to address neurodegenerative diseases, such as amyotrophic lateral sclerosis (also known as ALS or Lou Gehrig's disease), and contains other related provisions.The Department of Health and Human Services (HHS) shall award grants to eligible entities for scientific research utilizing data from expanded access to investigational ALS treatments for individuals who are not otherwise eligible for clinical trials. The Food and Drug Administration (FDA) shall award grants to public and private entities to cover the costs of research and development of drugs that diagnose or treat ALS and other rare neurodegenerative diseases.HHS shall also establish the Public-Private Partnership for Neurodegenerative Diseases between the National Institutes of Health, the FDA, and at least one eligible entity (generally, an institution of higher education or a nonprofit organization). The partnership shall support the development and regulatory review of drugs that address ALS and other rare neurodegenerative diseases.The FDA shall publish on its website a five-year action plan for fostering the development of drugs that improve or extend the lives of people living with rare neurodegenerative diseases.The Government Accountability Office must report to Congress about the grants provided under this bill, including an analysis of the impact of such grants on research and development of treatments for ALS."
        },
        {
            "Bill Number": "H.R. 2704 (117th)",
            "First Name": "Ashley  Hinson",
            "Last Name": "cosponsor",
            "Role": "H.R. 2704 (117th)",
            "Bill Name": "Improving VA Accountability To Prevent Sexual Harassment and Discrimination Act of 2021",
            "Subject Areas": "Department of Veterans Affairs, Employment and training programs, Employment discrimination and employee rights, Executive agency funding and structure, Government employee pay, benefits, personnel management, Sex offenses, Sex, gender, sexual orientation discrimination",
            "Summary": "This bill requires the Department of Veterans Affairs (VA) to implement various policies and procedures related to sexual harassment, other harassment, and employment discrimination.The bill requires the VA to ensure that the official who serves as the VA's Equal Employment Opportunity Director reports directly to the Deputy Secretary and does not also serve in a position that has responsibility over personnel functions or functions that conflict with the equal employment functions, each Equal Employment Opportunity program manager at the facility level reports to the head of the Office of Resolution Management (ORM) with respect to equal employment functions, and the employment discrimination complaint resolution system requires any VA manager who receives a harassment or employment discrimination complaint to report such complaint to the ORM immediately (or within two business days of receiving the complaint if immediate reporting is impracticable). The VA must provide employees with mandatory annual training on identifying and addressing sexual harassment, other harassment, and employment discrimination, including with respect to processes under the VA's Harassment Prevention Program.The VA must regularly review the policies relating to sexual harassment, other harassment, and employment discrimination to ensure its policies are complete and in accordance with the policies established by the ORM. Additionally, the VA must issue a final directive and handbook for its Harassment Prevention Program."
        },
        {
            "Bill Number": "H.R. 707 (117th)",
            "First Name": "Ashley  Hinson",
            "Last Name": "cosponsor",
            "Role": "H.R. 707 (117th)",
            "Bill Name": "Ghost Army Congressional Gold Medal Act",
            "Subject Areas": "Military operations and strategy, Military personnel and dependents, Museums, exhibitions, cultural centers, Smithsonian Institution",
            "Summary": "This bill directs the Speaker of the House of Representatives and the President pro tempore of the Senate to award a Congressional Gold Medal to the 23rd Headquarters Special Troops and the 3133rd Signal Service Company, known as the Ghost Army, collectively, in recognition of its service during World War II."
        },
        {
            "Bill Number": "H.R. 1145 (117th)",
            "First Name": "Ashley  Hinson",
            "Last Name": "cosponsor",
            "Role": "H.R. 1145 (117th)",
            "Bill Name": "To direct the Secretary of State to develop a strategy to regain observer status for Taiwan in the World Health Organization, and for other purposes.",
            "Subject Areas": "International Affairs, Asia, Congressional oversight, International organizations and cooperation, Taiwan, World health",
            "Summary": "This bill directs the Department of State to include additional information in its annual reports concerning Taiwan's participation at the World Health Organization's World Health Assembly (WHA) as an observer. The report shall describe changes and improvements to the State Department's plan to support Taiwan's observer status at the WHA, following any meetings at which Taiwan did not participate under such status. (China has opposed Taiwan's participation in the WHA.)"
        },
        {
            "Bill Number": "H.R. 2252 (117th)",
            "First Name": "Ashley  Hinson",
            "Last Name": "cosponsor",
            "Role": "H.R. 2252 (117th)",
            "Bill Name": "Emmett Till and Mamie Till-Mobley Congressional Gold Medal Act of 2021",
            "Subject Areas": "Racial and ethnic relations, Smithsonian Institution, U.S. history",
            "Summary": "This bill provides for the posthumous presentation of a Congressional Gold Medal in commemoration of Emmett Till and Mamie Till-Mobley.After the award the medal shall be given to the National Museum of African American History and Culture."
        },
        {
            "Bill Number": "H.R. 1085 (117th)",
            "First Name": "Ashley  Hinson",
            "Last Name": "cosponsor",
            "Role": "H.R. 1085 (117th)",
            "Bill Name": "To award three congressional gold medals to the United States Capitol Police and those who protected the U.S. Capitol on January 6, 2021.",
            "Subject Areas": "Assault and harassment offenses, Congress, Congressional tributes, Crimes against property, District of Columbia, Government buildings, facilities, and property, Law enforcement officers, Museums, exhibitions, cultural centers, Protest and dissent, Smithsonian Institution, Subversive activities, Terrorism, U.S. Capitol, Violent crime",
            "Summary": "This bill directs the Speaker of the House and the President pro tempore of the Senate to arrange for the award of three Congressional Gold Medals to the U.S. Capitol Police (USCP) and other law enforcement agencies that protected the U.S. Capitol on January 6, 2021.Following the award of these medals, one medal shall be given to the USCP, one medal shall be given to the Metropolitan Police Department of the District of Columbia, and one medal shall be given to the Smithsonian Institution and displayed with a plaque listing all law enforcement agencies that participated in protecting the Capitol on January 6, 2021."
        },
        {
            "Bill Number": "H.R. 1799 (117th)",
            "First Name": "Ashley  Hinson",
            "Last Name": "cosponsor",
            "Role": "H.R. 1799 (117th)",
            "Bill Name": "PPP Extension Act of 2021",
            "Subject Areas": "Commerce, Business expenses, Cardiovascular and respiratory health, Emergency medical services and trauma care, Government lending and loan guarantees, Infectious and parasitic diseases, Small business, Wages and earnings",
            "Summary": "This bill extends the Paycheck Protection Program, established to support small businesses in response to COVID-19 (i.e., coronavirus disease 2019), through June 30, 2021. Currently, the program is set to expire on March 31, 2021.For the final 30 days of the program (i.e., from June 1 until June 30), the Small Business Administration may only process applications submitted prior to June 1, and it may not accept any new loan applications.The bill excludes the budgetary effects of this bill from PAYGO scorecards under the Statutory Pay-As-You-Go Act of 2010 and from Senate PAYGO scorecards."
        },
        {
            "Bill Number": "H.R. 1652 (117th)",
            "First Name": "Ashley  Hinson",
            "Last Name": "cosponsor",
            "Role": "H.R. 1652 (117th)",
            "Bill Name": "VOCA Fix to Sustain the Crime Victims Fund Act of 2021",
            "Subject Areas": "Crime and Law Enforcement, Civil actions and liability, Crime victims, Criminal investigation, prosecution, interrogation, Emergency medical services and trauma care, Government trust funds, Infectious and parasitic diseases, Law enforcement administration and funding, State and local government operations",
            "Summary": "This bill adds a new source of revenue for the Crime Victims Fund and makes changes to formula grants supported by the fund.Specifically, the bill directs revenues collected from deferred prosecution and non-prosecution agreements to be deposited into the Crime Victims Fund. Currently, such revenues are deposited into the general fund of the Treasury.Additionally, the bill increases the percentage—from 60% to 75%—of state compensation payments to crime victims in the prior fiscal year used to calculate formula grants for state victim compensation programs.Finally, the bill directs states to waive the matching requirement for recipients of state victim assistance formula grants during and for one year after a pandemic-related national emergency. It also allows states to waive the matching requirement pursuant to a policy established by the state."
        },
        {
            "Bill Number": "H.R. 1179 (117th)",
            "First Name": "Ashley  Hinson",
            "Last Name": "cosponsor",
            "Role": "H.R. 1179 (117th)",
            "Bill Name": "Iran Hostages Congressional Gold Medal Act",
            "Subject Areas": "International Affairs, Congressional tributes, Detention of persons, Diplomacy, foreign officials, Americans abroad, Iran, Middle East, Museums, exhibitions, cultural centers, Smithsonian Institution",
            "Summary": "This bill requires the Speaker of the House of Representatives and the President pro tempore of the Senate to arrange for the award of a Congressional Gold Medal commemorating the bravery and endurance of the 53 hostages of the Iran Hostage Crisis.Following its award, the medal shall be given to the National Museum of American History of the Smithsonian Institution for display and research.The Department of the Treasury must strike duplicate medals in silver for presentation to a hostage (or the personal representative of a deceased hostage), and Treasury may also strike and sell duplicate medals in bronze."
        },
        {
            "Bill Number": "H.R. 1012 (117th)",
            "First Name": "Ashley  Hinson",
            "Last Name": "cosponsor",
            "Role": "H.R. 1012 (117th)",
            "Bill Name": "\\u2018Six Triple Eight\\u2019 Congressional Gold Medal Act of 2021",
            "Subject Areas": "Military history, Military personnel and dependents, Minority employment, Museums, exhibitions, cultural centers, Postal service, Smithsonian Institution, Women's employment",
            "Summary": "This bill directs the Speaker of the House of Representatives and the President pro tempore of the Senate to arrange for the award of a Congressional Gold Medal in honor of the women of the 6888th Central Postal Directory Battalion (commonly known as the Six Triple Eight) in recognition of their pioneering military service, devotion to duty, and contributions to increase the morale of personnel stationed in the European theater of operations during World War II. The medal shall be given to the Smithsonian Institution and made available for display and research."
        },
        {
            "Bill Number": "H.R. 637 (117th)",
            "First Name": "Ashley  Hinson",
            "Last Name": "cosponsor",
            "Role": "H.R. 637 (117th)",
            "Bill Name": "Veterans Economic Recovery Act of 2021",
            "Subject Areas": "Education programs funding, Emergency medical services and trauma care, Employee hiring, Government information and archives, Government studies and investigations, Higher education, Housing and community development funding, Infectious and parasitic diseases, National Guard and reserves, Social work, volunteer service, charitable organizations, Student aid and college costs, Unemployment, Veterans' education, employment, rehabilitation, Vocational and technical education, Wages and earnings",
            "Summary": "This bill addresses the employment and retraining of veterans, specifically during the COVID-19 (i.e., coronavirus disease 2019) public health emergency.The bill requires the Department of Veterans Affairs (VA) to implement a program under which the VA must provide up to 12 months of nontransferable retraining assistance (including a housing stipend) to up to 35,000 eligible veterans for the pursuit of a specified program of education. Under the bill, an eligible veteran is an individual who, among other requirements, is unemployed due to COVID-19. Veterans who receive retraining assistance may only use such assistance to pursue specified programs, including those designed to provide training for high-demand occupations.The bill requires the Department of Labor to conduct outreach to veterans participating in the program to notify them of employment placement services and facilitate employment placement. Additionally, the VA must enter into a memorandum of understanding with one or more qualified nonprofit organizations to facilitate the employment of veterans participating in the program.The Government Accountability Office must report on the outcomes and effectiveness of the retraining assistance program.The program will terminate 21 months after the date of the enactment of this bill."
        },
        {
            "Bill Number": "H.R. 217 (117th)",
            "First Name": "Ashley  Hinson",
            "Last Name": "cosponsor",
            "Role": "H.R. 217 (117th)",
            "Bill Name": "Improving Confidence in Veterans\\u2019 Care Act",
            "Subject Areas": "Armed Forces and National Security, Accounting and auditing, Administrative remedies, Congressional oversight, Department of Veterans Affairs, Drug trafficking and controlled substances, Drug, alcohol, tobacco use, Employee hiring, Employee performance, Employment and training programs, Government employee pay, benefits, personnel management, Government studies and investigations, Health care quality, Health facilities and institutions, Health personnel, Licensing and registrations, Medical ethics, Personnel records, Prescription drugs, Public contracts and procurement, Veterans' medical care",
            "Summary": "This bill prescribes oversight requirements for the Department of Veterans Affairs (VA) regarding health care professionals at VA medical centers.Specifically, the bill requires the VA to ensure each VA medical center consistently compiles, verifies, and reviews specified documentation for each VA health care professional (including contractors).The VA shall ensure that specified health care professionals hold an active Drug Enforcement Administration registration.Each VA medical center must implement (1) monitoring of the performance and quality of the health care delivered by each health care professional at the center, and (2) reviews of such care if an individual notifies the VA of any potential concerns relating to a failure to meet generally accepted standards of clinical practice.The bill imposes notification requirements in situations where the VA substantiates a concern relating to the clinical competency of, or quality of care delivered by, a current or former VA health care professional.The VA is prohibited from entering into a settlement agreement relating to an adverse action against a VA health care professional if such agreement includes terms that require the VA to conceal certain information from the employee's personnel file. Such prohibition does not apply to adverse actions determined to be prohibited personnel practices.The VA must provide mandatory training, at least biannually, to employees of each medical center who are responsible for specified tasks (e.g., those who are responsible for compiling, validating, or reviewing the credentials of VA health care professionals)."
        },
        {
            "Bill Number": "H.R. 2954 (117th)",
            "First Name": "Ashley  Hinson",
            "Last Name": "cosponsor",
            "Role": "H.R. 2954 (117th)",
            "Bill Name": "Securing a Strong Retirement Act of 2021",
            "Subject Areas": "Labor and Employment, Administrative law and regulatory procedures, Bank accounts, deposits, capital, Banking and financial institutions regulation, Business records, Congressional oversight, Criminal procedure and sentencing, Department of Labor, Department of the Treasury, Disability and paralysis, Disability assistance, Drug trafficking and controlled substances, Employee benefits and pensions, Employment taxes, Financial services and investments, First responders and emergency personnel, Higher education, Income tax deferral, Income tax exclusion, Inflation and prices, Interest, dividends, interest rates, Life, casualty, property insurance, Military personnel and dependents, Sales and excise taxes, Securities, Small business, Student aid and college costs, Tax administration and collection, taxpayers, Wages and earnings",
            "Summary": "This bill makes various changes with respect to employer-sponsored retirement plans, including providing for the automatic enrollment of employees in certain plans and increasing the age at which participants are required to begin receiving mandatory distributions."
        },
        {
            "Bill Number": "H.R. 6251 (117th)",
            "First Name": "Ashley  Hinson",
            "Last Name": "cosponsor",
            "Role": "H.R. 6251 (117th)",
            "Bill Name": "Food Donation Improvement Act of 2021",
            "Subject Areas": "Agriculture and Food",
            "Summary": "This bill expands liability protections for the donation of food and grocery products.Specifically, the bill expands the liability protections to include donations of an apparently fit grocery product or apparently wholesome food for which the recipient is charged a good Samaritan reduced price that is no greater than the cost of handling, administering, and distributing the food or product; or that is donated directly to a needy individual by a retail grocer, wholesaler, agricultural producer, restaurant, caterer, school food authority, or institution of higher education. The Department of Agriculture must issue regulations that clarify the quality and labeling standards that food products donated under the Bill Emerson Good Samaritan Food Donation Act must meet to be eligible for liability protection."
        },
        {
            "Bill Number": "H.R. 4702 (117th)",
            "First Name": "Ashley  Hinson",
            "Last Name": "cosponsor",
            "Role": "H.R. 4702 (117th)",
            "Bill Name": "Military Spouse Tax Act",
            "Subject Areas": "Armed Forces and National Security, Housing finance and home ownership, Military personnel and dependents, Tax treatment of families",
            "Summary": "This bill provides that a spouse of a service member may retain their personal residence or domicile for purposes of taxation.The bill authorizes a service member and the spouse of the member to elect to use the following locations for purposes of taxation: the residence or domicile of the member, the residence or domicile of the spouse, or the permanent duty station of the member."
        },
        {
            "Bill Number": "H.R. 2441 (117th)",
            "First Name": "Ashley  Hinson",
            "Last Name": "cosponsor",
            "Role": "H.R. 2441 (117th)",
            "Bill Name": "Sgt. Ketchum Rural Veterans Mental Health Act of 2021",
            "Subject Areas": "Health facilities and institutions, Mental health, Rural conditions and development, Veterans' medical care",
            "Summary": "This bill requires the Department of Veterans Affairs (VA), during FY2022, to establish and maintain three new centers of the Rural Access Network for Growth Enhancement (RANGE) Program in areas with interest from personnel and a need for additional mental health care for rural veterans. The RANGE Program serves veterans in rural areas who are experiencing mental illness.The bill requires the Government Accountability Office to conduct a study and report on whether the VA has sufficient resources to serve rural veterans who need mental health care that is more intensive than traditional outpatient therapy."
        },
        {
            "Bill Number": "H.R. 2249 (117th)",
            "First Name": "Ashley  Hinson",
            "Last Name": "cosponsor",
            "Role": "H.R. 2249 (117th)",
            "Bill Name": "Willie O\\u2019Ree Congressional Gold Medal Act",
            "Subject Areas": "Racial and ethnic relations",
            "Summary": "This bill provides for the award of a Congressional Gold Medal to Willie O'Ree or, if unavailable, to a member of his family, in recognition of his contributions and commitment to hockey, inclusion, and recreational opportunity."
        },
        {
            "Bill Number": "H.R. 5141 (117th)",
            "First Name": "Ashley  Hinson",
            "Last Name": "cosponsor",
            "Role": "H.R. 5141 (117th)",
            "Bill Name": "Maximizing Outcomes through Better Investments in Lifesaving Equipment for (MOBILE) Health Care Act",
            "Subject Areas": "Health, Building construction, Dental care, Health care coverage and access, Health facilities and institutions, Health programs administration and funding, Health promotion and preventive care, Health technology, devices, supplies, Motor vehicles",
            "Summary": "This bill allows a health center that currently receives funding through a Health Resources & Services Administration Health Center Program grant to use a New Access Point grant to set up a mobile unit regardless of whether the health center also establishes a permanent health care delivery site.New Access Point grants help health centers establish new delivery sites to provide comprehensive primary care to medically underserved populations. Under current law, health centers may only use the grants to set up a mobile unit if they also establish a permanent site."
        }
    ],
    "VotingRecord": [
        {
            "Bill Number": "H.R. 3469 (117th)",
            "First Name": "Ashley Hinson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 346",
            "Bill Name": "NOTAM Improvement Act of 2023",
            "Summary": "This bill directs the Federal Aviation Administration (FAA) to establish the FAA Task Force on NOTAM (notice to air missions required by international or domestic law) Improvement and requires the FAA to implement a federal NOTAM system. A NOTAM is a notice containing information essential to personnel concerned with flight operations but not known far enough in advance to be publicized by other means. It states the abnormal status of a component of the National Airspace System.Specifically, the task force must (1) review existing methods for publishing NOTAMs and flight operations information for pilots; (2) review regulations, policies, systems, and international standards relating to NOTAMs, including their content and presentation to pilots; (3) evaluate and determine best practices to organize, prioritize, and present flight operations information in a manner that optimizes pilot review and retention of relevant information; (4) provide recommendations to improve the publication and delivery of NOTAM information; and (5) report to Congress on its reviews and evaluations.By September 30, 2024, the FAA must (1) complete implementation of a federal NOTAM system and implement a back-up system, and (2) brief Congress on a plan to enhance information delivery through this federal system to promote further global harmonization and provide users of the National Airspace System a consistent format for domestic and international operations.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3599 (117th)",
            "First Name": "Ashley Hinson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3599 (117th)",
            "Bill Name": "Federal Rotational Cyber Workforce Program Act of 2021",
            "Summary": "This bill establishes a rotational cyber workforce program under which certain federal employees may be detailed among rotational cyber workforce positions at other agencies.This bill authorizes an agency to determine whether a workforce position involving information technology, cybersecurity, or other cyber-related functions in that agency is eligible for the program.Additionally, the bill requires the Office of Personnel Management to issue a Federal Rotational Cyber Workforce Program operation plan providing policies, processes, and procedures for detailing employees among rotational cyber workforce positions at agencies.The Government Accountability Office must assess the operation and effectiveness of the rotational cyber workforce program by addressing the extent to which agencies have participated in the program and the experiences of employees serving in the program.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 2670",
            "First Name": "Ashley Hinson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 2670",
            "Bill Name": "National Defense Authorization Act for Fiscal Year 2024",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 4881 (117th)",
            "First Name": "Ashley Hinson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 4881 (117th)",
            "Bill Name": "Old Pascua Community Land Acquisition Act",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 2225 (117th)",
            "First Name": "Ashley Hinson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 2225 (117th)",
            "Bill Name": "National Science Foundation for the Future Act",
            "Summary": "This bill reauthorizes the National Science Foundation (NSF) through FY2026 and authorizes programs and activities at the NSF.The bill establishes requirements for the NSF, including to enter into a contract with the National Academies of Science, Engineering, and Medicine to assess the status and opportunities for Pre-K through 12 science, technology, engineering, and mathematics, including computer science, (STEM) education research; award grants to establish no fewer than three multidisciplinary Centers for Transformative Education Research and Translation to support research and development of STEM education innovations; provide grants for research on programming that engages students in grades Pre-K through 8, including underrepresented and rural students, in STEM in order to prepare such students to pursue degrees or careers in STEM; award grants to support research and development activities to encourage greater collaboration and coordination between institutions of higher education and industry to enhance education, foster hands-on learning experiences, and improve alignment with workforce needs; award grants to establish a network of centers for science and technical education; award grants to advance research on the nature of learning and teaching at community colleges; award grants to establish traineeship programs for graduate students who pursue artificial intelligence-related research leading to a masters or doctorate degree; award grants to carry out research on the cyber workforce; establish a cybersecurity workforce data initiative; carry out a national initiative to facilitate the development of networks and partnerships to broaden participation in STEM studies and careers of groups historically underrepresented in such studies and careers; maintain a Research Security and Policy office to coordinate all research security policy issues across the NSF; award grants to support research to improve our understanding of the climate system and related human and environmental systems; support research to significantly advance our understanding of the food-energy-water system; award grants to advance knowledge of risk assessment and predictability to improve our ability to predict extreme events and natural hazards, including pandemics; and award grants to support basic research that will accelerate innovation to advance critical minerals mining strategies and technologies. The bill also establishes within the NSF a Directorate for Science and Engineering Solutions to advance research and development solutions to address societal and national challenges.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 390 (117th)",
            "First Name": "Ashley Hinson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 390 (117th)",
            "Bill Name": "To redesignate the Federal building located at 167 North Main Street in Memphis, Tennessee as the \\u201cOdell Horton Federal Building\\u201d.",
            "Summary": "This bill designates the federal building at 167 North Main Street in Memphis, Tennessee (commonly known as the Clifford Davis and Odell Horton Federal Building), as the Odell Horton Federal Building.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 4368",
            "First Name": "Ashley Hinson",
            "Vote": "Nay",
            "Bill Number.1": "H.R. 4368",
            "Bill Name": "Agriculture, Rural Development, Food and Drug Administration, and Related Agencies Appropriations Act, 2024",
            "Summary": "This bill provides FY2024 appropriations for the Department of Agriculture (USDA), the Food and Drug Administration, and related agencies.The bill provides appropriations to USDA for agricultural programs, including the Office of the Secretary, Executive Operations, the Economic Research Service, the National Agricultural Statistics Service, the Agricultural Research Service, the National Institute of Food and Agriculture, the Animal and Plant Health Inspection Service, the Agricultural Marketing Service, and the Food Safety and Inspection Service. The bill also provides appropriations to USDA for farm production and conservation programs, including the Farm Production and Conservation Business Center, the Farm Service Agency, the Risk Management Agency, and the Natural Resources Conservation Service. The bill provides appropriations to the Federal Crop Insurance Corporation Fund and the Commodity Credit Corporation Fund.For USDA rural development programs, the bill includes appropriations forSalaries and Expenses, the Rural Housing Service, the Rural Business-Cooperative Service, and the Rural Utilities Service. The bill provides appropriations to the Food and Nutrition Service for Child Nutrition Programs; the Special Supplemental Nutrition Program for Women, Infants, and Children (WIC); the Supplemental Nutrition Assistance Program (SNAP); the Commodity Assistance Program; and Nutrition Programs Administration. The bill provides appropriations to the Foreign Agricultural Service for (1) Food for Peace Title II Grants, and (2) McGovern-Dole International Food for Education and Child Nutrition Program Grants.The bill also provides appropriations for the Food and Drug Administration, the Commodity Futures Trading Commission, and the Farm Credit Administration. Additionally, the bill sets forth requirements and restrictions for using funds provided by this and other appropriations acts.",
            "Status": "Failed"
        },
        {
            "Bill Number": "H.R. 2662 (117th)",
            "First Name": "Ashley Hinson",
            "Vote": "Nay",
            "Bill Number.1": "H.R. 2662 (117th)",
            "Bill Name": "Inspector General Independence and Empowerment Act of 2021",
            "Summary": "This bill addresses issues regarding inspectors general (IGs) and the Council of the Inspectors General on Integrity and Efficiency (CIGIE) Integrity Committee. The committee is charged with investigating allegations of wrongdoing against office of IG officials.The bill allows an IG to be removed only for cause, such as for documented malfeasance. Congress must be notified before an IG is placed on nonduty status. The bill requires the President to explain any failure to nominate an IG and adds provisions regarding acting IGs when an IG position is vacant.The committee must notify Congress when an allegation of wrongdoing made by a Member of Congress is closed without referral for investigation.The bill requires CIGIE to report semiannually to Congress and the President on the activities of the committee. The bill adds provisions regarding appointment of former IGs to the committee. An IG must refer to the committee any allegation of wrongdoing against that IG.The bill grants (1) IGs the authority to subpoena witnesses who are not currently government employees, and (2) the Department of Justice (DOJ) IG the authority to investigate wrongdoing by DOJ attorneys.The bill requires notification to Congress of an IG's ongoing investigations when the IG is placed on nonduty status.IGs must notify Congress if agencies deny access to requested information.The bill requires the establishment of minimum standards and best practices for IG training.The Government Accountability Office shall review the effectiveness of the processes of the CIGIE committee and of the offices of IGs for ensuring IG accountability, integrity, and independence.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3508 (117th)",
            "First Name": "Ashley Hinson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3508 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 39 West Main Street, in Honeoye Falls, New York, as the \\u201cCW4 Christian J. Koch Memorial Post Office\\u201d.",
            "Summary": "This bill designates the facility of the United States Postal Service located at 39 West Main Street, in Honeoye Falls, New York, as the CW4 Christian J. Koch Memorial Post Office.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3531 (117th)",
            "First Name": "Ashley Hinson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3531 (117th)",
            "Bill Name": "Women Who Worked on the Home Front World War II Memorial Act",
            "Summary": "This bill authorizes the Women Who Worked on the Home Front Foundation to establish a commemorative work on federal land in the District of Columbia in commemoration of the commitment and service represented by women who worked on the home front during World War II.The foundation shall be solely responsible for the acceptance of contributions for, and payment of the expenses of, establishing the commemorative work.The establishment of the commemorative work shall be in accordance with the Commemorative Works Act.The bill prohibits federal funds from being used to pay any expense for the establishment of the commemorative work.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 567 (117th)",
            "First Name": "Ashley Hinson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 567 (117th)",
            "Bill Name": "Trans-Sahara Counterterrorism Partnership Program Act of 2021",
            "Summary": "This bill provides statutory authority for the Trans-Sahara Counterterrorism Partnership Program, an interagency program launched in 2005 to partner with countries in the Sahel and Maghreb regions of Africa to counter terrorism and violent extremism.The Department of State, in consultation with the Department of Defense and the U.S. Agency for International Development, shall establish the partnership program, which must coordinate all U.S. programs in North and West Africa related to various counterterrorism activities, such as building foreign-military capacity, enhancing border security, promoting youth employment, and supporting independent media to counter terrorist propaganda.The State Department must submit comprehensive, five-year strategies that include specified activities for the Sahel and Maghreb regions and for program counterterrorism efforts. Further, program activities must, among other things (1) be carried out in countries where there is an adequate level of partner country committment, and (2) have clearly defined outcomes and specific plans with indicators to regularly monitor and evaluate outcomes and impact. Such activities must also take into account the counterterrorism and development strategies of partner countries and align with such strategies to the extent possible.The State Department shall notify Congress before obligating funds for such programs, and must submit annual reports about program activities.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 4233",
            "First Name": "Ashley Hinson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 423",
            "Bill Name": "Pala Band of Mission Indians Land Transfer Act of 2023",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1917 (117th)",
            "First Name": "Ashley Hinson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1917 (117th)",
            "Bill Name": "Hazard Eligibility and Local Projects Act",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3325 (117th)",
            "First Name": "Ashley Hinson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3325 (117th)",
            "Bill Name": "To award four congressional gold medals to the United States Capitol Police and those who protected the U.S. Capitol on January 6, 2021.",
            "Summary": "This bill provides for the award of Congressional Gold Medals to the U.S. Capitol Police and the Metropolitan Police Department of the District of Columbia in recognition of the law enforcement agencies that protected the U.S. Capitol on January 6, 2021.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 5574 (117th)",
            "First Name": "Ashley Hinson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 5574 (117th)",
            "Bill Name": "TRANSLATE ACT",
            "Summary": "This bill directs the Transportation Security Administration (TSA) to develop a plan to ensure that TSA material disseminated in major airports is better understood by people accessing such airports, including by foreign language speakers and people with vision or hearing impairments.In developing the plan, the TSA must take into consideration data regarding international enplanement and local populations surrounding major airports.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3616 (117th)",
            "First Name": "Ashley Hinson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3616 (117th)",
            "Bill Name": "Bear River National Heritage Area Study Act",
            "Summary": "This bill directs the Department of the Interior to conduct a study to assess the suitability and feasibility of designating the study area, including areas in Utah and Idaho that are within the main drainage area of the Bear River, as a National Heritage Area, to be known as the Bear River National Heritage Area.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 2882",
            "First Name": "Ashley Hinson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 2882",
            "Bill Name": "Further Consolidated Appropriations Act, 2024",
            "Summary": "This bill provides FY2024 appropriations for several federal departments and agencies. It also extends various expiring programs and authorities. Specifically, the bill includes 6 of the 12 regular FY2024 appropriations bills: the Department of Defense Appropriations Act, 2024; the Financial Services and General Government Appropriations Act, 2024; the Department of Homeland Security Appropriations Act, 2024; the Departments of Labor, Health and Human Services, and Education, and Related Agencies Appropriations Act, 2024; the Legislative Branch Appropriations Act, 2024; and the Department of State, Foreign Operations, and Related Programs Appropriations Act, 2024. The departments, agencies, and activities funded in the bill include the military activities of the Department of Defense, the Department of the Treasury, the Executive Office of the President, the judiciary, federal payments to the District of Columbia, the Department of Homeland Security, the Department of Labor, the Department of Health and Human Services, the Department of Education, Congress and the agencies that serve Congress, the Department of State, and several related and independent agencies. In addition, the bill extends various programs and authorities, including the National Flood Insurance Program, the Morris K. Udall and Stewart L. Udall Foundation Trust Fund, and several authorities and programs related to immigration.The bill also prohibits State Department funds from being used to make payments to the U.N. Relief and Works Agency until March 25, 2025.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3843 (117th)",
            "First Name": "Ashley Hinson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3843 (117th)",
            "Bill Name": "Merger Filing Fee Modernization Act of 2022",
            "Summary": "This bill modifies and expands the schedule for graduated merger filing fees and requires that such fees be adjusted each year based on the Consumer Price Index. It also (1) requires parties to disclose in their premerger notification filings any subsidy received from a foreign entity of concern, (2) modifies the venue rules for multi-district antitrust litigation, and (3) establishes various reporting requirements.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3537 (117th)",
            "First Name": "Ashley Hinson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3537 (117th)",
            "Bill Name": "Accelerating Access to Critical Therapies for ALS Act",
            "Summary": "This bill establishes grant programs to address neurodegenerative diseases, such as amyotrophic lateral sclerosis (also known as ALS or Lou Gehrig's disease), and contains other related provisions.The Department of Health and Human Services (HHS) shall award grants to eligible entities for scientific research utilizing data from expanded access to investigational ALS treatments for individuals who are not otherwise eligible for clinical trials. The Food and Drug Administration (FDA) shall award grants to public and private entities to cover the costs of research and development of drugs that diagnose or treat ALS and other rare neurodegenerative diseases.HHS shall also establish the Public-Private Partnership for Neurodegenerative Diseases between the National Institutes of Health, the FDA, and at least one eligible entity (generally, an institution of higher education or a nonprofit organization). The partnership shall support the development and regulatory review of drugs that address ALS and other rare neurodegenerative diseases.The FDA shall publish on its website a five-year action plan for fostering the development of drugs that improve or extend the lives of people living with rare neurodegenerative diseases.The Government Accountability Office must report to Congress about the grants provided under this bill, including an analysis of the impact of such grants on research and development of treatments for ALS.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 4821",
            "First Name": "Ashley Hinson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 4821",
            "Bill Name": "Department of the Interior, Environment, and Related Agencies Appropriations Act, 2024",
            "Summary": "This bill provides FY2024 appropriations for the Department of the Interior, the Environmental Protection Agency (EPA), and several related agencies.The bill provides appropriations to Interior for the Bureau of Land Management, the U.S. Fish and Wildlife Service, the National Park Service, the U.S. Geological Survey, the Bureau of Ocean Energy Management, the Bureau of Safety and Environmental Enforcement, the Office of Surface Mining Reclamation and Enforcement, the Bureau of Indian Affairs, the Bureau of Indian Education, the Bureau of Trust Funds Administration, Departmental Offices, and Department-Wide Programs. The bill also provides appropriations to the EPA and the Forest Service.Within the Department of Health and Human Services, the bill provides appropriations for the Indian Health Service, the National Institute of Environmental Health Sciences, and the Agency for Toxic Substances and Disease Registry. The bill provides appropriations to several related agencies, including the Council on Environmental Quality and Office of Environmental Quality, the Chemical Safety and Hazard Investigation Board, the Office of Navajo and Hopi Indian Relocation, the Institute of American Indian and Alaska Native Culture and Arts Development, the Smithsonian Institution, the National Gallery of Art, the John F. Kennedy Center for the Performing Arts, the Woodrow Wilson International Center for Scholars, the National Endowment for the Arts, the National Endowment for the Humanities, the Commission of Fine Arts, the Advisory Council on Historic Preservation. the National Capital Planning Commission, the U.S. Holocaust Memorial Museum, the World War I Centennial Commission, and the U.S. Semiquincentennial Commission. Additionally, the bill sets forth requirements and restrictions for using funds provided by this and other appropriations acts.",
            "Status": "Enacted"
        }
    ]
}