{
    "Name": "Bennie Thompson",
    "Profile": {
        "Public Office": {
            "Ranking Member of the House Homeland Security Committee": {
                "Incumbent": "Incumbent",
                "Assumed office": "January 3, 2023",
                "Preceded by": "Jim Turner",
                "In office": "January 3, 2005 – January 3, 2007",
                "Succeeded by": "Peter King"
            },
            "Chair of the House January 6th Committee": {
                "In office": "July 1, 2021 – January 3, 2023",
                "Preceded by": "Position established",
                "Succeeded by": "Position abolished"
            },
            "Chair of the House Homeland Security Committee": {
                "In office": "January 3, 2007 – January 3, 2011",
                "Preceded by": "Peter King",
                "Succeeded by": "Peter King"
            },
            "Member of the U.S. House of Representativesfrom Mississippi's 2nd district": {
                "Incumbent": "Incumbent",
                "Assumed office": "April 13, 1993",
                "Preceded by": "Mike Espy",
                "District Info": {
                    "Median householdincome": "",
                    "Distribution": "",
                    "Population": "",
                    "Ethnicity": ""
                }
            }
        },
        "Personal Details": {
            "Personal details": {
                "Born": "Bennie Gordon Thompson, (,1948-01-28,) ,January 28, 1948, (age 75),Bolton, Mississippi,, U.S.",
                "Political party": "Democratic",
                "Spouse": "London Johnson, ,,(,m., 1968),",
                "Children": "1",
                "Education": "Tougaloo College, (,BA,),Jackson State University, (,MS,)",
                "Signature": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c0/Bennie_Thompson_signature.svg/128px-Bennie_Thompson_signature.svg.png",
                "Website": "House website"
            }
        }
    },
    "UnusedVotingRecords": [
        {
            "Bill Number": "H.R. 2911 (117th)",
            "First Name": "Bennie Thompson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 2911 (117th)",
            "Bill Name": "VA Transparency & Trust Act of 2021",
            "Summary": "This bill requires the Department of Veterans Affairs (VA) to submit a plan for obligating and expending covered funds, which are funds made available to the VA for response to the COVID-19 pandemic.The bill requires the VA to submit biweekly reports regarding obligations, expenditures, and planned uses of the funds until seven days after the VA has expended all covered funds.The Inspector General of the VA must submit reports examining the obligations and expenditures made using covered funds during the specified reporting period.Finally, the Government Accountability Office must submit an interim report and final report containing a review of obligations and expenditures made using covered funds.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 92 (117th)",
            "First Name": "Bennie Thompson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 92 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 110 Johnson Street in Pickens, South Carolina, as the \\u201cSpecialist Four Charles Johnson Post Office\\u201d.",
            "Summary": "This bill designates the facility of the United States Postal Service located at 110 Johnson Street in Pickens, South Carolina, as the Specialist Four Charles Johnson Post Office.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 91 (117th)",
            "First Name": "Bennie Thompson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 91 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 810 South Pendleton Street in Easley, South Carolina, as the \\u201cPrivate First Class Barrett Lyle Austin Post Office Building\\u201d.",
            "Summary": "This bill designates the facility of the United States Postal Service located at 810 South Pendleton Street in Easley, South Carolina, as the Private First Class Barrett Lyle Austin Post Office Building.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1096",
            "First Name": "Bennie Thompson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1096",
            "Bill Name": "250th Anniversary of the United States Marine Corps Commemorative Coin Act",
            "Summary": "This bill directs the Department of the Treasury to mint and issue not more than 50,000 $5 gold coins, 400,000 $1 silver coins, and 750,000 half-dollar clad coins emblematic of the 250th anniversary of the United States Marine Corps.All surcharges received by Treasury from the sale of such coins must be paid to the Marine Corps Heritage Foundation and shall only be used for the purposes of supporting the mission of the Marine Corps Heritage Center.",
            "Status": "Enacted",
            "Democrat_Yea": 0.9528301886792452,
            "Democrat_Nay": 0.0,
            "Republican_Yea": 0.9366515837104072,
            "Republican_Nay": 0.004524886877828
        },
        {
            "Bill Number": "H.R. 6386 (117th)",
            "First Name": "Bennie Thompson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 6386 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 450 West Schaumburg Road in Schaumburg, Illinois, as the \\u201cVeterans of Iraq and Afghanistan Memorial Post Office Building\\u201d.",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 700 (117th)",
            "First Name": "Bennie Thompson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 700 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 303 East Mississippi Avenue in Elwood, Illinois, as the \\u201cLawrence M. \\u2018Larry\\u2019 Walsh Sr. Post Office\\u201d.",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 5900 (117th)",
            "First Name": "Bennie Thompson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 5900 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 2016 East 1st Street in Los Angeles, California, as the \\u201cMarine Corps Reserve PVT Jacob Cruz Post Office\\u201d.",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 224 (117th)",
            "First Name": "Bennie Thompson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 224 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 5302 Galveston Road in Houston, Texas, as the Vanessa Guill\\u00e9n Post Office Building.",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1437 (117th)",
            "First Name": "Bennie Thompson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1437 (117th)",
            "Bill Name": "Further Continuing Appropriations and Extensions Act, 2023",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 7077 (117th)",
            "First Name": "Bennie Thompson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 7077 (117th)",
            "Bill Name": "Empowering the U.S. Fire Administration Act",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 935 (117th)",
            "First Name": "Bennie Thompson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 935 (117th)",
            "Bill Name": "Small Business Mergers, Acquisitions, Sales, and Brokerage Simplification Act of 2021",
            "Summary": "This bill exempts from securities registration requirements certain merger-and-acquisition brokers that facilitate transfer of ownership in privately held companies with earnings or revenues under a specified threshold. However, this exemption shall not apply to certain brokers, including those that provide financing related to the transfer of ownership, engage on behalf of any party in a transaction involving specified shell companies, or have been barred or suspended from association with a broker or dealer.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3672",
            "First Name": "Bennie Thompson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3672",
            "Bill Name": "To designate the clinic of the Department of Veterans Affairs in Indian River, Michigan, as the \\u201cPfc. Justin T. Paton Department of Veterans Affairs Clinic\\u201d.",
            "Summary": NaN,
            "Status": "Enacted",
            "Democrat_Yea": 0.9386792452830188,
            "Democrat_Nay": 0.0,
            "Republican_Yea": 0.9502262443438914,
            "Republican_Nay": 0.0
        },
        {
            "Bill Number": "H.R. 1899 (117th)",
            "First Name": "Bennie Thompson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1899 (117th)",
            "Bill Name": "Ensuring Compliance Against Drug Diversion Act of 2021",
            "Summary": "This bill provides statutory authority for certain regulations governing the modification, transfer, and termination of a registration to manufacture, distribute, or dispense controlled substances. It terminates the registration of individuals and entities when they die, cease legal existence, discontinue business, or surrender such registration. It sets forth notification requirements, as well as conditions for transferring or assigning a registration.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1762 (117th)",
            "First Name": "Bennie Thompson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1762 (117th)",
            "Bill Name": "Protecting Indian Tribes from Scams Act",
            "Summary": "This bill requires the Federal Trade Commission (FTC), after consultation with Indian tribes, to report on unfair or deceptive practices that target tribes or tribal members. The FTC must submit the report to Congress and make it publicly available. Further, the FTC must update its website to include information for consumers and businesses on identifying and avoiding unfair or deceptive practices that target tribes or tribal members.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1002 (117th)",
            "First Name": "Bennie Thompson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1002 (117th)",
            "Bill Name": "DEBAR Act of 2021",
            "Summary": "This bill authorizes the Drug Enforcement Administration (DEA) to bar an entity from registering to manufacture, distribute, or dispense controlled substances under certain circumstances.Specifically, the DEA may bar—temporarily or permanently—the registration of an entity that (1) meets or has met any condition for suspension or revocation of the registration, and (2) has a history of prior suspensions or revocations.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 941 (117th)",
            "First Name": "Bennie Thompson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 941 (117th)",
            "Bill Name": "TRANSPLANT Act of 2021",
            "Summary": "This bill modifies and reauthorizes through FY2026 the C.W. Bill Young Cell Transplantation Program, which provides support to patients who need a potentially life-saving bone marrow transplant or umbilical cord blood transplant.The bill also requires the Department of Health and Human Services to conduct a periodic review of the science of using adult stem cells and birthing tissues in therapeutic treatments.In addition, the Government Accountability Office must report on the regenerative medicine workforce.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1460 (117th)",
            "First Name": "Bennie Thompson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1460 (117th)",
            "Bill Name": "Nicholas and Zachary Burt Memorial Carbon Monoxide Poisoning Prevention Act of 2021",
            "Summary": "This bill directs the Consumer Product Safety Commission to award grants to states and tribal organizations to install carbon monoxide alarms in the homes of low-income families and older adults and facilities that commonly serve children or older adults. Such carbon monoxide alarms must comply with specified standards.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1215 (117th)",
            "First Name": "Bennie Thompson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1215 (117th)",
            "Bill Name": "Fraud and Scam Reduction Act",
            "Summary": "This bill expands activities to address mail, telephone, and internet fraud, particularly such scams targeting older adults.The bill establishes a Senior Scams Prevention Advisory Group, which must create model educational materials to educate employees of retailers, financial-services companies, and wire-transfer companies on how to identify and prevent scams that affect older adults.Further, the Federal Trade Commission (FTC) must establish an advisory office in the Bureau of Consumer Protection to assist the FTC in monitoring scams targeting older adults, educating consumers, and receiving complaints.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 172 (117th)",
            "First Name": "Bennie Thompson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 172 (117th)",
            "Bill Name": "United States Anti-Doping Agency Reauthorization Act of 2021",
            "Summary": "This bill authorizes appropriations for the U.S. Anti-Doping Agency (USADA) through FY2030.The bill adds requirements that USADA be responsible for certifying in advance any testing conducted by international organizations under the World Anti-Doping Code for international amateur athletes and athletic competitions occurring within the jurisdiction of the United States; and promote a positive youth sport experience by using a portion of its funding to provide educational materials on sportsmanship, character building, and healthy performance for those participating in youth sports. The bill requires any action taken by USADA to enforce a policy, procedure, or requirement against a person with respect to a violation of federal law, including an investigation, disciplinary action, sanction, or any other administrative action, to be carried out in a manner that provides due process protection.The Department of Justice, the Department of Homeland Security, and the Food and Drug Administration must provide to USADA information relating to the prevention of the use of performance-enhancing drugs or the prohibition of performance-enhancing methods.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1868 (117th)",
            "First Name": "Bennie Thompson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1868 (117th)",
            "Bill Name": "To prevent across-the-board direct spending cuts, and for other purposes.",
            "Summary": "This bill makes several budgetary and technical changes to provisions under Medicare and Medicaid. The bill continues to exempt Medicare from sequestration until December 31, 2021. (Sequestration is a process of automatic, usually across-the-board spending reductions under which budgetary resources are permanently cancelled to enforce specific budget policy goals.)The bill also specifically applies certain modified payment limits to rural health clinics that temporarily enrolled in Medicare during the public health emergency relating to COVID-19 (i.e., coronavirus disease 2019) or that applied to enroll by December 31, 2020; and preserves higher Medicaid disproportionate-share hospital payments for public hospitals in California under forthcoming payment methodology changes.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1868 (117th)",
            "First Name": "Bennie Thompson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1868 (117th)",
            "Bill Name": "To prevent across-the-board direct spending cuts, and for other purposes.",
            "Summary": "This bill makes several budgetary and technical changes to provisions under Medicare and Medicaid. The bill continues to exempt Medicare from sequestration until December 31, 2021. (Sequestration is a process of automatic, usually across-the-board spending reductions under which budgetary resources are permanently cancelled to enforce specific budget policy goals.)The bill also specifically applies certain modified payment limits to rural health clinics that temporarily enrolled in Medicare during the public health emergency relating to COVID-19 (i.e., coronavirus disease 2019) or that applied to enroll by December 31, 2020; and preserves higher Medicaid disproportionate-share hospital payments for public hospitals in California under forthcoming payment methodology changes.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3746",
            "First Name": "Bennie Thompson",
            "Vote": "Aye",
            "Bill Number.1": "H.R. 3746",
            "Bill Name": "Fiscal Responsibility Act of 2023",
            "Summary": NaN,
            "Status": "Enacted",
            "Democrat_Yea": 0.9166666666666666,
            "Democrat_Nay": 0.0833333333333333,
            "Republican_Yea": 0.3469387755102041,
            "Republican_Nay": 0.6326530612244898
        },
        {
            "Bill Number": "H.R. 7276 (117th)",
            "First Name": "Bennie Thompson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 7276 (117th)",
            "Bill Name": "Ukraine Invasion War Crimes Deterrence and Accountability Act",
            "Summary": "This bill requires the President to report to Congress on atrocities committed during Russia's invasion of Ukraine since February 24, 2022.Specifically, the report must describe in detail (1) U.S. government efforts to collect, analyze, and preserve evidence related to war crimes and other atrocities committed during the invasion; (2) media, public diplomacy, and information operations to make the Russian people, including their military and political leaders, aware of efforts to identify and prosecute those responsible for such atrocities; and (3) the process for a domestic, foreign, or international court or tribunal to obtain information from the U.S. government related to such atrocities.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1652 (117th)",
            "First Name": "Bennie Thompson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1652 (117th)",
            "Bill Name": "VOCA Fix to Sustain the Crime Victims Fund Act of 2021",
            "Summary": "This bill adds a new source of revenue for the Crime Victims Fund and makes changes to formula grants supported by the fund.Specifically, the bill directs revenues collected from deferred prosecution and non-prosecution agreements to be deposited into the Crime Victims Fund. Currently, such revenues are deposited into the general fund of the Treasury.Additionally, the bill increases the percentage—from 60% to 75%—of state compensation payments to crime victims in the prior fiscal year used to calculate formula grants for state victim compensation programs.Finally, the bill directs states to waive the matching requirement for recipients of state victim assistance formula grants during and for one year after a pandemic-related national emergency. It also allows states to waive the matching requirement pursuant to a policy established by the state.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1085 (117th)",
            "First Name": "Bennie Thompson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1085 (117th)",
            "Bill Name": "To award three congressional gold medals to the United States Capitol Police and those who protected the U.S. Capitol on January 6, 2021.",
            "Summary": "This bill directs the Speaker of the House and the President pro tempore of the Senate to arrange for the award of three Congressional Gold Medals to the U.S. Capitol Police (USCP) and other law enforcement agencies that protected the U.S. Capitol on January 6, 2021.Following the award of these medals, one medal shall be given to the USCP, one medal shall be given to the Metropolitan Police Department of the District of Columbia, and one medal shall be given to the Smithsonian Institution and displayed with a plaque listing all law enforcement agencies that participated in protecting the Capitol on January 6, 2021.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1651 (117th)",
            "First Name": "Bennie Thompson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1651 (117th)",
            "Bill Name": "COVID-19 Bankruptcy Relief Extension Act of 2021",
            "Summary": "This bill extends existing provisions that provide relief to debtors in bankruptcy, including those related to the COVID-19 (i.e., coronavirus disease 2019) pandemic.These provisions (1) exclude certain COVID-19 aid payments from income for the purposes of bankruptcy, and (2) increase the debt eligibility threshold for businesses qualifying for certain types of Chapter 11 reorganization bankruptcy. Currently, these provisions expire March 27, 2021. The bill extends these provisions for one year.The bill also allows for modification of a Chapter 13 repayment plan for plans confirmed before the date of enactment of this bill if the debtor is experiencing material financial hardship due to COVID-19. Currently, such a modification is only available for plans confirmed before March 27, 2020.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1799 (117th)",
            "First Name": "Bennie Thompson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1799 (117th)",
            "Bill Name": "PPP Extension Act of 2021",
            "Summary": "This bill extends the Paycheck Protection Program, established to support small businesses in response to COVID-19 (i.e., coronavirus disease 2019), through June 30, 2021. Currently, the program is set to expire on March 31, 2021.For the final 30 days of the program (i.e., from June 1 until June 30), the Small Business Administration may only process applications submitted prior to June 1, and it may not accept any new loan applications.The bill excludes the budgetary effects of this bill from PAYGO scorecards under the Statutory Pay-As-You-Go Act of 2010 and from Senate PAYGO scorecards.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1218 (117th)",
            "First Name": "Bennie Thompson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1218 (117th)",
            "Bill Name": "Data Mapping to Save Moms\\u2019 Lives Act",
            "Summary": "This bill directs the Federal Communications Commission (FCC) to include data on certain maternal health outcomes in its broadband health mapping tool. This is an online platform that allows users to visualize, overlay, and analyze broadband and health data at national, state, and county levels.The FCC must consult with the Centers for Disease Control and Prevention to determine which maternal health outcomes should be incorporated.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1319 (117th)",
            "First Name": "Bennie Thompson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1319 (117th)",
            "Bill Name": "American Rescue Plan Act of 2021",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 6833 (117th)",
            "First Name": "Bennie Thompson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 6833 (117th)",
            "Bill Name": "Continuing Appropriations and Ukraine Supplemental Appropriations Act, 2023",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1734",
            "First Name": "Bennie Thompson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1734",
            "Bill Name": "TRANQ Research Act of 2023",
            "Summary": "This bill requires the National Institute of Standards and Technology (NIST) to support research and other activities related to identifying xylazine (a compound used in veterinary medicine as a nonopioid tranquilizer), novel synthetic opioids, and other new psychoactive substances.In particular, NIST must support basic measurement science and research; near-real time spectrometry capabilities (i.e., a technique for rapidly identifying the chemical composition of a substance); strategies and voluntary best practices for handling, transporting, and analyzing such substances; and collaboration with other government agencies, institutions of higher education, and the private sector to enhance relevant narcotic and opioid detection and analysis capabilities. Additionally, the Government Accountability Office must conduct a study on the capabilities of the federal government to detect, identify, and otherwise respond to threats of new psychoactive substances, such as xylazine.",
            "Status": "Enacted",
            "Democrat_Yea": 0.9671361502347418,
            "Democrat_Nay": 0.0,
            "Republican_Yea": 0.9864864864864864,
            "Republican_Nay": 0.0
        },
        {
            "Bill Number": "H.R. 2954 (117th)",
            "First Name": "Bennie Thompson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 2954 (117th)",
            "Bill Name": "Securing a Strong Retirement Act of 2021",
            "Summary": "This bill makes various changes with respect to employer-sponsored retirement plans, including providing for the automatic enrollment of employees in certain plans and increasing the age at which participants are required to begin receiving mandatory distributions.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3359 (117th)",
            "First Name": "Bennie Thompson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3359 (117th)",
            "Bill Name": "Homicide Victims\\u2019 Families\\u2019 Rights Act of 2021",
            "Summary": "This bill establishes a framework for immediate family members of a victim of murder under federal law to request a review of the victim's case file if the murder was committed more than three years prior, the murder was investigated by a federal law enforcement entity, all probative investigative leads have been exhausted, and no likely perpetrator has been identified.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3197 (117th)",
            "First Name": "Bennie Thompson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3197 (117th)",
            "Bill Name": "Save the Liberty Theatre Act of 2021",
            "Summary": NaN,
            "Status": NaN
        },
        {
            "Bill Number": "H.R. 3113 (117th)",
            "First Name": "Bennie Thompson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3113 (117th)",
            "Bill Name": "Modernizing Access to Our Public Land Act",
            "Summary": "This bill directs the Department of the Interior, the Forest Service, and the U.S. Army Corps of Engineers to jointly develop and adopt interagency standards to ensure compatibility and interoperability among federal databases for the collection and dissemination of outdoor recreation data related to federal lands and used to depict locations at which recreation uses are available to the public.Interior, the Forest Service, and the Corps of Engineers must digitize and publish geographic information system data that includes federal interests, including easements and rights-of-way, in private land; status information as to whether roads and trails are open or closed; the dates on which roads and trails are seasonally opened and closed; the types of vehicles and recreational uses that are allowed on each segment of roads and trails; and the boundaries of areas where hunting or recreational shooting is permanently restricted or closed. Interior, the Forest Service, and the Corps of Engineers may work with the U.S. Geological Survey to collect, digitize, standardize, or publish data to meet the requirements of this bill.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1319 (117th)",
            "First Name": "Bennie Thompson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1319 (117th)",
            "Bill Name": "American Rescue Plan Act of 2021",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1192 (117th)",
            "First Name": "Bennie Thompson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1192 (117th)",
            "Bill Name": "PRRADA",
            "Summary": "This bill requires professionals employed in debt adjustment cases involving Puerto Rico to file verified statements disclosing their connections with interested parties before seeking compensation for their services.The Financial Oversight and Management Board for Puerto Rico must establish a list of such interested parties, which shall include the debtor, creditors, any attorney or accountant of the debtor or creditors, persons employed by the U.S. Trustee Program, persons employed by the board, and any other interested party.Compensation may be denied to such a professional if these disclosures are not filed, are inadequate, or if the professional is found to have certain conflicts of interest.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 2471 (117th)",
            "First Name": "Bennie Thompson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 2471 (117th)",
            "Bill Name": "Consolidated Appropriations Act, 2022",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 2471 (117th)",
            "First Name": "Bennie Thompson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 2471 (117th)",
            "Bill Name": "Consolidated Appropriations Act, 2022",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 208 (117th)",
            "First Name": "Bennie Thompson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 208 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 500 West Main Street, Suite 102 in Tupelo, Mississippi, as the Colonel Carlyle Smitty Harris Post Office.",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 55 (117th)",
            "First Name": "Bennie Thompson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 55 (117th)",
            "Bill Name": "Emmett Till Antilynching Act",
            "Summary": "This bill makes lynching a federal hate crime offense.Specifically, the bill imposes criminal penalties—a fine, a prison term of up to 30 years, or both—on an individual who conspires to commit a hate crime offense that results in death or serious bodily injury or that includes kidnapping or an attempt to kidnap, aggravated sexual abuse or an attempt to commit aggravated sexual abuse, or an attempt to kill.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3539 (117th)",
            "First Name": "Bennie Thompson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3539 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 223 West Chalan Santo Papa in Hagatna, Guam, as the \\u201cAtanasio Taitano Perez Post Office\\u201d.",
            "Summary": "This bill designates the facility of the United States Postal Service located at 223 West Chalan Santo Papa in Hagatna, Guam, as the Atanasio Taitano Perez Post Office.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 735 (117th)",
            "First Name": "Bennie Thompson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 735 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 502 East Cotati Avenue in Cotati, California, as the \\u201cArturo L. Ibleto Post Office Building\\u201d.",
            "Summary": "This bill designates the facility of the United States Postal Service located at 502 East Cotati Avenue in Cotati, California, as the Arturo L. Ibleto Post Office Building.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3076 (117th)",
            "First Name": "Bennie Thompson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3076 (117th)",
            "Bill Name": "Postal Service Reform Act of 2022",
            "Summary": "This bill addresses the finances and operations of the U.S. Postal Service (USPS).The bill requires the Office of Personnel Management (OPM) to establish the Postal Service Health Benefits Program within the Federal Employees Health Benefits Program under which OPM may contract with carriers to offer health benefits plans for USPS employees and retirees.The bill provides for coordinated enrollment of retirees under this program and Medicare.The bill repeals the requirement that the USPS annually prepay future retirement health benefits.Additionally, the USPS may establish a program to enter into agreements with an agency of any state government, local government, or tribal government, and with other government agencies, to provide certain nonpostal products and services that reasonably contribute to the costs of the USPS and meet other specified criteria.The USPS must develop and maintain a publicly available dashboard to track service performance and must report regularly on its operations and financial condition.The Postal Regulatory Commission must annually submit to the USPS a budget of its expenses. It must also conduct a study to identify the causes and effects of postal inefficiencies relating to flats (e.g., large envelopes).The USPS Office of Inspector General shall perform oversight of the Postal Regulatory Commission.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 2324 (117th)",
            "First Name": "Bennie Thompson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 2324 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 2800 South Adams Street in Tallahassee, Florida, as the \\u201cD. Edwina Stephens Post Office\\u201d.",
            "Summary": "This bill designates the facility of the United States Postal Service located at 2800 South Adams Street in Tallahassee, Florida, as the D. Edwina Stephens Post Office.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 335 (117th)",
            "First Name": "Bennie Thompson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 335 (117th)",
            "Bill Name": "To provide for an exception to a limitation against appointment of persons as Secretary of Defense within seven years of relief from active duty as a regular commissioned officer of the Armed Forces.",
            "Summary": "This bill allows the first person nominated and appointed as Secretary of Defense after 12 p.m. (Eastern Standard Time) on January 20, 2021, to be a person who is, on the date of appointment, at least four years after relief from active duty as a commissioned officer of a regular component of the Armed Forces. Under current law, an individual may not be appointed as Secretary of Defense within seven years after relief from such active duty.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 22 (117th)",
            "First Name": "Bennie Thompson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 22 (117th)",
            "Bill Name": "Congressional Budget Justification Transparency Act of 2021",
            "Summary": "This bill requires federal agencies to make budget justification materials available to the public on a website. The bill also requires the Office of Management and Budget to make certain details regarding the materials available to the public, including a list of the agencies that submit budget justification materials to Congress, the dates that the materials are submitted to Congress and posted online, and links to the materials.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1226",
            "First Name": "Bennie Thompson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1226",
            "Bill Name": "Wounded Warrior Access Act",
            "Summary": NaN,
            "Status": "Enacted",
            "Democrat_Yea": 0.9575471698113208,
            "Democrat_Nay": 0.0,
            "Republican_Yea": 0.9864864864864864,
            "Republican_Nay": 0.0
        },
        {
            "Bill Number": "H.R. 5577 (117th)",
            "First Name": "Bennie Thompson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 5577 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 3900 Crown Road Southwest in Atlanta, Georgia, as the \\u201cJohn R. Lewis Post Office Building\\u201d.",
            "Summary": "This bill designates the facility of the United States Postal Service located at 3900 Crown Road Southwest in Atlanta, Georgia, as the John R. Lewis Post Office Building.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 346",
            "First Name": "Bennie Thompson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 346",
            "Bill Name": "NOTAM Improvement Act of 2023",
            "Summary": "This bill directs the Federal Aviation Administration (FAA) to establish the FAA Task Force on NOTAM (notice to air missions required by international or domestic law) Improvement and requires the FAA to implement a federal NOTAM system. A NOTAM is a notice containing information essential to personnel concerned with flight operations but not known far enough in advance to be publicized by other means. It states the abnormal status of a component of the National Airspace System.Specifically, the task force must (1) review existing methods for publishing NOTAMs and flight operations information for pilots; (2) review regulations, policies, systems, and international standards relating to NOTAMs, including their content and presentation to pilots; (3) evaluate and determine best practices to organize, prioritize, and present flight operations information in a manner that optimizes pilot review and retention of relevant information; (4) provide recommendations to improve the publication and delivery of NOTAM information; and (5) report to Congress on its reviews and evaluations.By September 30, 2024, the FAA must (1) complete implementation of a federal NOTAM system and implement a back-up system, and (2) brief Congress on a plan to enhance information delivery through this federal system to promote further global harmonization and provide users of the National Airspace System a consistent format for domestic and international operations.",
            "Status": "Enacted",
            "Democrat_Yea": 0.9764150943396226,
            "Democrat_Nay": 0.0,
            "Republican_Yea": 0.9774774774774776,
            "Republican_Nay": 0.018018018018018
        }
    ],
    "CosponsoredBills": [
        {
            "Bill Number": "H.R. 5675",
            "First Name": "Bennie  Thompson",
            "Last Name": "cosponsor",
            "Role": "H.R. 5675",
            "Bill Name": "Overtime Pay for Protective Services Act of 2023",
            "Subject Areas": "Government Operations and Politics",
            "Summary": NaN
        },
        {
            "Bill Number": "H.R. 1150",
            "First Name": "Bennie  Thompson",
            "Last Name": "cosponsor",
            "Role": "H.R. 1150",
            "Bill Name": "John Lewis Civil Rights Fellowship Act of 2023",
            "Subject Areas": "International Affairs, Area studies and international education, Congressional oversight, Congressional tributes, Employment and training programs, Higher education, Human rights, International exchange and broadcasting",
            "Summary": "This bill establishes the John Lewis Civil Rights Fellowship Program within the J. William Fulbright Educational Exchange Program (commonly referred to as the Fulbright Program).The fellowship program shall honor the legacy of Representative John Lewis and advance U.S. foreign policy priorities by promoting studies, research, and international exchange in the subject of nonviolent civil rights movements around the world.The Fulbright Foreign Scholarship Board shall annually select qualified individuals to serve as fellows in the fellowship program. The Bureau of Educational and Cultural Affairs may determine the number of fellows for each year, with at least 25 fellows each year whenever feasible. Each fellow shall (1) work in an internship or research position with an approved organization in a country with an operational Fulbright U.S. Student Program, and (2) receive an award sufficient to cover the fellow's reasonable costs during the fellowship period and certain travel and lodging expenses related to the program."
        },
        {
            "Bill Number": "H.R. 7077 (117th)",
            "First Name": "Bennie  Thompson",
            "Last Name": "cosponsor",
            "Role": "H.R. 7077 (117th)",
            "Bill Name": "Empowering the U.S. Fire Administration Act",
            "Subject Areas": "Emergency Management, Fires, Government information and archives, Government studies and investigations",
            "Summary": NaN
        },
        {
            "Bill Number": "H.R. 3175 (117th)",
            "First Name": "Bennie  Thompson",
            "Last Name": "cosponsor",
            "Role": "H.R. 3175 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 135 Main Street in Biloxi, Mississippi, as the Robert S. McKeithen Post Office Building.",
            "Subject Areas": NaN,
            "Summary": NaN
        },
        {
            "Bill Number": "H.R. 3630 (117th)",
            "First Name": "Bennie  Thompson",
            "Last Name": "cosponsor",
            "Role": "H.R. 3630 (117th)",
            "Bill Name": "Lymphedema Treatment Act",
            "Subject Areas": "Health, Labor and Employment, Cardiovascular and respiratory health, Health care coverage and access, Immunology and vaccination, Medicare",
            "Summary": "This bill provides for Medicare coverage of lymphedema compression treatment items. Specifically, the bill provides for coverage of standard and custom fitted gradient compression garments and other approved items that are prescribed by a physician or other specified health care professional to treat lymphedema."
        },
        {
            "Bill Number": "H.R. 5577 (117th)",
            "First Name": "Bennie  Thompson",
            "Last Name": "cosponsor",
            "Role": "H.R. 5577 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 3900 Crown Road Southwest in Atlanta, Georgia, as the \\u201cJohn R. Lewis Post Office Building\\u201d.",
            "Subject Areas": "Government Operations and Politics, Congressional tributes, Georgia, Government buildings, facilities, and property, Postal service",
            "Summary": "This bill designates the facility of the United States Postal Service located at 3900 Crown Road Southwest in Atlanta, Georgia, as the John R. Lewis Post Office Building."
        },
        {
            "Bill Number": "H.R. 4426 (117th)",
            "First Name": "Bennie  Thompson",
            "Last Name": "cosponsor",
            "Role": "H.R. 4426 (117th)",
            "Bill Name": "Homeland Security for Children Act",
            "Subject Areas": "Emergency Management, Administrative law and regulatory procedures, Child health, Child safety and welfare, Congressional oversight, Department of Homeland Security, Disaster relief and insurance, Executive agency funding and structure, Federal Emergency Management Agency (FEMA), Natural disasters, Terrorism",
            "Summary": "This bill requires the Department of Homeland Security (DHS) to ensure that the needs of children are considered in homeland security planning.Specifically, each DHS office and component must take into account the needs of children, including children within underserved communities, in mission planning and execution. DHS must require each office and component to seek advice and feedback from organizations representing the needs of children.The bill directs the Federal Emergency Management Agency (FEMA) to identify and integrate the needs of children into activities to prepare for, protect against, respond to, recover from, and mitigate against the risk of natural disasters, acts of terrorism, and other disasters, including by appointing a technical expert to coordinate such integration."
        },
        {
            "Bill Number": "H.R. 7791 (117th)",
            "First Name": "Bennie  Thompson",
            "Last Name": "cosponsor",
            "Role": "H.R. 7791 (117th)",
            "Bill Name": "Access to Baby Formula Act of 2022",
            "Subject Areas": NaN,
            "Summary": "This bill authorizes the Department of Agriculture (USDA) to take certain actions to address emergencies, disasters, and supply chain disruptions (particularly the shortage of infant formula in the United States) affecting participants of the Special Supplemental Nutrition Program for Women, Infants, and Children (WIC).The bill directs USDA to require each infant formula cost containment contract to include remedies in the event of an infant formula recall, including how an infant formula manufacturer would protect against disruption to WIC participants in the state.USDA must, within 30 days, ensure there is a memorandum of understanding with the Department of Health and Human Services that includes procedures for coordination and information sharing regarding any supply chain disruption, including a supplemental food recall.The bill also authorizes USDA to waive or modify any WIC qualified administrative requirement during emergencies, disasters, and supply chain disruptions. Specifically, USDA may waive or modify such a requirement for one or more state agencies if (1) the requirement cannot be met by state agencies during the emergency, disaster, or disruption; and (2) the modification or waiver is necessary to provide assistance to WIC participants and does not substantially weaken the nutritional quality of supplemental foods. For example, USDA may waive the maximum monthly allowance for infant formula.The bill establishes notification requirements for USDA and state agencies related to supply chain disruptions."
        },
        {
            "Bill Number": "H.R. 1057 (117th)",
            "First Name": "Bennie  Thompson",
            "Last Name": "cosponsor",
            "Role": "H.R. 1057 (117th)",
            "Bill Name": "Greatest Generation Commemorative Coin Act",
            "Subject Areas": "Finance and Financial Sector, Conflicts and wars, Currency, Military history, Monuments and memorials, U.S. history, Veterans' organizations and recognition",
            "Summary": "This bill directs the Department of the Treasury to mint and issue up to 50,000 $5 coins, 400,000 $1 silver coins, and 750,000 half-dollar clad coins in commemoration of the National World War II Memorial in the District of Columbia.The design of the coins shall be emblematic of the memorial and the service and sacrifice of American soldiers and civilians during World War II.All surcharges received from the sale of such coins shall be paid to the Friends of the National World War II Memorial to support the National Park Service in maintaining and repairing the memorial, and for educational and commemorative programs."
        },
        {
            "Bill Number": "H.R. 6015 (117th)",
            "First Name": "Bennie  Thompson",
            "Last Name": "cosponsor",
            "Role": "H.R. 6015 (117th)",
            "Bill Name": "Benjamin Berell Ferencz Congressional Gold Medal Act",
            "Subject Areas": "International Affairs, Congressional tributes, Criminal investigation, prosecution, interrogation, Europe, Germany, International law and treaties, Lawyers and legal services, Museums, exhibitions, cultural centers, War crimes, genocide, crimes against humanity",
            "Summary": "This bill provides for the award of a Congressional Gold Medal to Benjamin Berell Ferencz in recognition of his service to the United States and the international community during the post-World War II Nuremberg trials and his lifelong advocacy for international criminal justice and the rule of law."
        },
        {
            "Bill Number": "H.R. 55 (117th)",
            "First Name": "Bennie  Thompson",
            "Last Name": "cosponsor",
            "Role": "H.R. 55 (117th)",
            "Bill Name": "Emmett Till Antilynching Act",
            "Subject Areas": "Violent crime",
            "Summary": "This bill makes lynching a federal hate crime offense.Specifically, the bill imposes criminal penalties—a fine, a prison term of up to 30 years, or both—on an individual who conspires to commit a hate crime offense that results in death or serious bodily injury or that includes kidnapping or an attempt to kidnap, aggravated sexual abuse or an attempt to commit aggravated sexual abuse, or an attempt to kill."
        },
        {
            "Bill Number": "H.R. 1842 (117th)",
            "First Name": "Bennie  Thompson",
            "Last Name": "cosponsor",
            "Role": "H.R. 1842 (117th)",
            "Bill Name": "Harriet Tubman Bicentennial Commemorative Coin Act",
            "Subject Areas": "U.S. history, Women's rights",
            "Summary": "This bill directs the Department of the Treasury to mint and issue 50,000 $5 gold coins, 400,000 $1 silver coins, and 750,000 half-dollar clad coins emblematic of the legacy of Harriet Tubman as an abolitionist.The Secretary may issue coins under this bill only during the period of January 1, 2024, through December 31, 2024.All surcharges received by Treasury from the sale of such coins must be paid equally to the National Underground Railroad Freedom Center in Cincinnati, Ohio, and The Harriet Tubman Home, Inc. in Auburn, New York, for the purpose of accomplishing and advancing their missions."
        },
        {
            "Bill Number": "H.R. 6736 (117th)",
            "First Name": "Bennie  Thompson",
            "Last Name": "cosponsor",
            "Role": "H.R. 6736 (117th)",
            "Bill Name": "Countering Human Trafficking Act of 2022",
            "Subject Areas": "Crime and Law Enforcement, Computers and information technology, Congressional oversight, Crime prevention, Crime victims, Crimes against children, Criminal investigation, prosecution, interrogation, Customs enforcement, Department of Homeland Security, Executive agency funding and structure, Federal officials, Government information and archives, Human rights, Human trafficking, Labor standards, Latin America, Law enforcement administration and funding, Mexico, Public contracts and procurement, Sex offenses, Smuggling and trafficking, Trade restrictions",
            "Summary": "This bill provides statutory authority for the Center for Countering Human Trafficking (CCHT) within the Department of Homeland Security (DHS). The CCHT coordinates DHS efforts to combat human trafficking and the importation of goods produced with forced labor.The bill requires the CCHT to develop a strategy to improve the systems and processes used throughout DHS to combat human trafficking and the importation of goods produced with forced labor.The bill transfers the functions and resources of the Blue Campaign (i.e., the national public awareness effort to combat human trafficking) to the CCHT. DHS may also transfer to the CCHT any other component, directorate, or office of the department related to combating human trafficking."
        },
        {
            "Bill Number": "H.R. 5142 (117th)",
            "First Name": "Bennie  Thompson",
            "Last Name": "cosponsor",
            "Role": "H.R. 5142 (117th)",
            "Bill Name": "To award posthumously a Congressional Gold Medal, in commemoration to the servicemembers who perished in Afghanistan on August 26, 2021, during the evacuation of citizens of the United States and Afghan allies at Hamid Karzai Internati",
            "Subject Areas": "Armed Forces and National Security, International Affairs, Afghanistan, Asia, Conflicts and wars, Congressional tributes, Emergency planning and evacuation, Military operations and strategy, Military personnel and dependents, Museums, exhibitions, cultural centers, Smithsonian Institution, Terrorism",
            "Summary": "This bill posthumously provides for the award of a Congressional Gold Medal in commemoration of the 13 service members who died on August 26, 2021, while stationed at Hamid Karzai International Airport in Afghanistan."
        },
        {
            "Bill Number": "H.R. 208 (117th)",
            "First Name": "Bennie  Thompson",
            "Last Name": "cosponsor",
            "Role": "H.R. 208 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 500 West Main Street, Suite 102 in Tupelo, Mississippi, as the Colonel Carlyle Smitty Harris Post Office.",
            "Subject Areas": NaN,
            "Summary": NaN
        },
        {
            "Bill Number": "H.R. 3642 (117th)",
            "First Name": "Bennie  Thompson",
            "Last Name": "cosponsor",
            "Role": "H.R. 3642 (117th)",
            "Bill Name": "Harlem Hellfighters Congressional Gold Medal Act",
            "Subject Areas": "Armed Forces and National Security, Conflicts and wars, Congressional tributes, Military history, Military personnel and dependents, Museums, exhibitions, cultural centers, New York State, Racial and ethnic relations, Smithsonian Institution, Veterans' organizations and recognition",
            "Summary": "This bill provides for the award of a Congressional Gold Medal to the 369th Infantry Regiment, commonly known as the Harlem Hellfighters, in recognition of their bravery and outstanding service during World War I."
        },
        {
            "Bill Number": "H.R. 1833 (117th)",
            "First Name": "Bennie  Thompson",
            "Last Name": "cosponsor",
            "Role": "H.R. 1833 (117th)",
            "Bill Name": "DHS Industrial Control Systems Capabilities Enhancement Act of 2021",
            "Subject Areas": "Science, Technology, Communications, Computer security and identity theft, Congressional oversight, Government studies and investigations, Homeland security, Industrial facilities, Infrastructure development, Manufacturing",
            "Summary": "This bill requires the Cybersecurity and Infrastructure Security Agency (CISA) to maintain certain capabilities to identify and address threats to industrial control systems.Specifically, the bill requires CISA's National Cybersecurity and Communications Integration Center to ensure that its activities address the security of both information and operational technology, including industrial control systems.Additionally, CISA must maintain capabilities to identify and address threats and vulnerabilities to products and technologies intended for use in the automated control of critical infrastructure processes by (1) leading efforts to identify and mitigate cybersecurity threats to industrial control systems; (2) maintaining threat hunting and incident response capabilities to respond to cybersecurity risks and incidents; (3) providing cybersecurity technical assistance to stakeholders; and (4) collecting, coordinating, and providing vulnerability information to the industrial control systems community.CISA shall provide to the homeland security committees a briefing on its industrial control systems capabilities at specified intervals.The Government Accountability Office must review and report on implementation of the bill's requirements."
        },
        {
            "Bill Number": "H.R. 1870 (117th)",
            "First Name": "Bennie  Thompson",
            "Last Name": "cosponsor",
            "Role": "H.R. 1870 (117th)",
            "Bill Name": "Strengthening Local Transportation Security Capabilities Act of 2021",
            "Subject Areas": "Intelligence activities, surveillance, classified information, Intergovernmental relations, Law enforcement administration and funding, Law enforcement officers, Motor carriers, Public transit, Railroads, Roads and highways, Terrorism, Transportation safety and security, Violent crime",
            "Summary": "This bill addresses threat information sharing and law enforcement training regarding the enhancement of security for surface transportation assets. A surface transportation asset includes facilities, equipment, or systems used to provide transportation services by a public transportation carrier, railroad carrier, or an entity offering scheduled, fixed-route transportation services by bus.Specifically, the bill directs the Department of Homeland Security (DHS) to prioritize the assignment of officers and intelligence analysts from the Transportation Security Administration and the Office of Intelligence and Analysis to locations with fusion centers in jurisdictions with high-risk surface transportation assets to enhance the security of such assets, including by improving timely sharing of classified information regarding terrorism and other threats.The bill also authorizes DHS to develop a training program to enhance the protection, preparedness, and response capabilities of law enforcement agencies with respect to terrorism and other threats at a surface transportation asset."
        },
        {
            "Bill Number": "H.R. 3537 (117th)",
            "First Name": "Bennie  Thompson",
            "Last Name": "cosponsor",
            "Role": "H.R. 3537 (117th)",
            "Bill Name": "Accelerating Access to Critical Therapies for ALS Act",
            "Subject Areas": "Health, Drug safety, medical device, and laboratory regulation, Drug therapy, Government information and archives, Health care coverage and access, Health programs administration and funding, Health promotion and preventive care, Higher education, Medical research, Medical tests and diagnostic methods, Neurological disorders, Prescription drugs, Public-private cooperation, Research administration and funding, Research and development, Social work, volunteer service, charitable organizations",
            "Summary": "This bill establishes grant programs to address neurodegenerative diseases, such as amyotrophic lateral sclerosis (also known as ALS or Lou Gehrig's disease), and contains other related provisions.The Department of Health and Human Services (HHS) shall award grants to eligible entities for scientific research utilizing data from expanded access to investigational ALS treatments for individuals who are not otherwise eligible for clinical trials. The Food and Drug Administration (FDA) shall award grants to public and private entities to cover the costs of research and development of drugs that diagnose or treat ALS and other rare neurodegenerative diseases.HHS shall also establish the Public-Private Partnership for Neurodegenerative Diseases between the National Institutes of Health, the FDA, and at least one eligible entity (generally, an institution of higher education or a nonprofit organization). The partnership shall support the development and regulatory review of drugs that address ALS and other rare neurodegenerative diseases.The FDA shall publish on its website a five-year action plan for fostering the development of drugs that improve or extend the lives of people living with rare neurodegenerative diseases.The Government Accountability Office must report to Congress about the grants provided under this bill, including an analysis of the impact of such grants on research and development of treatments for ALS."
        },
        {
            "Bill Number": "H.R. 707 (117th)",
            "First Name": "Bennie  Thompson",
            "Last Name": "cosponsor",
            "Role": "H.R. 707 (117th)",
            "Bill Name": "Ghost Army Congressional Gold Medal Act",
            "Subject Areas": "Military operations and strategy, Military personnel and dependents, Museums, exhibitions, cultural centers, Smithsonian Institution",
            "Summary": "This bill directs the Speaker of the House of Representatives and the President pro tempore of the Senate to award a Congressional Gold Medal to the 23rd Headquarters Special Troops and the 3133rd Signal Service Company, known as the Ghost Army, collectively, in recognition of its service during World War II."
        },
        {
            "Bill Number": "H.R. 210 (117th)",
            "First Name": "Bennie  Thompson",
            "Last Name": "cosponsor",
            "Role": "H.R. 210 (117th)",
            "Bill Name": "Rural STEM Education Research Act",
            "Subject Areas": "Computers and information technology, Congressional oversight, Education of the disadvantaged, Educational technology and distance education, Elementary and secondary education, Employment and training programs, Government studies and investigations, Higher education, Internet and video services, Manufacturing, Performance measurement, Research administration and funding, Rural conditions and development, Science and engineering education, Teaching, teachers, curricula, Vocational and technical education",
            "Summary": "This bill specifies federal scientific research and development efforts towards STEM (science, technology, engineering, and mathematics, including computer science) workforce development and rural STEM education.(Sec. 3) The bill amends the objectives of the Manufacturing Extension Partnership program to include the provision to secondary schools of information about the job skills needed in manufacturing companies, and the promotion and expansion of certification systems offered through local high schools. The activities of a manufacturing extension center are expanded to include local high schools in the facilitation of collaborations and partnerships between manufacturing companies and schools to help those entities better understand the specific needs of manufacturers and to help manufacturers better understand the skill sets that students learn in school programs.The National Institute of Standards and Technology (NIST) must award prizes to stimulate research and development of creative technologies in order to deploy affordable and reliable broadband connectivity to underserved rural communities. NIST may award not more than a total of $5 million in prizes.(Sec. 4) The Office of Science and Technology Policy must establish a broadband research and development working group to address national research challenges and opportunities for improving broadband access and adoption across the United States.(Sec. 5) The National Science Foundation (NSF) shall enter into an agreement with the National Academy of Sciences under which the National Academy of Sciences agrees to evaluate aspects of STEM education and workforce development in rural areas. (Sec. 6) The Government Accountability Office shall conduct a study on the engagement of rural populations in federal STEM programs.(Sec. 7) Experimental Program to Stimulate Competitive Research (EPSCoR) programs shall consider modifications to award structures to increase the capacity of rural communities to provide quality STEM education and STEM workforce development programming to students and teachers.(Sec. 8) The NSF must award grants to institutions of higher education or nonprofit organizations for (1) research and development to advance innovative approaches to support and sustain high-quality STEM teaching in rural schools, (2) research and development of programming to identify the barriers rural students face in accessing high-quality STEM education, (3) development of innovative solutions to improve the participation and advancement of rural students in grades Pre-K through 12 in STEM studies, and (4) research on online STEM education courses for rural communities.The NSF may establish a pilot program of regional cohorts in rural areas to provide peer support, mentoring, and hands-on research experiences for rural STEM educators of students in grades Pre-K through 12 in order to build an ecosystem of cooperation among educators, researchers, academia, and local industry."
        },
        {
            "Bill Number": "H.R. 2252 (117th)",
            "First Name": "Bennie  Thompson",
            "Last Name": "cosponsor",
            "Role": "H.R. 2252 (117th)",
            "Bill Name": "Emmett Till and Mamie Till-Mobley Congressional Gold Medal Act of 2021",
            "Subject Areas": "Racial and ethnic relations, Smithsonian Institution, U.S. history",
            "Summary": "This bill provides for the posthumous presentation of a Congressional Gold Medal in commemoration of Emmett Till and Mamie Till-Mobley.After the award the medal shall be given to the National Museum of African American History and Culture."
        },
        {
            "Bill Number": "H.R. 2048 (117th)",
            "First Name": "Bennie  Thompson",
            "Last Name": "cosponsor",
            "Role": "H.R. 2048 (117th)",
            "Bill Name": "Consider Teachers Act of 2021",
            "Subject Areas": "Education, Administrative remedies, Cardiovascular and respiratory health, Department of Education, Education of the disadvantaged, Education programs funding, Elementary and secondary education, Emergency medical services and trauma care, Government lending and loan guarantees, Higher education, Infectious and parasitic diseases, Interest, dividends, interest rates, National and community service, Personnel records, Student aid and college costs, Teaching, teachers, curricula",
            "Summary": "This bill revises the service obligation verification process for the Teacher Education Assistance for College and Higher Education (TEACH) grant program.For example, the bill provides a process for the Department of Education to reconsider and reverse the conversion of a TEACH grant to a loan. The bill also establishes certain program flexibilities with respect to the service obligations of teachers affected by the COVID-19 (i.e., coronavirus disease 2019) pandemic."
        },
        {
            "Bill Number": "H.R. 1085 (117th)",
            "First Name": "Bennie  Thompson",
            "Last Name": "cosponsor",
            "Role": "H.R. 1085 (117th)",
            "Bill Name": "To award three congressional gold medals to the United States Capitol Police and those who protected the U.S. Capitol on January 6, 2021.",
            "Subject Areas": "Assault and harassment offenses, Congress, Congressional tributes, Crimes against property, District of Columbia, Government buildings, facilities, and property, Law enforcement officers, Museums, exhibitions, cultural centers, Protest and dissent, Smithsonian Institution, Subversive activities, Terrorism, U.S. Capitol, Violent crime",
            "Summary": "This bill directs the Speaker of the House and the President pro tempore of the Senate to arrange for the award of three Congressional Gold Medals to the U.S. Capitol Police (USCP) and other law enforcement agencies that protected the U.S. Capitol on January 6, 2021.Following the award of these medals, one medal shall be given to the USCP, one medal shall be given to the Metropolitan Police Department of the District of Columbia, and one medal shall be given to the Smithsonian Institution and displayed with a plaque listing all law enforcement agencies that participated in protecting the Capitol on January 6, 2021."
        },
        {
            "Bill Number": "H.R. 1012 (117th)",
            "First Name": "Bennie  Thompson",
            "Last Name": "cosponsor",
            "Role": "H.R. 1012 (117th)",
            "Bill Name": "\\u2018Six Triple Eight\\u2019 Congressional Gold Medal Act of 2021",
            "Subject Areas": "Military history, Military personnel and dependents, Minority employment, Museums, exhibitions, cultural centers, Postal service, Smithsonian Institution, Women's employment",
            "Summary": "This bill directs the Speaker of the House of Representatives and the President pro tempore of the Senate to arrange for the award of a Congressional Gold Medal in honor of the women of the 6888th Central Postal Directory Battalion (commonly known as the Six Triple Eight) in recognition of their pioneering military service, devotion to duty, and contributions to increase the morale of personnel stationed in the European theater of operations during World War II. The medal shall be given to the Smithsonian Institution and made available for display and research."
        },
        {
            "Bill Number": "H.R. 3525 (117th)",
            "First Name": "Bennie  Thompson",
            "Last Name": "cosponsor",
            "Role": "H.R. 3525 (117th)",
            "Bill Name": "Commission To Study the Potential Creation of a National Museum of Asian Pacific American History and Culture Act",
            "Subject Areas": NaN,
            "Summary": "This bill establishes a Commission to Study the Potential Creation of a National Museum of Asian Pacific American History and Culture.The commission must (1) report recommendations for a plan of action for the establishment and maintenance of a National Museum of Asian Pacific American History and Culture in Washington, DC; (2) develop a fundraising plan to support the establishment, operation, and maintenance of the museum through public contributions; (3) obtain an independent review of this fundraising plan, including an analysis of the resources necessary to fund the construction of the museum and its operations and maintenance in perpetuity without reliance on federal funds; and (4) submit a legislative plan of action to establish and construct the museum.The commission may convene a national conference relating to the museum.The commission shall be solely responsible for acceptance of contributions to it and payment of its expenses.No federal funding may be obligated to carry out this bill."
        },
        {
            "Bill Number": "H.R. 2915 (117th)",
            "First Name": "Bennie  Thompson",
            "Last Name": "cosponsor",
            "Role": "H.R. 2915 (117th)",
            "Bill Name": "HOPR Act",
            "Subject Areas": "Government employee pay, benefits, personnel management, Government studies and investigations, Public contracts and procurement, Small business, War and emergency powers",
            "Summary": "This bill directs the Department of Homeland Security (DHS) to ensure that procurement of certain items, such as body armor and other protective gear, meets specified requirements, including that a fraction of procurement funds be used for items manufactured by U.S. small businesses.The bill sets forth requirements for waivers based on a national emergency.DHS shall (1) ensure that covered items are purchased at a fair and reasonable price, and (2) study the adequacy of uniform allowances provided to employees of frontline operational components (i.e., Customs and Border Protection and other listed agencies and entities).DHS must report to Congress with recommendations on how it could procure additional items from domestic sources and bolster the domestic supply chain for specified national security-related items, including personal protective equipment and other items necessary to respond to a pandemic such as that caused by COVID-19."
        },
        {
            "Bill Number": "H.R. 5593 (117th)",
            "First Name": "Bennie  Thompson",
            "Last Name": "cosponsor",
            "Role": "H.R. 5593 (117th)",
            "Bill Name": "Cybersecurity Opportunity Act",
            "Subject Areas": "Science, Technology, Communications",
            "Summary": "This bill requires the Department of Homeland Security to establish a grant program to promote cybersecurity training and education at institutions of higher education with an enrollment of needy students, historically Black colleges and universities, and minority-serving institutions."
        },
        {
            "Bill Number": "H.R. 1893 (117th)",
            "First Name": "Bennie  Thompson",
            "Last Name": "cosponsor",
            "Role": "H.R. 1893 (117th)",
            "Bill Name": "Transportation Security Preparedness Act of 2021",
            "Subject Areas": "Department of Homeland Security, Emergency medical services and trauma care, Emergency planning and evacuation, Employee leave, Government employee pay, benefits, personnel management, Government studies and investigations, Health technology, devices, supplies, Immunology and vaccination, Infectious and parasitic diseases, Medical tests and diagnostic methods, Transportation safety and security, Worker safety and health",
            "Summary": "This bill directs the Transportation Security Administration (TSA) to survey its workforce regarding the TSA's response to the COVID-19 pandemic. It must also develop and biennially review a transportation security preparedness plan for addressing future outbreaks of communicable diseases.The Government Accountability Office must submit a report to Congress that contains the results of a study assessing the plan, including an analysis of (1) whether such plan aligns with relevant federal plans and strategies for communicable disease outbreaks, and (2) the extent to which the TSA is prepared to implement the plan."
        },
        {
            "Bill Number": "H.R. 3264 (117th)",
            "First Name": "Bennie  Thompson",
            "Last Name": "cosponsor",
            "Role": "H.R. 3264 (117th)",
            "Bill Name": "Domains Critical to Homeland Security Act",
            "Subject Areas": "Emergency Management, Economic performance and conditions, Foreign and international corporations, Government studies and investigations, Homeland security, Infrastructure development, Intellectual property, Manufacturing, Research and development, Trade secrets and economic espionage",
            "Summary": "This bill authorizes the Department of Homeland Security (DHS) to conduct research and development to identify U.S. critical domains for economic and homeland security and evaluate the extent to which disruption, corruption, exploitation, or dysfunction of any such domain poses a substantial threat to homeland security. The bill defines United States critical domains for economic security as the critical infrastructure and other associated industries, technologies, and intellectual property, or any combination thereof, that are essential to U.S. economic security.DHS may conduct additional research into high-risk critical domains under specified circumstances."
        },
        {
            "Bill Number": "H.R. 370 (117th)",
            "First Name": "Bennie  Thompson",
            "Last Name": "cosponsor",
            "Role": "H.R. 370 (117th)",
            "Bill Name": "Quadrennial Homeland Security Review Technical Corrections Act of 2021",
            "Subject Areas": "Emergency Management, Advisory bodies, Congressional oversight, Department of Homeland Security, Executive agency funding and structure, Government studies and investigations, Homeland security, Public contracts and procurement",
            "Summary": "This bill makes numerous changes to the quadrennial homeland security reviews. The quadrennial homeland security review is the Department of Homeland Security's capstone strategy document, which offers recommendations on long-term strategy and priorities for homeland security.Specifically, the changes are related to consultation, prioritization, resources required, deadlines, and documentation."
        },
        {
            "Bill Number": "H.R. 408 (117th)",
            "First Name": "Bennie  Thompson",
            "Last Name": "cosponsor",
            "Role": "H.R. 408 (117th)",
            "Bill Name": "Department of Homeland Security Mentor-Prot\\u00e9g\\u00e9 Program Act of 2022",
            "Subject Areas": "Government Operations and Politics, Congressional oversight, Department of Homeland Security, Higher education, Minority and disadvantaged businesses, Minority education, Performance measurement, Public contracts and procurement, Small business, Veterans' education, employment, rehabilitation, Women in business",
            "Summary": "This bill provides statutory authority for the mentor-protégé program of the Department of Homeland Security (DHS) under which a mentor firm enters into an agreement with a protégé firm to assist the latter to compete for prime contracts and subcontracts of DHS."
        },
        {
            "Bill Number": "H.R. 2249 (117th)",
            "First Name": "Bennie  Thompson",
            "Last Name": "cosponsor",
            "Role": "H.R. 2249 (117th)",
            "Bill Name": "Willie O\\u2019Ree Congressional Gold Medal Act",
            "Subject Areas": "Racial and ethnic relations",
            "Summary": "This bill provides for the award of a Congressional Gold Medal to Willie O'Ree or, if unavailable, to a member of his family, in recognition of his contributions and commitment to hockey, inclusion, and recreational opportunity."
        }
    ],
    "VotingRecord": [
        {
            "Bill Number": "H.R. 2617 (117th)",
            "First Name": "Bennie Thompson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 2617 (117th)",
            "Bill Name": "Consolidated Appropriations Act, 2023",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3237 (117th)",
            "First Name": "Bennie Thompson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3237 (117th)",
            "Bill Name": "Emergency Security Supplemental Appropriations Act, 2021",
            "Summary": "This bill provides FY2021 supplemental appropriations for federal agencies to respond to the events at the U.S. Capitol Complex on January 6, 2021, and assist Afghan refugees.It also provides supplemental appropriations for the legislative branch to address COVID-19 and modifies requirements for certain programs that provide special immigrant status to eligible nationals of Afghanistan or Iraq,TITLE I--DEPARTMENT OF DEFENSEThis title provides appropriations for the National Guard to respond to the events at the U.S. Capitol Complex on January 6, 2021, and for related purposes.The title also provides appropriations to the Department of Defense for overseas humanitarian, disaster, and civic aid.TITLE II--DEPARTMENT OF HEALTH AND HUMAN SERVICESThis title provides appropriations to the Administration for Children and Families for refugee and entrance assistance activities.The funding must be used for activities for Afghan individuals within the United States who have been granted special immigrant status.TITLE III--LEGISLATIVE BRANCHThis title provides appropriations for the legislative branch to respond to the events at the U.S. Capitol Complex on January 6, 2021, and address COVID-19.Specifically, the title provides appropriations for the Senate, the House of Representatives, the U.S. Capitol Police, U.S. Capitol Police Mutual Aid Reimbursements, and the Architect of the Capitol (AOC). The title also provides appropriations for payments to the widows and heirs of deceased Members of Congress, including (1) Susan M. Wright, widow of the late Representative Ronald Wright; and (2) the heirs of the late Representative Alcee Hastings.(Sec. 301) This section designates the wellness program of the U.S. Capitol Police as the Howard C. Liebengood Center for Wellness.(Sec. 302) This section modifies the salary cap for the U.S. Capitol Police during 2021. (Sec. 310) This section prohibits funds from being used to install permanent, above-ground fencing around the perimeter, or any portion thereof, of the U.S. Capitol Grounds.(Sec. 311) With congressional approval, the AOC may accept contributions of, and incur obligations and make expenditures out of available appropriations for, supplies, products, and services necessary to respond to an emergency involving the safety of human life or the protection of property, as determined or declared by the Capitol Police Board.TITLE IV--BILATERAL ECONOMIC ASSISTANCEThis title provides appropriations to the Department of State for migration and refugee assistance to address humanitarian needs in Afghanistan and to assist Afghan refugees. The title also provides appropriations to the State Department for the United States Emergency Refugee and Migration Assistance Fund.(Sec. 401) This section increases the number of special immigrant visas available to qualified Afghan nationals who worked for the U.S. government or a North Atlantic Treaty Organization (NATO) mission in Afghanistan, extends the deadline for applying for such visas, and relaxes certain qualifications.All applicants for such a visa must establish that the applicant was employed with the U.S. government or a NATO mission for one year, where currently some applicants must prove two years of employment. This section also eliminates a requirement that the applicant faces an ongoing serious threat in Afghanistan due to such employment.Furthermore, for an applicant qualifying for a visa by performing duties for U.S. military personnel stationed with a NATO mission, this section eliminates a requirement that the duties performed qualify as sensitive and trusted duties.This section also relaxes limits to appealing rejections for applications for such visas.(Sec. 402) This bill authorizes the State Department and the Department of Homeland Security (DHS) to jointly postpone the medical exam requirement for individuals seeking entry into the United States under the program described in Section 401.If an individual receives such a postponement, DHS shall ensure to the greatest extent possible that individual undergoes a medical exam no later than 30 days after admission into the United States. Such an individual's status as a lawful permanent resident shall be conditional until the individual undergoes the required medical exam.(Sec. 403) This section modifies the immigration benefits of the surviving family members of certain deceased individuals.The surviving spouse or child of a U.S. government employee abroad shall qualify as a special immigrant if that employee performed at least 15 years of faithful service or was killed in the line of duty.This section also expands surviving family member benefits for certain programs that provide special immigrant status to eligible nationals of Afghanistan or Iraq, including the program described in Section 401. Specifically, if an individual submitted an application to the Chief of Mission that included an accompanying spouse or child and that application would have been approved but for the individual's death, the surviving spouse or child shall remain eligible to receive a visa under the respective program. Currently, such survivor rights only apply if the deceased individual's petition was approved.(Sec. 404) If an individual has an approved petition under a program that provided special immigrant status to translators who worked for the Armed Forces in Afghanistan or Iraq but a visa is not immediately available, the State Department or DHS may convert that petition to an approved petition under another program which provides special immigrant status to certain Iraqi nationals, if there are visas available under that second program. (DHS and the State Department currently only have the authority to convert petitions filed before October 1, 2008.)TITLE V--DEPARTMENT OF JUSTICEThis title provides appropriations to the Department of Justice (DOJ) for state and local law enforcement assistance.DOJ must use the funds for restoring funds that were used for extraordinary law enforcement and related costs directly associated with protection of the President-elect from November 4, 2020, until the inauguration of the President-elect as President.TITLE VI--GENERAL PROVISIONS--THIS ACT(Sec. 601) This section specifies that the funds provided by this bill are in addition to funds otherwise appropriated for the fiscal year involved.(Sec. 602) Funds provided by this bill may not remain available beyond the current fiscal year, unless this bill provides otherwise.(Sec. 603) Unless otherwise specified by this bill, the funds provided by this bill are subject to the authorities and conditions that apply to the applicable appropriations account for FY2021.(Sec. 604) This section specifies that funding provided by this bill may only be used for the purposes specifically described in the bill. The section includes an exception for funds used to restore amounts for obligations incurred prior to the date of the enactment of this bill.(Sec. 605) This section specifies that the term coronavirus in this bill means SARS-CoV-2 or another coronavirus with pandemic potential.(Sec. 606) This section provides that amounts designated by this bill as emergency requirements are only available (or rescinded or transferred, if applicable) if the President subsequently designates the amounts and transmits the designations to Congress.(Sec. 607) This section specifies that the emergency funds that are transferred pursuant to this bill retain the emergency designation.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1339 (117th)",
            "First Name": "Bennie Thompson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1339 (117th)",
            "Bill Name": "Advanced Air Mobility Coordination and Leadership Act",
            "Summary": "This bill directs the Department of Transportation to establish an Advanced Air Mobility (AAM) interagency working group to plan and coordinate efforts related to the safety, operations, infrastructure, physical security, cybersecurity, and federal investment necessary to bolster the AAM ecosystem in the United States. Advanced Air Mobility refers to a transportation system that transports people and property by air between two points in the United States using aircraft, including electric aircraft or electric vertical take-off and landing aircraft, in both controlled and uncontrolled airspace.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 2670",
            "First Name": "Bennie Thompson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 2670",
            "Bill Name": "National Defense Authorization Act for Fiscal Year 2024",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 7335 (117th)",
            "First Name": "Bennie Thompson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 7335 (117th)",
            "Bill Name": "MST Claims Coordination Act",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 6868 (117th)",
            "First Name": "Bennie Thompson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 6868 (117th)",
            "Bill Name": "Cybersecurity Grants for Schools Act of 2022",
            "Summary": "This bill allows the Cybersecurity and Infrastructure Security Agency (CISA) to award grants or other financial assistance for cybersecurity and infrastructure security education and training programs at the elementary and secondary education levels. Entities eligible for the assistance include states, localities, institutions of higher education, and nonprofits. Additionally, CISA must include information about how the grants and assistance enhance cybersecurity education for underserved populations or communities in annual briefings.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 4346",
            "First Name": "Bennie Thompson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 4346",
            "Bill Name": "CHIPS Act of 2022 / Research and Development, Competition, and Innovation Act / Supreme Court Security Funding Act of 2022",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3843 (117th)",
            "First Name": "Bennie Thompson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3843 (117th)",
            "Bill Name": "Merger Filing Fee Modernization Act of 2022",
            "Summary": "This bill modifies and expands the schedule for graduated merger filing fees and requires that such fees be adjusted each year based on the Consumer Price Index. It also (1) requires parties to disclose in their premerger notification filings any subsidy received from a foreign entity of concern, (2) modifies the venue rules for multi-district antitrust litigation, and (3) establishes various reporting requirements.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 7777 (117th)",
            "First Name": "Bennie Thompson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 7777 (117th)",
            "Bill Name": "Industrial Control Systems Cybersecurity Training Act",
            "Summary": "This bill establishes within the Cybersecurity and Infrastructure Security Agency an initiative to provide the cybersecurity workforce with no-cost training related to securing industrial control systems. These are information systems used to control industrial processes, such as manufacturing, product handling, production, and distribution.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 5677 (117th)",
            "First Name": "Bennie Thompson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 5677",
            "Bill Name": "5G SALE Act",
            "Summary": "This bill temporarily authorizes the Federal Communications Commission (FCC) to process applications for licenses or permits for the use of specified bands of the electromagnetic spectrum that were auctioned on or before March 9, 2023. The authorization terminates 90 days after the enactment of the bill.The FCC has not processed the licenses or permits for the previously auctioned spectrum because its authority to conduct auctions lapsed on March 9, 2023.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 4250 (117th)",
            "First Name": "Bennie Thompson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 4250 (117th)",
            "Bill Name": "War Crimes Rewards Expansion Act",
            "Summary": "This bill expands the Department of State's rewards program to authorize rewards for providing information leading to the arrest, conviction, or transfer of a foreign national accused of war crimes, crimes against humanity, or genocide as such crimes are defined under the law of an international criminal tribunal, the applicable country, or the United States. Currently, rewards are authorized for information leading to the arrest, conviction, or transfer of a foreign national accused of such crimes only as defined under the statutes of the relevant tribunal.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 2670",
            "First Name": "Bennie Thompson",
            "Vote": "Nay",
            "Bill Number.1": "H.R. 2670",
            "Bill Name": "National Defense Authorization Act for Fiscal Year 2024",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3537 (117th)",
            "First Name": "Bennie Thompson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3537 (117th)",
            "Bill Name": "Accelerating Access to Critical Therapies for ALS Act",
            "Summary": "This bill establishes grant programs to address neurodegenerative diseases, such as amyotrophic lateral sclerosis (also known as ALS or Lou Gehrig's disease), and contains other related provisions.The Department of Health and Human Services (HHS) shall award grants to eligible entities for scientific research utilizing data from expanded access to investigational ALS treatments for individuals who are not otherwise eligible for clinical trials. The Food and Drug Administration (FDA) shall award grants to public and private entities to cover the costs of research and development of drugs that diagnose or treat ALS and other rare neurodegenerative diseases.HHS shall also establish the Public-Private Partnership for Neurodegenerative Diseases between the National Institutes of Health, the FDA, and at least one eligible entity (generally, an institution of higher education or a nonprofit organization). The partnership shall support the development and regulatory review of drugs that address ALS and other rare neurodegenerative diseases.The FDA shall publish on its website a five-year action plan for fostering the development of drugs that improve or extend the lives of people living with rare neurodegenerative diseases.The Government Accountability Office must report to Congress about the grants provided under this bill, including an analysis of the impact of such grants on research and development of treatments for ALS.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3630 (117th)",
            "First Name": "Bennie Thompson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3630 (117th)",
            "Bill Name": "Lymphedema Treatment Act",
            "Summary": "This bill provides for Medicare coverage of lymphedema compression treatment items. Specifically, the bill provides for coverage of standard and custom fitted gradient compression garments and other approved items that are prescribed by a physician or other specified health care professional to treat lymphedema.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 884 (117th)",
            "First Name": "Bennie Thompson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 884 (117th)",
            "Bill Name": "National Aviation Preparedness Plan Act of 2022",
            "Summary": "This bill directs the Department of Transportation (DOT) to develop a national aviation preparedness plan for communicable disease outbreaks, including to (1) create a process to identify appropriate personal protective equipment to reduce the likelihood of exposure to a communicable disease that has the potential to cause an epidemic or pandemic of infectious disease that would constitute a public health emergency of international concern (i.e., a covered communicable disease); and (2) improve coordination between airports, air carriers, and governmental entities with respect to preparing for and responding to communicable disease outbreaks.In developing the plan, DOT must consult with aviation industry and labor stakeholders such as air carriers.The Government Accountability Office must conduct a study assessing the plan, including (1) whether the plan meets the obligations of the United States under international conventions and treaties, and (2) the extent to which the U.S. aviation system is prepared to respond to an outbreak of a covered communicable disease.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 4367",
            "First Name": "Bennie Thompson",
            "Vote": "Nay",
            "Bill Number.1": "H.R. 4367",
            "Bill Name": "Department of Homeland Security Appropriations Act, 2024",
            "Summary": "This bill provides FY2024 appropriations for the Department of Homeland Security (DHS).Specifically, the bill provides appropriations to DHS for Departmental Management, Intelligence, Situational Awareness, and Oversight, including the Office of the Secretary and Executive Management; the Management Directorate; Intelligence, Analysis, and Situational Awareness; and the Office of the Inspector General. In addition, the bill provides appropriations for Security, Enforcement, and Investigations, including U.S. Customs and Border Protection, U.S. Immigration and Customs Enforcement, the Transportation Security Administration, the U.S. Coast Guard, and the U.S. Secret Service. The bill provides appropriations for Protection, Preparedness, Response, and Recovery, including the Cybersecurity and Infrastructure Security Agency, and the Federal Emergency Management Agency (FEMA). The bill provides appropriations for Research, Development, Training, and Services, including U.S. Citizenship and Immigration Services, the Federal Law Enforcement Training Centers, the Science and Technology Directorate, and the Countering Weapons of Mass Destruction Office. The bill also sets forth requirements and restrictions for using funds provided by this and other appropriations acts.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 2220 (117th)",
            "First Name": "Bennie Thompson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 2220 (117th)",
            "Bill Name": "To amend title 40, United States Code, to modify the treatment of certain bargain-price options to purchase at less than fair market value, and for other purposes.",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 2225 (117th)",
            "First Name": "Bennie Thompson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 2225 (117th)",
            "Bill Name": "National Science Foundation for the Future Act",
            "Summary": "This bill reauthorizes the National Science Foundation (NSF) through FY2026 and authorizes programs and activities at the NSF.The bill establishes requirements for the NSF, including to enter into a contract with the National Academies of Science, Engineering, and Medicine to assess the status and opportunities for Pre-K through 12 science, technology, engineering, and mathematics, including computer science, (STEM) education research; award grants to establish no fewer than three multidisciplinary Centers for Transformative Education Research and Translation to support research and development of STEM education innovations; provide grants for research on programming that engages students in grades Pre-K through 8, including underrepresented and rural students, in STEM in order to prepare such students to pursue degrees or careers in STEM; award grants to support research and development activities to encourage greater collaboration and coordination between institutions of higher education and industry to enhance education, foster hands-on learning experiences, and improve alignment with workforce needs; award grants to establish a network of centers for science and technical education; award grants to advance research on the nature of learning and teaching at community colleges; award grants to establish traineeship programs for graduate students who pursue artificial intelligence-related research leading to a masters or doctorate degree; award grants to carry out research on the cyber workforce; establish a cybersecurity workforce data initiative; carry out a national initiative to facilitate the development of networks and partnerships to broaden participation in STEM studies and careers of groups historically underrepresented in such studies and careers; maintain a Research Security and Policy office to coordinate all research security policy issues across the NSF; award grants to support research to improve our understanding of the climate system and related human and environmental systems; support research to significantly advance our understanding of the food-energy-water system; award grants to advance knowledge of risk assessment and predictability to improve our ability to predict extreme events and natural hazards, including pandemics; and award grants to support basic research that will accelerate innovation to advance critical minerals mining strategies and technologies. The bill also establishes within the NSF a Directorate for Science and Engineering Solutions to advance research and development solutions to address societal and national challenges.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 7463",
            "First Name": "Bennie Thompson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 7463",
            "Bill Name": "Extension of Continuing Appropriations and Other Matters Act, 2024",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 6965 (117th)",
            "First Name": "Bennie Thompson",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 6965 (117th)",
            "Bill Name": "Visit America Act",
            "Summary": "This bill implements measures to support the U.S. travel and tourism industry and to address the declining percentage of international visitors to the United States.Specifically, the bill requires the Department of Commerce to develop a 10-year travel and tourism strategy with annual goals for the number of international visitors to the United States and for tourism commerce. The bill also establishes the role of Assistant Secretary of Commerce for Travel and Tourism, whose responsibilities shall include setting an annual goal for the number of international visitors to the United States and facilitating international business travel to the United States.Further, the assistant secretary must develop and implement a COVID-19 pandemic recovery strategy to assist the recovery of the U.S. travel and tourism industry.The bill also provides statutory authority for the United States Travel and Tourism Advisory Board, which shall aid the assistant secretary in developing and implementing the COVID-19 pandemic recovery strategy.",
            "Status": "Enacted"
        }
    ]
}