{
    "Name": "Bill Huizenga",
    "Profile": {
        "Public Office": {
            "Member of the U.S. House of Representativesfrom Michigan's 2nd district": {
                "Incumbent": "Incumbent",
                "Assumed office": "January 3, 2011",
                "Preceded by": "Pete Hoekstra",
                "District Info": {
                    "Median householdincome": "",
                    "Distribution": "",
                    "Population": "",
                    "Ethnicity": ""
                }
            },
            "Member of the Michigan House of Representativesfrom the 90th district": {
                "In office": "January 1, 2003 – January 1, 2009",
                "Preceded by": "Wayne Kuipers",
                "Succeeded by": "Joseph Haveman"
            }
        },
        "Personal Details": {
            "Personal details": {
                "Born": "William Patrick Huizenga (1969-01-31) January 31, 1969 (age 53)Zeeland, Michigan, U.S.",
                "Political party": "Republican",
                "Spouse": "Natalie Huizenga (m. 1993)",
                "Children": "5",
                "Education": "Calvin University (BA)",
                "Website": "House website"
            }
        }
    },
    "UnusedVotingRecords": [
        {
            "Bill Number": "H.R. 2911 (117th)",
            "First Name": "Bill Huizenga",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 2911 (117th)",
            "Bill Name": "VA Transparency & Trust Act of 2021",
            "Summary": "This bill requires the Department of Veterans Affairs (VA) to submit a plan for obligating and expending covered funds, which are funds made available to the VA for response to the COVID-19 pandemic.The bill requires the VA to submit biweekly reports regarding obligations, expenditures, and planned uses of the funds until seven days after the VA has expended all covered funds.The Inspector General of the VA must submit reports examining the obligations and expenditures made using covered funds during the specified reporting period.Finally, the Government Accountability Office must submit an interim report and final report containing a review of obligations and expenditures made using covered funds.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 92 (117th)",
            "First Name": "Bill Huizenga",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 92 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 110 Johnson Street in Pickens, South Carolina, as the \\u201cSpecialist Four Charles Johnson Post Office\\u201d.",
            "Summary": "This bill designates the facility of the United States Postal Service located at 110 Johnson Street in Pickens, South Carolina, as the Specialist Four Charles Johnson Post Office.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 91 (117th)",
            "First Name": "Bill Huizenga",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 91 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 810 South Pendleton Street in Easley, South Carolina, as the \\u201cPrivate First Class Barrett Lyle Austin Post Office Building\\u201d.",
            "Summary": "This bill designates the facility of the United States Postal Service located at 810 South Pendleton Street in Easley, South Carolina, as the Private First Class Barrett Lyle Austin Post Office Building.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1096",
            "First Name": "Bill Huizenga",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1096",
            "Bill Name": "250th Anniversary of the United States Marine Corps Commemorative Coin Act",
            "Summary": "This bill directs the Department of the Treasury to mint and issue not more than 50,000 $5 gold coins, 400,000 $1 silver coins, and 750,000 half-dollar clad coins emblematic of the 250th anniversary of the United States Marine Corps.All surcharges received by Treasury from the sale of such coins must be paid to the Marine Corps Heritage Foundation and shall only be used for the purposes of supporting the mission of the Marine Corps Heritage Center.",
            "Status": "Enacted",
            "Democrat_Yea": 0.9528301886792452,
            "Democrat_Nay": 0.0,
            "Republican_Yea": 0.9366515837104072,
            "Republican_Nay": 0.004524886877828
        },
        {
            "Bill Number": "H.R. 6386 (117th)",
            "First Name": "Bill Huizenga",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 6386 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 450 West Schaumburg Road in Schaumburg, Illinois, as the \\u201cVeterans of Iraq and Afghanistan Memorial Post Office Building\\u201d.",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 700 (117th)",
            "First Name": "Bill Huizenga",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 700 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 303 East Mississippi Avenue in Elwood, Illinois, as the \\u201cLawrence M. \\u2018Larry\\u2019 Walsh Sr. Post Office\\u201d.",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 5900 (117th)",
            "First Name": "Bill Huizenga",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 5900 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 2016 East 1st Street in Los Angeles, California, as the \\u201cMarine Corps Reserve PVT Jacob Cruz Post Office\\u201d.",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 224 (117th)",
            "First Name": "Bill Huizenga",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 224 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 5302 Galveston Road in Houston, Texas, as the Vanessa Guill\\u00e9n Post Office Building.",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1437 (117th)",
            "First Name": "Bill Huizenga",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1437 (117th)",
            "Bill Name": "Further Continuing Appropriations and Extensions Act, 2023",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 7077 (117th)",
            "First Name": "Bill Huizenga",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 7077 (117th)",
            "Bill Name": "Empowering the U.S. Fire Administration Act",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 935 (117th)",
            "First Name": "Bill Huizenga",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 935 (117th)",
            "Bill Name": "Small Business Mergers, Acquisitions, Sales, and Brokerage Simplification Act of 2021",
            "Summary": "This bill exempts from securities registration requirements certain merger-and-acquisition brokers that facilitate transfer of ownership in privately held companies with earnings or revenues under a specified threshold. However, this exemption shall not apply to certain brokers, including those that provide financing related to the transfer of ownership, engage on behalf of any party in a transaction involving specified shell companies, or have been barred or suspended from association with a broker or dealer.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3672",
            "First Name": "Bill Huizenga",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3672",
            "Bill Name": "To designate the clinic of the Department of Veterans Affairs in Indian River, Michigan, as the \\u201cPfc. Justin T. Paton Department of Veterans Affairs Clinic\\u201d.",
            "Summary": NaN,
            "Status": "Enacted",
            "Democrat_Yea": 0.9386792452830188,
            "Democrat_Nay": 0.0,
            "Republican_Yea": 0.9502262443438914,
            "Republican_Nay": 0.0
        },
        {
            "Bill Number": "H.R. 1899 (117th)",
            "First Name": "Bill Huizenga",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1899 (117th)",
            "Bill Name": "Ensuring Compliance Against Drug Diversion Act of 2021",
            "Summary": "This bill provides statutory authority for certain regulations governing the modification, transfer, and termination of a registration to manufacture, distribute, or dispense controlled substances. It terminates the registration of individuals and entities when they die, cease legal existence, discontinue business, or surrender such registration. It sets forth notification requirements, as well as conditions for transferring or assigning a registration.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1762 (117th)",
            "First Name": "Bill Huizenga",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1762 (117th)",
            "Bill Name": "Protecting Indian Tribes from Scams Act",
            "Summary": "This bill requires the Federal Trade Commission (FTC), after consultation with Indian tribes, to report on unfair or deceptive practices that target tribes or tribal members. The FTC must submit the report to Congress and make it publicly available. Further, the FTC must update its website to include information for consumers and businesses on identifying and avoiding unfair or deceptive practices that target tribes or tribal members.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1002 (117th)",
            "First Name": "Bill Huizenga",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1002 (117th)",
            "Bill Name": "DEBAR Act of 2021",
            "Summary": "This bill authorizes the Drug Enforcement Administration (DEA) to bar an entity from registering to manufacture, distribute, or dispense controlled substances under certain circumstances.Specifically, the DEA may bar—temporarily or permanently—the registration of an entity that (1) meets or has met any condition for suspension or revocation of the registration, and (2) has a history of prior suspensions or revocations.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 941 (117th)",
            "First Name": "Bill Huizenga",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 941 (117th)",
            "Bill Name": "TRANSPLANT Act of 2021",
            "Summary": "This bill modifies and reauthorizes through FY2026 the C.W. Bill Young Cell Transplantation Program, which provides support to patients who need a potentially life-saving bone marrow transplant or umbilical cord blood transplant.The bill also requires the Department of Health and Human Services to conduct a periodic review of the science of using adult stem cells and birthing tissues in therapeutic treatments.In addition, the Government Accountability Office must report on the regenerative medicine workforce.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1460 (117th)",
            "First Name": "Bill Huizenga",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1460 (117th)",
            "Bill Name": "Nicholas and Zachary Burt Memorial Carbon Monoxide Poisoning Prevention Act of 2021",
            "Summary": "This bill directs the Consumer Product Safety Commission to award grants to states and tribal organizations to install carbon monoxide alarms in the homes of low-income families and older adults and facilities that commonly serve children or older adults. Such carbon monoxide alarms must comply with specified standards.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1215 (117th)",
            "First Name": "Bill Huizenga",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1215 (117th)",
            "Bill Name": "Fraud and Scam Reduction Act",
            "Summary": "This bill expands activities to address mail, telephone, and internet fraud, particularly such scams targeting older adults.The bill establishes a Senior Scams Prevention Advisory Group, which must create model educational materials to educate employees of retailers, financial-services companies, and wire-transfer companies on how to identify and prevent scams that affect older adults.Further, the Federal Trade Commission (FTC) must establish an advisory office in the Bureau of Consumer Protection to assist the FTC in monitoring scams targeting older adults, educating consumers, and receiving complaints.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 172 (117th)",
            "First Name": "Bill Huizenga",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 172 (117th)",
            "Bill Name": "United States Anti-Doping Agency Reauthorization Act of 2021",
            "Summary": "This bill authorizes appropriations for the U.S. Anti-Doping Agency (USADA) through FY2030.The bill adds requirements that USADA be responsible for certifying in advance any testing conducted by international organizations under the World Anti-Doping Code for international amateur athletes and athletic competitions occurring within the jurisdiction of the United States; and promote a positive youth sport experience by using a portion of its funding to provide educational materials on sportsmanship, character building, and healthy performance for those participating in youth sports. The bill requires any action taken by USADA to enforce a policy, procedure, or requirement against a person with respect to a violation of federal law, including an investigation, disciplinary action, sanction, or any other administrative action, to be carried out in a manner that provides due process protection.The Department of Justice, the Department of Homeland Security, and the Food and Drug Administration must provide to USADA information relating to the prevention of the use of performance-enhancing drugs or the prohibition of performance-enhancing methods.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1868 (117th)",
            "First Name": "Bill Huizenga",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1868 (117th)",
            "Bill Name": "To prevent across-the-board direct spending cuts, and for other purposes.",
            "Summary": "This bill makes several budgetary and technical changes to provisions under Medicare and Medicaid. The bill continues to exempt Medicare from sequestration until December 31, 2021. (Sequestration is a process of automatic, usually across-the-board spending reductions under which budgetary resources are permanently cancelled to enforce specific budget policy goals.)The bill also specifically applies certain modified payment limits to rural health clinics that temporarily enrolled in Medicare during the public health emergency relating to COVID-19 (i.e., coronavirus disease 2019) or that applied to enroll by December 31, 2020; and preserves higher Medicaid disproportionate-share hospital payments for public hospitals in California under forthcoming payment methodology changes.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1868 (117th)",
            "First Name": "Bill Huizenga",
            "Vote": "Nay",
            "Bill Number.1": "H.R. 1868 (117th)",
            "Bill Name": "To prevent across-the-board direct spending cuts, and for other purposes.",
            "Summary": "This bill makes several budgetary and technical changes to provisions under Medicare and Medicaid. The bill continues to exempt Medicare from sequestration until December 31, 2021. (Sequestration is a process of automatic, usually across-the-board spending reductions under which budgetary resources are permanently cancelled to enforce specific budget policy goals.)The bill also specifically applies certain modified payment limits to rural health clinics that temporarily enrolled in Medicare during the public health emergency relating to COVID-19 (i.e., coronavirus disease 2019) or that applied to enroll by December 31, 2020; and preserves higher Medicaid disproportionate-share hospital payments for public hospitals in California under forthcoming payment methodology changes.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3746",
            "First Name": "Bill Huizenga",
            "Vote": "Aye",
            "Bill Number.1": "H.R. 3746",
            "Bill Name": "Fiscal Responsibility Act of 2023",
            "Summary": NaN,
            "Status": "Enacted",
            "Democrat_Yea": 0.9166666666666666,
            "Democrat_Nay": 0.0833333333333333,
            "Republican_Yea": 0.3469387755102041,
            "Republican_Nay": 0.6326530612244898
        },
        {
            "Bill Number": "H.R. 7276 (117th)",
            "First Name": "Bill Huizenga",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 7276 (117th)",
            "Bill Name": "Ukraine Invasion War Crimes Deterrence and Accountability Act",
            "Summary": "This bill requires the President to report to Congress on atrocities committed during Russia's invasion of Ukraine since February 24, 2022.Specifically, the report must describe in detail (1) U.S. government efforts to collect, analyze, and preserve evidence related to war crimes and other atrocities committed during the invasion; (2) media, public diplomacy, and information operations to make the Russian people, including their military and political leaders, aware of efforts to identify and prosecute those responsible for such atrocities; and (3) the process for a domestic, foreign, or international court or tribunal to obtain information from the U.S. government related to such atrocities.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1652 (117th)",
            "First Name": "Bill Huizenga",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1652 (117th)",
            "Bill Name": "VOCA Fix to Sustain the Crime Victims Fund Act of 2021",
            "Summary": "This bill adds a new source of revenue for the Crime Victims Fund and makes changes to formula grants supported by the fund.Specifically, the bill directs revenues collected from deferred prosecution and non-prosecution agreements to be deposited into the Crime Victims Fund. Currently, such revenues are deposited into the general fund of the Treasury.Additionally, the bill increases the percentage—from 60% to 75%—of state compensation payments to crime victims in the prior fiscal year used to calculate formula grants for state victim compensation programs.Finally, the bill directs states to waive the matching requirement for recipients of state victim assistance formula grants during and for one year after a pandemic-related national emergency. It also allows states to waive the matching requirement pursuant to a policy established by the state.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1085 (117th)",
            "First Name": "Bill Huizenga",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1085 (117th)",
            "Bill Name": "To award three congressional gold medals to the United States Capitol Police and those who protected the U.S. Capitol on January 6, 2021.",
            "Summary": "This bill directs the Speaker of the House and the President pro tempore of the Senate to arrange for the award of three Congressional Gold Medals to the U.S. Capitol Police (USCP) and other law enforcement agencies that protected the U.S. Capitol on January 6, 2021.Following the award of these medals, one medal shall be given to the USCP, one medal shall be given to the Metropolitan Police Department of the District of Columbia, and one medal shall be given to the Smithsonian Institution and displayed with a plaque listing all law enforcement agencies that participated in protecting the Capitol on January 6, 2021.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1651 (117th)",
            "First Name": "Bill Huizenga",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1651 (117th)",
            "Bill Name": "COVID-19 Bankruptcy Relief Extension Act of 2021",
            "Summary": "This bill extends existing provisions that provide relief to debtors in bankruptcy, including those related to the COVID-19 (i.e., coronavirus disease 2019) pandemic.These provisions (1) exclude certain COVID-19 aid payments from income for the purposes of bankruptcy, and (2) increase the debt eligibility threshold for businesses qualifying for certain types of Chapter 11 reorganization bankruptcy. Currently, these provisions expire March 27, 2021. The bill extends these provisions for one year.The bill also allows for modification of a Chapter 13 repayment plan for plans confirmed before the date of enactment of this bill if the debtor is experiencing material financial hardship due to COVID-19. Currently, such a modification is only available for plans confirmed before March 27, 2020.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1799 (117th)",
            "First Name": "Bill Huizenga",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1799 (117th)",
            "Bill Name": "PPP Extension Act of 2021",
            "Summary": "This bill extends the Paycheck Protection Program, established to support small businesses in response to COVID-19 (i.e., coronavirus disease 2019), through June 30, 2021. Currently, the program is set to expire on March 31, 2021.For the final 30 days of the program (i.e., from June 1 until June 30), the Small Business Administration may only process applications submitted prior to June 1, and it may not accept any new loan applications.The bill excludes the budgetary effects of this bill from PAYGO scorecards under the Statutory Pay-As-You-Go Act of 2010 and from Senate PAYGO scorecards.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1218 (117th)",
            "First Name": "Bill Huizenga",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1218 (117th)",
            "Bill Name": "Data Mapping to Save Moms\\u2019 Lives Act",
            "Summary": "This bill directs the Federal Communications Commission (FCC) to include data on certain maternal health outcomes in its broadband health mapping tool. This is an online platform that allows users to visualize, overlay, and analyze broadband and health data at national, state, and county levels.The FCC must consult with the Centers for Disease Control and Prevention to determine which maternal health outcomes should be incorporated.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1319 (117th)",
            "First Name": "Bill Huizenga",
            "Vote": "Nay",
            "Bill Number.1": "H.R. 1319 (117th)",
            "Bill Name": "American Rescue Plan Act of 2021",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 6833 (117th)",
            "First Name": "Bill Huizenga",
            "Vote": "Nay",
            "Bill Number.1": "H.R. 6833 (117th)",
            "Bill Name": "Continuing Appropriations and Ukraine Supplemental Appropriations Act, 2023",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1734",
            "First Name": "Bill Huizenga",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1734",
            "Bill Name": "TRANQ Research Act of 2023",
            "Summary": "This bill requires the National Institute of Standards and Technology (NIST) to support research and other activities related to identifying xylazine (a compound used in veterinary medicine as a nonopioid tranquilizer), novel synthetic opioids, and other new psychoactive substances.In particular, NIST must support basic measurement science and research; near-real time spectrometry capabilities (i.e., a technique for rapidly identifying the chemical composition of a substance); strategies and voluntary best practices for handling, transporting, and analyzing such substances; and collaboration with other government agencies, institutions of higher education, and the private sector to enhance relevant narcotic and opioid detection and analysis capabilities. Additionally, the Government Accountability Office must conduct a study on the capabilities of the federal government to detect, identify, and otherwise respond to threats of new psychoactive substances, such as xylazine.",
            "Status": "Enacted",
            "Democrat_Yea": 0.9671361502347418,
            "Democrat_Nay": 0.0,
            "Republican_Yea": 0.9864864864864864,
            "Republican_Nay": 0.0
        },
        {
            "Bill Number": "H.R. 2954 (117th)",
            "First Name": "Bill Huizenga",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 2954 (117th)",
            "Bill Name": "Securing a Strong Retirement Act of 2021",
            "Summary": "This bill makes various changes with respect to employer-sponsored retirement plans, including providing for the automatic enrollment of employees in certain plans and increasing the age at which participants are required to begin receiving mandatory distributions.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3359 (117th)",
            "First Name": "Bill Huizenga",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3359 (117th)",
            "Bill Name": "Homicide Victims\\u2019 Families\\u2019 Rights Act of 2021",
            "Summary": "This bill establishes a framework for immediate family members of a victim of murder under federal law to request a review of the victim's case file if the murder was committed more than three years prior, the murder was investigated by a federal law enforcement entity, all probative investigative leads have been exhausted, and no likely perpetrator has been identified.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3197 (117th)",
            "First Name": "Bill Huizenga",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3197 (117th)",
            "Bill Name": "Save the Liberty Theatre Act of 2021",
            "Summary": NaN,
            "Status": NaN
        },
        {
            "Bill Number": "H.R. 3113 (117th)",
            "First Name": "Bill Huizenga",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3113 (117th)",
            "Bill Name": "Modernizing Access to Our Public Land Act",
            "Summary": "This bill directs the Department of the Interior, the Forest Service, and the U.S. Army Corps of Engineers to jointly develop and adopt interagency standards to ensure compatibility and interoperability among federal databases for the collection and dissemination of outdoor recreation data related to federal lands and used to depict locations at which recreation uses are available to the public.Interior, the Forest Service, and the Corps of Engineers must digitize and publish geographic information system data that includes federal interests, including easements and rights-of-way, in private land; status information as to whether roads and trails are open or closed; the dates on which roads and trails are seasonally opened and closed; the types of vehicles and recreational uses that are allowed on each segment of roads and trails; and the boundaries of areas where hunting or recreational shooting is permanently restricted or closed. Interior, the Forest Service, and the Corps of Engineers may work with the U.S. Geological Survey to collect, digitize, standardize, or publish data to meet the requirements of this bill.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1319 (117th)",
            "First Name": "Bill Huizenga",
            "Vote": "Nay",
            "Bill Number.1": "H.R. 1319 (117th)",
            "Bill Name": "American Rescue Plan Act of 2021",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1192 (117th)",
            "First Name": "Bill Huizenga",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1192 (117th)",
            "Bill Name": "PRRADA",
            "Summary": "This bill requires professionals employed in debt adjustment cases involving Puerto Rico to file verified statements disclosing their connections with interested parties before seeking compensation for their services.The Financial Oversight and Management Board for Puerto Rico must establish a list of such interested parties, which shall include the debtor, creditors, any attorney or accountant of the debtor or creditors, persons employed by the U.S. Trustee Program, persons employed by the board, and any other interested party.Compensation may be denied to such a professional if these disclosures are not filed, are inadequate, or if the professional is found to have certain conflicts of interest.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 2471 (117th)",
            "First Name": "Bill Huizenga",
            "Vote": "Nay",
            "Bill Number.1": "H.R. 2471 (117th)",
            "Bill Name": "Consolidated Appropriations Act, 2022",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 2471 (117th)",
            "First Name": "Bill Huizenga",
            "Vote": "Nay",
            "Bill Number.1": "H.R. 2471 (117th)",
            "Bill Name": "Consolidated Appropriations Act, 2022",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 208 (117th)",
            "First Name": "Bill Huizenga",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 208 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 500 West Main Street, Suite 102 in Tupelo, Mississippi, as the Colonel Carlyle Smitty Harris Post Office.",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 55 (117th)",
            "First Name": "Bill Huizenga",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 55 (117th)",
            "Bill Name": "Emmett Till Antilynching Act",
            "Summary": "This bill makes lynching a federal hate crime offense.Specifically, the bill imposes criminal penalties—a fine, a prison term of up to 30 years, or both—on an individual who conspires to commit a hate crime offense that results in death or serious bodily injury or that includes kidnapping or an attempt to kidnap, aggravated sexual abuse or an attempt to commit aggravated sexual abuse, or an attempt to kill.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3539 (117th)",
            "First Name": "Bill Huizenga",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3539 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 223 West Chalan Santo Papa in Hagatna, Guam, as the \\u201cAtanasio Taitano Perez Post Office\\u201d.",
            "Summary": "This bill designates the facility of the United States Postal Service located at 223 West Chalan Santo Papa in Hagatna, Guam, as the Atanasio Taitano Perez Post Office.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 735 (117th)",
            "First Name": "Bill Huizenga",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 735 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 502 East Cotati Avenue in Cotati, California, as the \\u201cArturo L. Ibleto Post Office Building\\u201d.",
            "Summary": "This bill designates the facility of the United States Postal Service located at 502 East Cotati Avenue in Cotati, California, as the Arturo L. Ibleto Post Office Building.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3076 (117th)",
            "First Name": "Bill Huizenga",
            "Vote": "Nay",
            "Bill Number.1": "H.R. 3076 (117th)",
            "Bill Name": "Postal Service Reform Act of 2022",
            "Summary": "This bill addresses the finances and operations of the U.S. Postal Service (USPS).The bill requires the Office of Personnel Management (OPM) to establish the Postal Service Health Benefits Program within the Federal Employees Health Benefits Program under which OPM may contract with carriers to offer health benefits plans for USPS employees and retirees.The bill provides for coordinated enrollment of retirees under this program and Medicare.The bill repeals the requirement that the USPS annually prepay future retirement health benefits.Additionally, the USPS may establish a program to enter into agreements with an agency of any state government, local government, or tribal government, and with other government agencies, to provide certain nonpostal products and services that reasonably contribute to the costs of the USPS and meet other specified criteria.The USPS must develop and maintain a publicly available dashboard to track service performance and must report regularly on its operations and financial condition.The Postal Regulatory Commission must annually submit to the USPS a budget of its expenses. It must also conduct a study to identify the causes and effects of postal inefficiencies relating to flats (e.g., large envelopes).The USPS Office of Inspector General shall perform oversight of the Postal Regulatory Commission.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 2324 (117th)",
            "First Name": "Bill Huizenga",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 2324 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 2800 South Adams Street in Tallahassee, Florida, as the \\u201cD. Edwina Stephens Post Office\\u201d.",
            "Summary": "This bill designates the facility of the United States Postal Service located at 2800 South Adams Street in Tallahassee, Florida, as the D. Edwina Stephens Post Office.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 335 (117th)",
            "First Name": "Bill Huizenga",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 335 (117th)",
            "Bill Name": "To provide for an exception to a limitation against appointment of persons as Secretary of Defense within seven years of relief from active duty as a regular commissioned officer of the Armed Forces.",
            "Summary": "This bill allows the first person nominated and appointed as Secretary of Defense after 12 p.m. (Eastern Standard Time) on January 20, 2021, to be a person who is, on the date of appointment, at least four years after relief from active duty as a commissioned officer of a regular component of the Armed Forces. Under current law, an individual may not be appointed as Secretary of Defense within seven years after relief from such active duty.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 22 (117th)",
            "First Name": "Bill Huizenga",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 22 (117th)",
            "Bill Name": "Congressional Budget Justification Transparency Act of 2021",
            "Summary": "This bill requires federal agencies to make budget justification materials available to the public on a website. The bill also requires the Office of Management and Budget to make certain details regarding the materials available to the public, including a list of the agencies that submit budget justification materials to Congress, the dates that the materials are submitted to Congress and posted online, and links to the materials.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1226",
            "First Name": "Bill Huizenga",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1226",
            "Bill Name": "Wounded Warrior Access Act",
            "Summary": NaN,
            "Status": "Enacted",
            "Democrat_Yea": 0.9575471698113208,
            "Democrat_Nay": 0.0,
            "Republican_Yea": 0.9864864864864864,
            "Republican_Nay": 0.0
        },
        {
            "Bill Number": "H.R. 5577 (117th)",
            "First Name": "Bill Huizenga",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 5577 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 3900 Crown Road Southwest in Atlanta, Georgia, as the \\u201cJohn R. Lewis Post Office Building\\u201d.",
            "Summary": "This bill designates the facility of the United States Postal Service located at 3900 Crown Road Southwest in Atlanta, Georgia, as the John R. Lewis Post Office Building.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 346",
            "First Name": "Bill Huizenga",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 346",
            "Bill Name": "NOTAM Improvement Act of 2023",
            "Summary": "This bill directs the Federal Aviation Administration (FAA) to establish the FAA Task Force on NOTAM (notice to air missions required by international or domestic law) Improvement and requires the FAA to implement a federal NOTAM system. A NOTAM is a notice containing information essential to personnel concerned with flight operations but not known far enough in advance to be publicized by other means. It states the abnormal status of a component of the National Airspace System.Specifically, the task force must (1) review existing methods for publishing NOTAMs and flight operations information for pilots; (2) review regulations, policies, systems, and international standards relating to NOTAMs, including their content and presentation to pilots; (3) evaluate and determine best practices to organize, prioritize, and present flight operations information in a manner that optimizes pilot review and retention of relevant information; (4) provide recommendations to improve the publication and delivery of NOTAM information; and (5) report to Congress on its reviews and evaluations.By September 30, 2024, the FAA must (1) complete implementation of a federal NOTAM system and implement a back-up system, and (2) brief Congress on a plan to enhance information delivery through this federal system to promote further global harmonization and provide users of the National Airspace System a consistent format for domestic and international operations.",
            "Status": "Enacted",
            "Democrat_Yea": 0.9764150943396226,
            "Democrat_Nay": 0.0,
            "Republican_Yea": 0.9774774774774776,
            "Republican_Nay": 0.018018018018018
        }
    ],
    "CosponsoredBills": [
        {
            "Bill Number": "H.R. 5892",
            "First Name": "Bill  Huizenga",
            "Last Name": "cosponsor",
            "Role": "H.R. 5892",
            "Bill Name": "To designate the Federal building located at 985 Michigan Avenue in Detroit, Michigan, as the \\u201cRosa Parks Federal Building\\u201d, and for other purposes.",
            "Subject Areas": "Government Operations and Politics",
            "Summary": NaN
        },
        {
            "Bill Number": "H.R. 3672",
            "First Name": "Bill  Huizenga",
            "Last Name": "cosponsor",
            "Role": "H.R. 3672",
            "Bill Name": "To designate the clinic of the Department of Veterans Affairs in Indian River, Michigan, as the \\u201cPfc. Justin T. Paton Department of Veterans Affairs Clinic\\u201d.",
            "Subject Areas": NaN,
            "Summary": NaN
        },
        {
            "Bill Number": "H.R. 1096",
            "First Name": "Bill  Huizenga",
            "Last Name": "cosponsor",
            "Role": "H.R. 1096",
            "Bill Name": "250th Anniversary of the United States Marine Corps Commemorative Coin Act",
            "Subject Areas": "Military personnel and dependents",
            "Summary": "This bill directs the Department of the Treasury to mint and issue not more than 50,000 $5 gold coins, 400,000 $1 silver coins, and 750,000 half-dollar clad coins emblematic of the 250th anniversary of the United States Marine Corps.All surcharges received by Treasury from the sale of such coins must be paid to the Marine Corps Heritage Foundation and shall only be used for the purposes of supporting the mission of the Marine Corps Heritage Center."
        },
        {
            "Bill Number": "H.R. 7518 (117th)",
            "First Name": "Bill  Huizenga",
            "Last Name": "cosponsor",
            "Role": "H.R. 7518 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 23200 John R Road in Hazel Park, Michigan, as the \\u201cRoy E. Dickens Post Office\\u201d.",
            "Subject Areas": NaN,
            "Summary": NaN
        },
        {
            "Bill Number": "H.R. 7519 (117th)",
            "First Name": "Bill  Huizenga",
            "Last Name": "cosponsor",
            "Role": "H.R. 7519 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 2050 South Boulevard in Bloomfield Township, Michigan, as the \\u201cDr. Ezra S. Parke Post Office Building\\u201d.",
            "Subject Areas": NaN,
            "Summary": NaN
        },
        {
            "Bill Number": "H.R. 310 (117th)",
            "First Name": "Bill  Huizenga",
            "Last Name": "cosponsor",
            "Role": "H.R. 310 (117th)",
            "Bill Name": "To posthumously award the Congressional Gold Medal, collectively, to Glen Doherty, Tyrone Woods, J. Christopher Stevens, and Sean Smith, in recognition of their contributions to the Nation.",
            "Subject Areas": "Intelligence activities, surveillance, classified information, Law enforcement officers, Libya, Middle East, Terrorism, Veterans' organizations and recognition",
            "Summary": NaN
        },
        {
            "Bill Number": "H.R. 7903 (117th)",
            "First Name": "Bill  Huizenga",
            "Last Name": "cosponsor",
            "Role": "H.R. 7903 (117th)",
            "Bill Name": "To designate the Department of Veterans Affairs community-based outpatient clinic located in Canton, Michigan, as the \\u201cMajor General Oliver W. Dillard VA Clinic\\u201d.",
            "Subject Areas": NaN,
            "Summary": NaN
        },
        {
            "Bill Number": "H.R. 1193 (117th)",
            "First Name": "Bill  Huizenga",
            "Last Name": "cosponsor",
            "Role": "H.R. 1193 (117th)",
            "Bill Name": "Cardiovascular Advances in Research and Opportunities Legacy Act",
            "Subject Areas": "Health, Advanced technology and technological innovations, Cardiovascular and respiratory health, Government information and archives, Health information and medical records, Health programs administration and funding, Health promotion and preventive care, Health technology, devices, supplies, Medical research, Medical tests and diagnostic methods, Photography and imaging, Research administration and funding",
            "Summary": NaN
        },
        {
            "Bill Number": "H.R. 6614 (117th)",
            "First Name": "Bill  Huizenga",
            "Last Name": "cosponsor",
            "Role": "H.R. 6614 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 4744 Grand River Avenue in Detroit, Michigan, as the \\u201cRosa Louise McCauley Parks Post Office Building\\u201d.",
            "Subject Areas": NaN,
            "Summary": NaN
        },
        {
            "Bill Number": "H.R. 3630 (117th)",
            "First Name": "Bill  Huizenga",
            "Last Name": "cosponsor",
            "Role": "H.R. 3630 (117th)",
            "Bill Name": "Lymphedema Treatment Act",
            "Subject Areas": "Health, Labor and Employment, Cardiovascular and respiratory health, Health care coverage and access, Immunology and vaccination, Medicare",
            "Summary": "This bill provides for Medicare coverage of lymphedema compression treatment items. Specifically, the bill provides for coverage of standard and custom fitted gradient compression garments and other approved items that are prescribed by a physician or other specified health care professional to treat lymphedema."
        },
        {
            "Bill Number": "H.R. 4693 (117th)",
            "First Name": "Bill  Huizenga",
            "Last Name": "cosponsor",
            "Role": "H.R. 4693 (117th)",
            "Bill Name": "Global Malnutrition Prevention and Treatment Act of 2021",
            "Subject Areas": "International Affairs, Child health, Congressional oversight, Executive agency funding and structure, Food assistance and relief, Foreign aid and international relief, Health programs administration and funding, Health promotion and preventive care, International organizations and cooperation, Multilateral development programs, Nutrition and diet, Performance measurement, U.S. Agency for International Development (USAID), Women's education, World health",
            "Summary": NaN
        },
        {
            "Bill Number": "H.R. 5577 (117th)",
            "First Name": "Bill  Huizenga",
            "Last Name": "cosponsor",
            "Role": "H.R. 5577 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 3900 Crown Road Southwest in Atlanta, Georgia, as the \\u201cJohn R. Lewis Post Office Building\\u201d.",
            "Subject Areas": "Government Operations and Politics, Congressional tributes, Georgia, Government buildings, facilities, and property, Postal service",
            "Summary": "This bill designates the facility of the United States Postal Service located at 3900 Crown Road Southwest in Atlanta, Georgia, as the John R. Lewis Post Office Building."
        },
        {
            "Bill Number": "H.R. 8656 (117th)",
            "First Name": "Bill  Huizenga",
            "Last Name": "cosponsor",
            "Role": "H.R. 8656 (117th)",
            "Bill Name": "To designate the clinic of the Department of Veterans Affairs in Mishawaka, Indiana, as the \\u201cJackie Walorski VA Clinic\\u201d.",
            "Subject Areas": "Armed Forces and National Security, Congressional tributes, Department of Veterans Affairs, Government buildings, facilities, and property, Health facilities and institutions, Indiana, Veterans' medical care",
            "Summary": NaN
        },
        {
            "Bill Number": "H.R. 3613 (117th)",
            "First Name": "Bill  Huizenga",
            "Last Name": "cosponsor",
            "Role": "H.R. 3613 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 202 Trumbull Street in Saint Clair, Michigan, as the \\u201cCorporal Jeffrey Robert Standfest Post Office Building\\u201d.",
            "Subject Areas": NaN,
            "Summary": "This bill designates the facility of the United States Postal Service located at 202 Trumbull Street in Saint Clair, Michigan, as the Corporal Jeffrey Robert Standfest Post Office Building."
        },
        {
            "Bill Number": "H.R. 1057 (117th)",
            "First Name": "Bill  Huizenga",
            "Last Name": "cosponsor",
            "Role": "H.R. 1057 (117th)",
            "Bill Name": "Greatest Generation Commemorative Coin Act",
            "Subject Areas": "Finance and Financial Sector, Conflicts and wars, Currency, Military history, Monuments and memorials, U.S. history, Veterans' organizations and recognition",
            "Summary": "This bill directs the Department of the Treasury to mint and issue up to 50,000 $5 coins, 400,000 $1 silver coins, and 750,000 half-dollar clad coins in commemoration of the National World War II Memorial in the District of Columbia.The design of the coins shall be emblematic of the memorial and the service and sacrifice of American soldiers and civilians during World War II.All surcharges received from the sale of such coins shall be paid to the Friends of the National World War II Memorial to support the National Park Service in maintaining and repairing the memorial, and for educational and commemorative programs."
        },
        {
            "Bill Number": "H.R. 5142 (117th)",
            "First Name": "Bill  Huizenga",
            "Last Name": "cosponsor",
            "Role": "H.R. 5142 (117th)",
            "Bill Name": "To award posthumously a Congressional Gold Medal, in commemoration to the servicemembers who perished in Afghanistan on August 26, 2021, during the evacuation of citizens of the United States and Afghan allies at Hamid Karzai Internati",
            "Subject Areas": "Armed Forces and National Security, International Affairs, Afghanistan, Asia, Conflicts and wars, Congressional tributes, Emergency planning and evacuation, Military operations and strategy, Military personnel and dependents, Museums, exhibitions, cultural centers, Smithsonian Institution, Terrorism",
            "Summary": "This bill posthumously provides for the award of a Congressional Gold Medal in commemoration of the 13 service members who died on August 26, 2021, while stationed at Hamid Karzai International Airport in Afghanistan."
        },
        {
            "Bill Number": "H.R. 1448 (117th)",
            "First Name": "Bill  Huizenga",
            "Last Name": "cosponsor",
            "Role": "H.R. 1448 (117th)",
            "Bill Name": "PAWS for Veterans Therapy Act",
            "Subject Areas": "Armed Forces and National Security, Animal protection and human-animal relationships, Congressional oversight, Disability assistance, Government information and archives, Government studies and investigations, Health programs administration and funding, Mammals, Mental health, Neurological disorders, Service animals, Veterans' education, employment, rehabilitation, Veterans' medical care",
            "Summary": "This bill implements a program and a policy related to service dog therapy for veterans. Specifically, the bill requires the Department of Veterans Affairs (VA) to implement a five-year pilot program to provide canine training to eligible veterans diagnosed with post-traumatic stress disorder as an element of a complementary and integrative health program. Eligible veterans are those who are enrolled in the VA health care system and have been recommended for participation by a qualified mental health care provider or clinical team.The VA must seek to enter agreements containing specified elements with accredited nongovernmental entities that have demonstrated ability to provide canine training.Veterans who participate in the program are authorized to adopt the dog they assisted in training if their health provider determines it is in the best interest of the veteran.The VA must establish processes to document and track the progress of participating veterans with respect to health benefits and improvements. The Government Accountability Office must brief Congress and submit a report on the program.The bill also authorizes the VA to provide service dogs to veterans with mental illnesses, regardless of whether they have a mobility impairment."
        },
        {
            "Bill Number": "H.R. 3642 (117th)",
            "First Name": "Bill  Huizenga",
            "Last Name": "cosponsor",
            "Role": "H.R. 3642 (117th)",
            "Bill Name": "Harlem Hellfighters Congressional Gold Medal Act",
            "Subject Areas": "Armed Forces and National Security, Conflicts and wars, Congressional tributes, Military history, Military personnel and dependents, Museums, exhibitions, cultural centers, New York State, Racial and ethnic relations, Smithsonian Institution, Veterans' organizations and recognition",
            "Summary": "This bill provides for the award of a Congressional Gold Medal to the 369th Infantry Regiment, commonly known as the Harlem Hellfighters, in recognition of their bravery and outstanding service during World War I."
        },
        {
            "Bill Number": "H.R. 4498 (117th)",
            "First Name": "Bill  Huizenga",
            "Last Name": "cosponsor",
            "Role": "H.R. 4498 (117th)",
            "Bill Name": "To make emergency appropriations to the National Guard.",
            "Subject Areas": "Armed Forces and National Security, Appropriations, Assault and harassment offenses, Civil disturbances, Crimes against property, Defense spending, Department of Defense, Executive agency funding and structure, Government buildings, facilities, and property, Military personnel and dependents, National Guard and reserves, Protest and dissent, Subversive activities, Terrorism, U.S. Capitol, Violent crime",
            "Summary": "This bill provides supplemental FY2021 appropriations to the National Guard for its response to the events at the U.S. Capitol on January 6, 2021. The bill designates the funding as emergency spending, which is exempt from discretionary spending limits."
        },
        {
            "Bill Number": "H.R. 3577 (117th)",
            "First Name": "Bill  Huizenga",
            "Last Name": "cosponsor",
            "Role": "H.R. 3577 (117th)",
            "Bill Name": "United States Army Rangers Veterans of World War II Congressional Gold Medal Act",
            "Subject Areas": "Armed Forces and National Security, Conflicts and wars, Congressional tributes, Military history, Museums, exhibitions, cultural centers, Smithsonian Institution, Veterans' organizations and recognition",
            "Summary": "This bill provides for the award of a single Congressional Gold Medal to the U.S. Army Rangers Veterans of World War II in recognition of their dedicated service during World War II."
        },
        {
            "Bill Number": "H.R. 3537 (117th)",
            "First Name": "Bill  Huizenga",
            "Last Name": "cosponsor",
            "Role": "H.R. 3537 (117th)",
            "Bill Name": "Accelerating Access to Critical Therapies for ALS Act",
            "Subject Areas": "Health, Drug safety, medical device, and laboratory regulation, Drug therapy, Government information and archives, Health care coverage and access, Health programs administration and funding, Health promotion and preventive care, Higher education, Medical research, Medical tests and diagnostic methods, Neurological disorders, Prescription drugs, Public-private cooperation, Research administration and funding, Research and development, Social work, volunteer service, charitable organizations",
            "Summary": "This bill establishes grant programs to address neurodegenerative diseases, such as amyotrophic lateral sclerosis (also known as ALS or Lou Gehrig's disease), and contains other related provisions.The Department of Health and Human Services (HHS) shall award grants to eligible entities for scientific research utilizing data from expanded access to investigational ALS treatments for individuals who are not otherwise eligible for clinical trials. The Food and Drug Administration (FDA) shall award grants to public and private entities to cover the costs of research and development of drugs that diagnose or treat ALS and other rare neurodegenerative diseases.HHS shall also establish the Public-Private Partnership for Neurodegenerative Diseases between the National Institutes of Health, the FDA, and at least one eligible entity (generally, an institution of higher education or a nonprofit organization). The partnership shall support the development and regulatory review of drugs that address ALS and other rare neurodegenerative diseases.The FDA shall publish on its website a five-year action plan for fostering the development of drugs that improve or extend the lives of people living with rare neurodegenerative diseases.The Government Accountability Office must report to Congress about the grants provided under this bill, including an analysis of the impact of such grants on research and development of treatments for ALS."
        },
        {
            "Bill Number": "H.R. 1085 (117th)",
            "First Name": "Bill  Huizenga",
            "Last Name": "cosponsor",
            "Role": "H.R. 1085 (117th)",
            "Bill Name": "To award three congressional gold medals to the United States Capitol Police and those who protected the U.S. Capitol on January 6, 2021.",
            "Subject Areas": "Assault and harassment offenses, Congress, Congressional tributes, Crimes against property, District of Columbia, Government buildings, facilities, and property, Law enforcement officers, Museums, exhibitions, cultural centers, Protest and dissent, Smithsonian Institution, Subversive activities, Terrorism, U.S. Capitol, Violent crime",
            "Summary": "This bill directs the Speaker of the House and the President pro tempore of the Senate to arrange for the award of three Congressional Gold Medals to the U.S. Capitol Police (USCP) and other law enforcement agencies that protected the U.S. Capitol on January 6, 2021.Following the award of these medals, one medal shall be given to the USCP, one medal shall be given to the Metropolitan Police Department of the District of Columbia, and one medal shall be given to the Smithsonian Institution and displayed with a plaque listing all law enforcement agencies that participated in protecting the Capitol on January 6, 2021."
        },
        {
            "Bill Number": "H.R. 1179 (117th)",
            "First Name": "Bill  Huizenga",
            "Last Name": "cosponsor",
            "Role": "H.R. 1179 (117th)",
            "Bill Name": "Iran Hostages Congressional Gold Medal Act",
            "Subject Areas": "International Affairs, Congressional tributes, Detention of persons, Diplomacy, foreign officials, Americans abroad, Iran, Middle East, Museums, exhibitions, cultural centers, Smithsonian Institution",
            "Summary": "This bill requires the Speaker of the House of Representatives and the President pro tempore of the Senate to arrange for the award of a Congressional Gold Medal commemorating the bravery and endurance of the 53 hostages of the Iran Hostage Crisis.Following its award, the medal shall be given to the National Museum of American History of the Smithsonian Institution for display and research.The Department of the Treasury must strike duplicate medals in silver for presentation to a hostage (or the personal representative of a deceased hostage), and Treasury may also strike and sell duplicate medals in bronze."
        },
        {
            "Bill Number": "H.R. 1281 (117th)",
            "First Name": "Bill  Huizenga",
            "Last Name": "cosponsor",
            "Role": "H.R. 1281 (117th)",
            "Bill Name": "To name the Department of Veterans Affairs community-based outpatient clinic in Gaylord, Michigan, as the Navy Corpsman Steve Andrews Department of Veterans Affairs Health Care Clinic.",
            "Subject Areas": NaN,
            "Summary": "This bill designates the community-based outpatient clinic of the Department of Veterans Affairs in Gaylord, Michigan, as the Navy Corpsman Steve Andrews Department of Veterans Affairs Health Care Clinic."
        },
        {
            "Bill Number": "H.R. 4624 (117th)",
            "First Name": "Bill  Huizenga",
            "Last Name": "cosponsor",
            "Role": "H.R. 4624 (117th)",
            "Bill Name": "Guaranteeing Healthcare Access to Personnel Who Served Act",
            "Subject Areas": "Armed Forces and National Security, Asia, Assault and harassment offenses, Congressional oversight, Crime victims, Dental care, Department of Veterans Affairs, Environmental health, Government information and archives, Government studies and investigations, Hazardous wastes and toxic substances, Health care costs and insurance, Health care coverage and access, Health care quality, Health facilities and institutions, Health information and medical records, Health personnel, Health programs administration and funding, Health promotion and preventive care, Health technology, devices, supplies, Hospital care, Immunology and vaccination, Internet and video services, Mental health, Philippines, Rural conditions and development, Sex offenses, Transportation costs, Veterans' medical care, Women's health",
            "Summary": "This bill addresses the administration and provision of health care to veterans through the Department of Veterans Affairs (VA) and non-VA providers.First, the bill provides statutory authority for the eligibility thresholds for when a veteran must receive non-VA care under the Veterans Community Care Program (VCCP) for primary care, mental health care, noninstitutional extended care services, specialty care, or specialty services. Additionally, the bill establishes access to care standards for non-VA care under the VCCP, meaning a veteran's appointment must be within specified distances and time frames.Among other requirements, the VA must also implement an 18-month pilot program to allow certain veterans to use a website or mobile application to request, schedule, and confirm medical appointments with VCCP providers; ensure that VCCP third party administrators and credentials verification organizations comply with specified requirements to help ensure that certain health care providers are excluded from providing non-VA health care services; develop a strategic plan to ensure the effectiveness of the telehealth technologies and modalities delivered by the VA; and establish an online health care education portal for veterans. The bill requires the Government Accountability Office to report on (1) the VA program under which third parties provide transportation for veterans who are seeking VA services or benefits, (2) VA telehealth services, and (3) the VA's Foreign Medical Program.Finally, the Paperwork Reduction Act does not apply to the voluntary collection of information during research conducted by the Veterans Health Administration."
        },
        {
            "Bill Number": "H.R. 2249 (117th)",
            "First Name": "Bill  Huizenga",
            "Last Name": "cosponsor",
            "Role": "H.R. 2249 (117th)",
            "Bill Name": "Willie O\\u2019Ree Congressional Gold Medal Act",
            "Subject Areas": "Racial and ethnic relations",
            "Summary": "This bill provides for the award of a Congressional Gold Medal to Willie O'Ree or, if unavailable, to a member of his family, in recognition of his contributions and commitment to hockey, inclusion, and recreational opportunity."
        }
    ],
    "SponsoredBills": [
        {
            "Bill Number": "H.R. 935 (117th)",
            "First Name": "Bill  Huizenga",
            "Last Name": "sponsor",
            "Role": "H.R. 935 (117th)",
            "Bill Name": "Small Business Mergers, Acquisitions, Sales, and Brokerage Simplification Act of 2021",
            "Subject Areas": "Licensing and registrations, Securities, Small business",
            "Summary": "This bill exempts from securities registration requirements certain merger-and-acquisition brokers that facilitate transfer of ownership in privately held companies with earnings or revenues under a specified threshold. However, this exemption shall not apply to certain brokers, including those that provide financing related to the transfer of ownership, engage on behalf of any party in a transaction involving specified shell companies, or have been barred or suspended from association with a broker or dealer."
        }
    ],
    "VotingRecord": [
        {
            "Bill Number": "H.R. 3462 (117th)",
            "First Name": "Bill Huizenga",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 346",
            "Bill Name": "NOTAM Improvement Act of 2023",
            "Summary": "This bill directs the Federal Aviation Administration (FAA) to establish the FAA Task Force on NOTAM (notice to air missions required by international or domestic law) Improvement and requires the FAA to implement a federal NOTAM system. A NOTAM is a notice containing information essential to personnel concerned with flight operations but not known far enough in advance to be publicized by other means. It states the abnormal status of a component of the National Airspace System.Specifically, the task force must (1) review existing methods for publishing NOTAMs and flight operations information for pilots; (2) review regulations, policies, systems, and international standards relating to NOTAMs, including their content and presentation to pilots; (3) evaluate and determine best practices to organize, prioritize, and present flight operations information in a manner that optimizes pilot review and retention of relevant information; (4) provide recommendations to improve the publication and delivery of NOTAM information; and (5) report to Congress on its reviews and evaluations.By September 30, 2024, the FAA must (1) complete implementation of a federal NOTAM system and implement a back-up system, and (2) brief Congress on a plan to enhance information delivery through this federal system to promote further global harmonization and provide users of the National Airspace System a consistent format for domestic and international operations.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1664 (117th)",
            "First Name": "Bill Huizenga",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1664 (117th)",
            "Bill Name": "To authorize the National Medal of Honor Museum Foundation to establish a commemorative work in the District of Columbia and its environs, and for other purposes.",
            "Summary": "This bill authorizes the National Medal of Honor Museum Foundation to establish a commemorative work on federal land in the District of Columbia in honor of the extraordinary acts of valor, selfless service, and sacrifice displayed by Medal of Honor recipients.The foundation shall be solely responsible for the acceptance of contributions for, and the payment of expenses of, the establishment of the commemorative work.Federal funds may not be used to pay any expenses for the establishment of the commemorative work.The establishment of the commemorative work shall be in accordance with the Commemorative Works Act.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 390 (117th)",
            "First Name": "Bill Huizenga",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 390 (117th)",
            "Bill Name": "To redesignate the Federal building located at 167 North Main Street in Memphis, Tennessee as the \\u201cOdell Horton Federal Building\\u201d.",
            "Summary": "This bill designates the federal building at 167 North Main Street in Memphis, Tennessee (commonly known as the Clifford Davis and Odell Horton Federal Building), as the Odell Horton Federal Building.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 6363",
            "First Name": "Bill Huizenga",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 6363",
            "Bill Name": "Further Continuing Appropriations and Other Extensions Act, 2024",
            "Summary": "This bill provides continuing FY2024 appropriations for federal agencies. The bill also extends several expiring programs and authorities, including programs authorized by the 2018 farm bill and several public health programs.DIVISION A--FURTHER CONTINUING APPROPRIATIONS ACT, 2024Further Continuing Appropriations Act, 2024(Sec. 101) This section provides continuing FY2024 appropriations for federal agencies and extends several expiring programs and authorities.It is known as a continuing resolution (CR) and prevents a government shutdown that would otherwise occur if the FY2024 appropriations bills have not been enacted when the existing CR expires on November 17, 2023.The CR provides funding through January 19, 2024, for agencies and programs that were funded in the following four FY2023 appropriations acts: the Agriculture, Rural Development, Food and Drug Administration, and Related Agencies Appropriations Act, 2023; the Energy and Water Development and Related Agencies Appropriations Act, 2023; the Military Construction, Veterans Affairs, and Related Agencies Appropriations Act, 2023; and the Transportation, Housing and Urban Development, and Related Agencies Appropriations Act, 2023. For most other federal agencies and programs, the CR provides funding through February 2, 2024.The CR generally funds most programs and activities at the FY2023 levels with several exceptions that provide funding flexibility and additional appropriations for various programs. For example, the CR includes exceptions for: the Navy's procurement of one Columbia Class Submarine, activities of the U.S. Secret Service that are related to National Special Security Events and the 2024 Presidential Campaign, and activities of the Department of Education that are necessary to ensure the continuation of student loan servicing activities. This section also extends several expiring programs and authorities, including the U.S. Parole Commission, the authority for the Department of Defense (DOD) to provide physical protection and personal security for certain former or retired DOD officials who face serious and credible threats arising from duties performed while employed by DOD, restrictions on firearms that are undetectable by walk-through metal detectors and X-ray machines commonly used at airports, limits on pay increases for the Vice President and certain senior political appointees, the exemption from the Antideficiency Act for the Federal Communications Commission's Universal Service Fund, and the Department of Homeland Security's Countering Weapons of Mass Destruction Office. This section provides appropriations for a payment to Katherine Anne Feinstein, the beneficiary of the late Senator Dianne Feinstein.DIVISION B--OTHER MATTERSTITLE I--EXTENSIONS AND OTHER MATTERS(Sec. 101) This section extends provisions that provide grants and other financial assistance to the Federated States of Micronesia and the Republic of the Marshall Islands.(Sec. 102) This section extends programs authorized by the Agriculture Improvement Act of 2018 (commonly known as the 2018 farm bill) until the later of (1) September 30, 2024, or (2) the date specified in the provision of the act.This section extends and amends Department of Agriculture (USDA) commodity programs, including by extending various programs for covered commodities, a loan commodity, sugarcane, or sugar beets for the 2024 crop year; extending the Dairy Margin Coverage (DMC) program through December 31, 2024; limiting the 25% premium discount for the DMC program in 2024 to participating dairy operations that received the discount in 2023; allowing Dairy Forward Pricing Program contracts to be extended through September 30, 2027 (currently September 30, 2026); extending the Price Loss Coverage (PLC) payments through the 2024 crop year for a covered commodity; extending the suspension of permanent price support authorities for the 2024 crop year for covered commodities, cotton, and sugar and through December 31, 2024, for milk; and extending the suspension of provisions related to corn and wheat marketing quotas for wheat planted for harvest in calendar year 2024. This section reauthorizes, and extends funding for, the Grassroots Source Water Protection Program (SWPP) for FY2024. The SWPP is a joint project with the Farm Service Agency and the National Rural Water Association (a nonprofit water and wastewater utility membership organization), which is designed to help prevent pollution of surface and ground water that is used as the primary source of drinking water by rural residents.This section reauthorizes, and extends funding for, the Voluntary Public Access and Habitat Incentive Program through FY2024. The program provides funding to help state and tribal governments encourage landowners to allow public access to their land for hunting, fishing, and other wildlife-dependent recreation.This section reauthorizes, and extends funding for, the Feral Swine Eradication and Control Pilot Program through FY2024. The program responds to the threat feral swine pose to agriculture, native ecosystems, and human and animal health.This section extends the Bill Emerson Humanitarian Trust through FY2024 to allow for eligible commodities to remain in the trust until September 30, 2024. The program makes funds available to provide emergency food assistance to developing countries.This section extends the Emergency Food Assistance Program (TEFAP) through FY2024. TEFAP provides food commodities (and cash support for storage and distribution costs) through states to local emergency feeding organizations (e.g., food banks).This section reauthorizes, and extends funding for, the Rural Economic Development Loan & Grant Program through FY2024 to provide funding for rural projects through local utility organizations.This section provides specified funds for scholarships for students at 1890 Institutions and extends the annual grant limitation by one year. This National Institute of Food and Agriculture (NIFA) program provides grants to 1890 Institutions (i.e., historically Black colleges and universities that belong to the U.S. land-grant university system) for awarding scholarships to students who intend to pursue a career in the food and agricultural sciences.This section also reauthorizes, and extends funding for, the Urban, Indoor, and other Emerging Agricultural Production Research, Education, and Extension Initiative for FY2024, a NIFA competitive grant program; provides specified funds for the Foundation for Food and Agriculture Research, a nonprofit corporation established to advance the research mission of USDA by supporting research activities focused on key problems of national and international significance; and extends through FY2024 a provision that prohibits USDA from declaring the Grazinglands Research Laboratory in El Reno, Oklahoma, to be excess or surplus federal property, or otherwise conveying or transferring the property. This section reauthorizes, and extends funding for, the biobased markets program (i.e., BioPreferred Program) through FY2024 to promote biobased products through (1) mandatory purchasing requirements for federal agencies and their contractors, and (2) a voluntary labeling initiative for biobased products.This section reauthorizes, and extends funding for, the bioenergy program for advanced biofuels (i.e., Advanced Biofuel Payment Program) through FY2024. The program provides payments to fuel producers to support and expand production of advanced biofuels (i.e., not derived from corn starch).This section extends through the 2024 crop the Feedstock Flexibility Program (FFP) for Bioenergy Producers, which allows the Commodity Credit Corporation to purchase surplus sugar from processors for resale to ethanol producers for ethanol fuel. Further, this section extends through September 1, 2024, requirements for USDA to provide notice to eligible entities and bioenergy producers of the quantity of eligible commodities that must be made available for purchase and sale for the crop year.This section extends the authority and funding through FY2024 for USDA to collect and report data on the production and marketing of organic agricultural products.This section reauthorizes, and extends funding through FY2024 for, modernization and improvement of international trade technology systems and data collection for imports of organically produced agricultural products.This section reauthorizes, and extends funding for, the Organic Certification Cost Share Program for FY2024. The program provides cost-share assistance to producers and handlers of agricultural products who are obtaining or renewing their certification under the National Organic Program.This section reauthorizes, and extends funding for, the multiple crop and pesticide use survey of farmers through FY2024. The USDA Office of Pest Management Policy conducts this survey to collect data for risk assessment modeling and mitigation for an active ingredient.This section also extends the Pima Agriculture Cotton Trust Fund through December 31, 2024, which provides assistance to reduce the economic injury to domestic manufacturers resulting from tariffs on cotton fabric that are higher than tariffs on certain apparel articles made of cotton fabric; the Agriculture Wool Apparel Manufacturers Trust Fund through December 31, 2024, which provides assistance to reduce the economic injury to domestic manufacturers resulting from tariffs on wool fabric that are higher than tariffs on certain apparel articles made of wool fabric; the Wool Research and Promotion Program through FY2024, which provides grants to assist U.S. wool producers with improving the quality of wool and with developing and promoting the wool market; the Emergency Citrus Disease Research and Development Trust Fund through FY2024, which funds a program that aims to bring together scientists to find scientifically sound and financially sustainable solutions to Huanglongbing (i.e., citrus greening, a bacterial disease spread by an insect that feeds on citrus); and the Sheep Production & Marketing Grant Program through FY2024, which seeks to strengthen and enhance the production and marketing of sheep and sheep products in the United States. This section specifies that the extension of farm bill programs does not apply to certain mandatory funding that was provided for (1) the Farm Service Agency to implement USDA commodity programs, and (2) certain payments under the Conservation Reserve Program for forest management thinning and transition contracts.This section extends various reporting requirements authorized by the Agriculture Improvement Act of 2018.This section rescinds specified funds that were provided to USDA for the Biorefinery, Renewable Chemical, and Biobased Product Manufacturing Assistance Program, which provides loan guarantees to assist in the development of new and emerging technologies for the development of advanced biofuels, renewable chemicals, and biobased product manufacturing.This section, with limited exceptions, must be applied and administered as if it had been enacted on September 30, 2023.TITLE II--HEALTH AND HUMAN SERVICESSubtitle A--Public Health Extenders(Sec. 201) This section extends through January 19, 2024, funding for the Teaching Health Center Graduate Medical Education Program, the Community Health Center Fund, and the National Health Services Corps. (The program supports education and training of medical students in primary care residency programs in community-based ambulatory patient care centers. The fund supports (1) grants for outpatient health care facilities that serve medically underserved populations; and (2) the National Health Service Corps, which provides scholarships and student loan repayment awards to health care providers who agree to work in areas with health care provider shortages.)(Sec. 202) This section extends funding through January 19, 2024, for the Special Diabetes Program for Type I Diabetes and the Special Diabetes Program for Indians. (The Special Diabetes Program for Type I Diabetes supports research on the prevention and cure of Type I diabetes, and the Special Diabetes Program for Indians supports diabetes treatment and prevention for tribal populations.)(Sec. 203) This section extends through January 19, 2024, the authority that allows states and tribes to request the temporary reassignment of state and local health department personnel who are funded through certain federal programs to immediately address a public health emergency.It also extends through January 19, 2024, provisions that prohibit the disclosure of information about Department of Health and Human Services (HHS) programs that could compromise national security (e.g., information regarding biomedical threats).The section extends provisions that authorize HHS to engage with developers of medical countermeasures, and that provide for related antitrust exemptions, for the purpose of furthering product development.Additionally, the section extends through January 19, 2024, the National Advisory Committee on Children and Disasters, the National Advisory Committee on Seniors and Disasters, and the National Advisory Committee on Individuals with Disabilities and Disasters.It also extends through January 19, 2024, the authority of HHS to directly appoint candidates to positions within the National Disaster Medical System if HHS determines the number of personnel in the system is insufficient to address a public health emergency or potential public health emergency.(The National Disaster Medical System is a partnership between HHS, the Department of Defense, and other federal departments that responds to public health and other emergencies, including by deploying medical response teams.)Subtitle B--Medicaid(Sec. 301) This section delays reductions to Medicaid disproportionate-share hospital (DSH) allotments until January 20, 2024. (DSHs are hospitals that receive additional payments under Medicaid for treating a large share of low-income patients.)(Sec. 302) This section reduces the amount of funding available to the Medicaid Improvement Fund for activities relating to mechanized claims systems beginning in FY2028.Subtitle C--Human Services(Sec. 401) This section funds through January 19, 2024, programs that support child welfare services and activities. Specifically, it funds the (1) Stephanie Tubbs Jones Child Welfare Service Program, which provides grants to states and Indian tribes to support preventive interventions and other activities to keep families together; and (2) the MaryLee Allen Promoting Safe and Stable Families Program, which supports efforts to prevent the unnecessary separation of children from their families, improve quality of care and services to children and their families, and ensure permanent living arrangements for children (e.g., parental reunification or adoption).(Sec. 402) This section extends funding through January 19, 2024, for the Sexual Risk Avoidance Education Program. This program supports projects to implement sexual risk avoidance education that teaches participants to voluntarily refrain from nonmarital sexual activities.(Sec. 403) This section extends funding through January 19, 2024, for the Personal Responsibility Education Program. This program provides grants to states to educate young people about abstinence and contraception for prevention of pregnancy and sexually transmitted infections. The program also supports pregnant and parenting youth.Subtitle D--Medicare(Sec. 501) This section extends through January 19, 2024, certain minimum adjustments to the work geographic index with respect to payments for physician services under Medicare.(Sec. 502) This section delays until 2025 certain laboratory reporting requirements that are used to determine payment rates for clinical diagnostic laboratory tests under Medicare, as well as related payment reductions.(Sec. 503) This section increases funding for the Medicare Improvement Fund.TITLE III--MISCELLANEOUS EXTENSIONS(Sec. 601) This section extends through February 3, 2024, the authority of the Department of Homeland Security and the Department of Justice to take certain actions to mitigate a credible threat to certain facilities or assets from an unmanned aircraft system (UAS). These include certain facilities that are located in the United States and identified as high-risk and a potential target for unlawful UAS activity.TITLE IV--BUDGETARY EFFECTS(Sec. 701) This section exempts the budgetary effects of this division from (1) the Statutory Pay-As-You-Go Act of 2010 (PAYGO Act), (2) the Senate PAYGO rule, and (3) certain budget scorekeeping rules.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 7454",
            "First Name": "Bill Huizenga",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 7454",
            "Bill Name": "Airport and Airway Extension Act of 2024",
            "Summary": "This bill temporarily extends specific Federal Aviation and Administration (FAA) programs and activities through May 10, 2024.For example, the bill extends the FAA Unmanned Aircraft Systems (UAS) pilot programs (e.g., the UAS Test Site Program and the UAS remote detection and identification pilot program), weather reporting programs, Remote Tower Pilot Program, and Essential Air Service Program. The bill also extends the authorization for the Airport Improvement Program (AIP). (This program provides grants for planning, development, and noise compatibility projects at or associated with certain public-use airports.)Further, the bill extends through May 10, 2024, the FAA's authority for expenditures from the Airport and Airway Trust Fund (AATF) and to collect various taxes and fees to fund the AATF, including taxes on aviation fuel and airline tickets. (The AATF is the primary funding source for all major FAA accounts that fund federal aviation programs, with the remainder coming from general fund appropriations.)The bill also extends through May 10, 2024, the authority of the Department of Homeland Security and the Department of Justice to take certain actions to mitigate a credible threat to certain facilities or assets from a UAS. These include certain facilities that are located in the United States and identified as high-risk and a potential target for unlawful UAS activity.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 5574 (117th)",
            "First Name": "Bill Huizenga",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 5574 (117th)",
            "Bill Name": "TRANSLATE ACT",
            "Summary": "This bill directs the Transportation Security Administration (TSA) to develop a plan to ensure that TSA material disseminated in major airports is better understood by people accessing such airports, including by foreign language speakers and people with vision or hearing impairments.In developing the plan, the TSA must take into consideration data regarding international enplanement and local populations surrounding major airports.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1339 (117th)",
            "First Name": "Bill Huizenga",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1339 (117th)",
            "Bill Name": "Advanced Air Mobility Coordination and Leadership Act",
            "Summary": "This bill directs the Department of Transportation to establish an Advanced Air Mobility (AAM) interagency working group to plan and coordinate efforts related to the safety, operations, infrastructure, physical security, cybersecurity, and federal investment necessary to bolster the AAM ecosystem in the United States. Advanced Air Mobility refers to a transportation system that transports people and property by air between two points in the United States using aircraft, including electric aircraft or electric vertical take-off and landing aircraft, in both controlled and uncontrolled airspace.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 2662 (117th)",
            "First Name": "Bill Huizenga",
            "Vote": "Nay",
            "Bill Number.1": "H.R. 2662 (117th)",
            "Bill Name": "Inspector General Independence and Empowerment Act of 2021",
            "Summary": "This bill addresses issues regarding inspectors general (IGs) and the Council of the Inspectors General on Integrity and Efficiency (CIGIE) Integrity Committee. The committee is charged with investigating allegations of wrongdoing against office of IG officials.The bill allows an IG to be removed only for cause, such as for documented malfeasance. Congress must be notified before an IG is placed on nonduty status. The bill requires the President to explain any failure to nominate an IG and adds provisions regarding acting IGs when an IG position is vacant.The committee must notify Congress when an allegation of wrongdoing made by a Member of Congress is closed without referral for investigation.The bill requires CIGIE to report semiannually to Congress and the President on the activities of the committee. The bill adds provisions regarding appointment of former IGs to the committee. An IG must refer to the committee any allegation of wrongdoing against that IG.The bill grants (1) IGs the authority to subpoena witnesses who are not currently government employees, and (2) the Department of Justice (DOJ) IG the authority to investigate wrongdoing by DOJ attorneys.The bill requires notification to Congress of an IG's ongoing investigations when the IG is placed on nonduty status.IGs must notify Congress if agencies deny access to requested information.The bill requires the establishment of minimum standards and best practices for IG training.The Government Accountability Office shall review the effectiveness of the processes of the CIGIE committee and of the offices of IGs for ensuring IG accountability, integrity, and independence.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 6833 (117th)",
            "First Name": "Bill Huizenga",
            "Vote": "Nay",
            "Bill Number.1": "H.R. 6833 (117th)",
            "Bill Name": "Continuing Appropriations and Ukraine Supplemental Appropriations Act, 2023",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 4233",
            "First Name": "Bill Huizenga",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 423",
            "Bill Name": "Pala Band of Mission Indians Land Transfer Act of 2023",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 567 (117th)",
            "First Name": "Bill Huizenga",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 567 (117th)",
            "Bill Name": "Trans-Sahara Counterterrorism Partnership Program Act of 2021",
            "Summary": "This bill provides statutory authority for the Trans-Sahara Counterterrorism Partnership Program, an interagency program launched in 2005 to partner with countries in the Sahel and Maghreb regions of Africa to counter terrorism and violent extremism.The Department of State, in consultation with the Department of Defense and the U.S. Agency for International Development, shall establish the partnership program, which must coordinate all U.S. programs in North and West Africa related to various counterterrorism activities, such as building foreign-military capacity, enhancing border security, promoting youth employment, and supporting independent media to counter terrorist propaganda.The State Department must submit comprehensive, five-year strategies that include specified activities for the Sahel and Maghreb regions and for program counterterrorism efforts. Further, program activities must, among other things (1) be carried out in countries where there is an adequate level of partner country committment, and (2) have clearly defined outcomes and specific plans with indicators to regularly monitor and evaluate outcomes and impact. Such activities must also take into account the counterterrorism and development strategies of partner countries and align with such strategies to the extent possible.The State Department shall notify Congress before obligating funds for such programs, and must submit annual reports about program activities.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 2617 (117th)",
            "First Name": "Bill Huizenga",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 2617 (117th)",
            "Bill Name": "Consolidated Appropriations Act, 2023",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1667 (117th)",
            "First Name": "Bill Huizenga",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1667 (117th)",
            "Bill Name": "Dr. Lorna Breen Health Care Provider Protection Act",
            "Summary": "This bill establishes grants and requires other activities to improve mental and behavioral health among health care providers.Specifically, the Department of Health and Human Services (HHS) must award grants to hospitals, medical professional associations, and other health care entities for programs to promote mental health and resiliency among health care providers. In addition, HHS may award grants for relevant mental and behavioral health training for health care students, residents, or professionals.Additionally, HHS must conduct a campaign to (1) encourage health care providers to seek support and treatment for mental and behavioral health concerns, and (2) disseminate best practices to prevent suicide and improve mental health and resiliency among health care providers.HHS must also study and develop policy recommendations on improving mental and behavioral health among health care providers, removing barriers to accessing care and treatment, and identifying strategies to promote resiliency. Furthermore, the Government Accountability Office must report on the extent to which relevant federal grant programs address the prevalence and severity of mental health conditions and substance use disorders among health care providers.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3593 (117th)",
            "First Name": "Bill Huizenga",
            "Vote": "Nay",
            "Bill Number.1": "H.R. 3593 (117th)",
            "Bill Name": "Department of Energy Science for the Future Act",
            "Summary": "This bill supports specified research and development activities of the Department of Energy (DOE) Office of Science.The bill establishes various programs, including a basic energy sciences research and development program; a program of research and development for the application of advanced computing practices to foundational and emerging research problems in chemistry and materials science; a web-based platform to develop and provide access to a database of computed information on known and predicted materials properties and computational tools to accelerate breakthroughs in materials discovery and design; a biological systems science and climate and environmental science research and development program; research and development activities in biomolecular characterization and imaging science; earth and environmental systems science research; a coastal zone research initiative; an initiative focused on the development of engineered ecosystems; a program to implement a strategy for achieving computing systems with capabilities beyond exascale computing systems; a program of fundamental research and development of energy efficient computing and data center technologies relevant to advanced computing applications; a Quantum User Expansion for Science and Technology program or QUEST program; a collaborative research and development program of fusion energy technologies; a research program in elementary particle physics and advanced technology research and development to improve the understanding of the fundamental properties of the universe, including constituents of matter and energy and the nature of space and time; research activities on the nature of the primary contents of the universe, including the nature of dark energy and dark matter; a research program to discover and understand various forms of nuclear matter; a program across the DOE for the production of isotopes, including the development of techniques to produce isotopes, that the DOE determines are needed for research, medical, industrial, or related purposes; a midscale instrumentation program to enable the development and acquisition of novel, state-of-the-art instruments ranging in cost from $1 million to $20 million each that would significantly accelerate scientific breakthroughs at user facilities; and a high intensity laser research initiative. The DOE Office of Science shall continue to leverage U.S. participation in the Large Hadron Collider and prioritize expanding international partnerships and investments in the Long-Baseline Neutrino Facility and Deep Underground Neutrino Experiment.DOE shall support construction of a Facility for Rare Isotope Beams to advance the understanding of rare nuclear isotopes and the evolution of the cosmos.DOE shall expand opportunities to increase the number, diversity, equity, and inclusion of highly skilled science, technology, engineering, and mathematics (STEM) professionals working in DOE mission-relevant disciplines and broaden the recruitment pool to increase diversity, including expanded partnerships with Historically Black Colleges, Tribal Colleges, Minority Serving Institutions, emerging research institutions, and scientific societies.DOE shall establish within the DOE Office of Science, a cross-cutting research initiative to leverage the federal government's innovative analytical resources and tools, user facilities, and advanced computational and networking capabilities in order to prevent, prepare for, and respond to emerging infectious diseases, including COVID-19.DOE may not carry out gain-of-function research of concern.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 884 (117th)",
            "First Name": "Bill Huizenga",
            "Vote": "Nay",
            "Bill Number.1": "H.R. 884 (117th)",
            "Bill Name": "National Aviation Preparedness Plan Act of 2022",
            "Summary": "This bill directs the Department of Transportation (DOT) to develop a national aviation preparedness plan for communicable disease outbreaks, including to (1) create a process to identify appropriate personal protective equipment to reduce the likelihood of exposure to a communicable disease that has the potential to cause an epidemic or pandemic of infectious disease that would constitute a public health emergency of international concern (i.e., a covered communicable disease); and (2) improve coordination between airports, air carriers, and governmental entities with respect to preparing for and responding to communicable disease outbreaks.In developing the plan, DOT must consult with aviation industry and labor stakeholders such as air carriers.The Government Accountability Office must conduct a study assessing the plan, including (1) whether the plan meets the obligations of the United States under international conventions and treaties, and (2) the extent to which the U.S. aviation system is prepared to respond to an outbreak of a covered communicable disease.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 4394",
            "First Name": "Bill Huizenga",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 4394",
            "Bill Name": "Energy and Water Development and Related Agencies Appropriations Act, 2024",
            "Summary": "This bill provides FY2024 appropriations for U.S. Army Corps of Engineers civil works projects, the Department of the Interior's Bureau of Reclamation, the Department of Energy (DOE), and several independent agencies.The bill provides appropriations for U.S. Army Corps of Engineers civil works projects, including for Investigations, Construction, Mississippi River and Tributaries, Operation and Maintenance, the Regulatory Program, the Formerly Utilized Sites Remedial Action Program, Flood Control and Coastal Emergencies, Expenses, the Office of the Assistant Secretary of the Army for Civil Works, and the Water Infrastructure Finance and Innovation Program. The bill provides appropriations to the Department of the Interior for the Central Utah Project and the Bureau of Reclamation.The bill provides appropriations to DOE for energy programs, including Energy Efficiency and Renewable Energy; Cybersecurity, Energy Security, and Emergency Response; Electricity; Nuclear Energy; Fossil Energy and Carbon Management; Naval Petroleum and Oil Shale Reserves; the Strategic Petroleum Reserve; the Northeast Home Heating Oil Reserve; the Energy Information Administration; Non-Defense Environmental Cleanup; the Uranium Enrichment Decontamination and Decommissioning Fund; Science; Nuclear Waste Disposal; Technology Transitions; Clean Energy Demonstrations; the Advanced Research Projects Agency—Energy; the Title 17 Innovative Technology Loan Guarantee Program; the Advanced Technology Vehicles Manufacturing Loan Program; the Tribal Energy Loan Guarantee Program; Indian Energy Policy and Programs; Departmental Administration; and the Office of the Inspector General. The bill also provides appropriations to DOE for Atomic Energy Defense Activities of the National Nuclear Security Administration, Environmental and Other Defense Activities, and the Power Marketing Administrations. The bill provides appropriations to several independent agencies, including the Federal Energy Regulatory Commission and the Nuclear Regulatory Commission.The bill includes provisions that address the operation of the Central Valley Project (CVP), which is a federal water project in California owned and operated by the Bureau of Reclamation, and the California State Water Project (SWP), which is operated jointly with the CVP.In addition, the bill makes the Bureau of Reclamation the lead agency for the purpose of coordinating all permitting and related activities required to construct certain new surface water storage projects.The bill also sets forth requirements and restrictions for using funds provided by this and other appropriations acts.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 5110",
            "First Name": "Bill Huizenga",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 5110",
            "Bill Name": "Protecting Hunting Heritage and Education Act",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 2872",
            "First Name": "Bill Huizenga",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 2872",
            "Bill Name": "Further Additional Continuing Appropriations and Other Extensions Act, 2024",
            "Summary": "This bill provides continuing FY2024 appropriations for federal agencies. The bill also extends several expiring programs and authorities, including several public health programs.DIVISION A--FURTHER ADDITIONAL CONTINUING APPROPRIATIONS ACT, 2024Further Additional Continuing Appropriations Act, 2024 (Sec. 101) This section provides continuing FY2024 appropriations for federal agencies. It is known as a continuing resolution (CR) and prevents a government shutdown that would otherwise occur if the FY2024 appropriations bills have not been enacted when the existing CR expires.The CR provides funding through March 1, 2024, for agencies and programs that were funded in the following four FY2023 appropriations acts: the Agriculture, Rural Development, Food and Drug Administration, and Related Agencies Appropriations Act, 2023; the Energy and Water Development and Related Agencies Appropriations Act, 2023; the Military Construction, Veterans Affairs, and Related Agencies Appropriations Act, 2023; and the Transportation, Housing and Urban Development, and Related Agencies Appropriations Act, 2023. (Under the current CR, these agencies and programs are funded through January 19, 2024.)For most other federal agencies and programs, the CR provides funding through March 8, 2024. (Under the current CR, these agencies and programs are funded through February 2, 2024.)The CR generally funds most programs and activities at the FY2023 levels with several exceptions that provide funding flexibility and additional appropriations for various programs. For example, the CR includes exceptions for the National Nuclear Security Administration and the Federal Aviation Administration.In addition, the CR allows the Department of Defense to obligate specified funds from the Shipbuilding and Conversion, Navy account for the procurement of one Columbia Class Submarine.The CR also extends the authority for the U.S. Parole Commission.DIVISION B--OTHER MATTERS TITLE I--HEALTH AND HUMAN SERVICESSubtitle A--Public Health Extenders(Sec. 101) This section extends through March 8, 2024, funding for the Teaching Health Center Graduate Medical Education Program, the Community Health Center Fund, and the National Health Services Corps. (The program supports education and training of medical students in primary care residency programs in community-based ambulatory patient care centers. The fund supports (1) grants for outpatient health care facilities that serve medically underserved populations; and (2) the National Health Service Corps, which provides scholarships and student loan repayment awards to health care providers who agree to work in areas with health care provider shortages.)(Sec. 102) This section extends funding through March 8, 2024, for the Special Diabetes Program for Type I Diabetes and the Special Diabetes Program for Indians. (The Special Diabetes Program for Type I Diabetes supports research on the prevention and cure of Type I diabetes, and the Special Diabetes Program for Indians supports diabetes treatment and prevention for tribal populations.)(Sec. 103) This section extends through March 8, 2024, the authority that allows states and tribes to request the temporary reassignment of state and local health department personnel who are funded through certain federal programs to immediately address a public health emergency.It also extends through March 8, 2024, provisions that prohibit the disclosure of information about Department of Health and Human Services (HHS) programs that could compromise national security (e.g., information regarding biomedical threats).The section extends provisions that authorize HHS to engage with developers of medical countermeasures, and that provide for related antitrust exemptions, for the purpose of furthering product development.Additionally, the section extends through March 8, 2024, the National Advisory Committee on Children and Disasters, the National Advisory Committee on Seniors and Disasters, and the National Advisory Committee on Individuals with Disabilities and Disasters.It also extends through March 8, 2024, the authority of HHS to directly appoint candidates to positions within the National Disaster Medical System if HHS determines the number of personnel in the system is insufficient to address a public health emergency or potential public health emergency.(The National Disaster Medical System is a partnership between HHS, the Department of Defense, and other federal departments that responds to public health and other emergencies, including by deploying medical response teams.)Subtitle B--Medicaid(Sec. 121) This section delays reductions to Medicaid disproportionate-share hospital (DSH) allotments until March 9, 2024. (DSHs are hospitals that receive additional payments under Medicaid for treating a large share of low-income patients.)(Sec. 122) This section reduces the amount of funding available to the Medicaid Improvement Fund for activities relating to mechanized claims systems beginning in FY2028.Subtitle C--Medicare(Sec. 131) This section extends through March 8, 2024, certain minimum adjustments to the work geographic index with respect to payments for physician services under Medicare.(Sec. 132) This section reduces funding for the Medicare Improvement Fund.Subtitle D--Human Services(Sec. 141) This section funds through March 8, 2024, programs that support child welfare services and activities. Specifically, it funds the (1) Stephanie Tubbs Jones Child Welfare Service Program, which provides grants to states and Indian tribes to support preventive interventions and other activities to keep families together; and (2) the MaryLee Allen Promoting Safe and Stable Families Program, which supports efforts to prevent the unnecessary separation of children from their families, improve quality of care and services to children and their families, and ensure permanent living arrangements for children (e.g., parental reunification or adoption).(Sec. 142) This section extends funding through March 8, 2024, for the Sexual Risk Avoidance Education Program. This program supports projects to implement sexual risk avoidance education that teaches participants to voluntarily refrain from nonmarital sexual activities.(Sec. 143) This section extends funding through March 8, 2024, for the Personal Responsibility Education Program. This program provides grants to states to educate young people about abstinence and contraception for prevention of pregnancy and sexually transmitted infections. The program also supports pregnant and parenting youth TITLE II--COMPACTS(Sec. 201) This section extends through March 8, 2024, provisions that provide grants and other financial assistance to the Federated States of Micronesia and the Republic of the Marshall Islands.TITLE III--COUNTER-UAS AUTHORITIES(Sec. 301) This section extends through March 8, 2024, the authority of the Department of Homeland Security and the Department of Justice to take certain actions to mitigate a credible threat to certain facilities or assets from an unmanned aircraft system (UAS). These include certain facilities that are located in the United States and identified as high-risk and a potential target for unlawful UAS activity.TITLE IV--BUDGETARY EFFECTS(Sec. 401) This section exempts the budgetary effects of this division from (1) the Statutory Pay-As-You-Go Act of 2010 (PAYGO Act), (2) the Senate PAYGO rule, and (3) certain budget scorekeeping rules.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 2930 (117th)",
            "First Name": "Bill Huizenga",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 2930 (117th)",
            "Bill Name": "Safeguard Tribal Objects of Patrimony Act of 2021",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 2250 (117th)",
            "First Name": "Bill Huizenga",
            "Vote": "Not Voting",
            "Bill Number.1": "H.R. 2250 (117th)",
            "Bill Name": "Department of Veterans Affairs Information Technology Reform Act of 2021",
            "Summary": "This bill addresses the management and implementation of information technology projects and investments of the Department of Veterans Affairs (VA).Specifically, the bill prohibits the VA from obligating or expending funds for any major information technology project that begins after the date of enactment of this bill unless a report is submitted that includes information on the cost, schedule, and performance of the project, as generated by the business owner of the project. The information in the report must be used as a baseline against which changes or variances are measured and reported on during the life cycle of the project. Projects must be managed by an interdisciplinary team that includes a certified project manager, a functional lead, a technical lead, a contracting officer, and other appropriate personnel.The VA's Chief Information Officer must (1) exercise authority over the management, governance, and oversight processes relating to existing or proposed information technology of the VA's Financial Services Center; and (2) supervise the information technology employees and contractors of the center.The VA must ensure its annual budget justification materials include a list of its active information technology projects and specified information about such projects, projected funding needs for projects, and a prioritized list of every proposed project that is unfunded.",
            "Status": "Enacted"
        }
    ]
}