{
    "Name": "Jake Ellzey",
    "Profile": {
        "Public Office": {
            "Member of the U.S. House of Representativesfrom Texas's 6th district": {
                "Incumbent": "Incumbent",
                "Assumed office": "July 30, 2021",
                "Preceded by": "Ron Wright",
                "District Info": {
                    "Median householdincome": "$73,784",
                    "Distribution": "77.46% urban,22.54% rural",
                    "Population": "775,543",
                    "Ethnicity": "57.23% ,White,25.97% ,Hispanic,10.80% ,Black,5.33% ,Asian,0.6% ,Native American"
                }
            },
            "Member of the Texas House of Representativesfrom the 10th district": {
                "In office": "January 12, 2021 – July 30, 2021",
                "Preceded by": "John Wray",
                "Succeeded by": "Brian Harrison"
            }
        },
        "Personal Details": {
            "Personal details": {
                "Born": "John Kevin Ellzey, (,1970-01-24,) ,January 24, 1970, (age 53),Amarillo, Texas,, U.S.",
                "Political party": "Republican",
                "Spouse": "Shelby Hoebeke",
                "Children": "2",
                "Education": "United States Naval Academy, (,BS,)",
                "Website": "House website"
            }
        }
    },
    "UnusedVotingRecords": [
        {
            "Bill Number": "H.R. 4366",
            "First Name": "Jake Ellzey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 4366",
            "Bill Name": "Consolidated Appropriations Act, 2024",
            "Summary": "This bill provides FY2024 appropriations for several federal departments and agencies. It also extends various expiring programs and authorities, including several public health programs.Specifically, the bill includes 6 of the 12 regular FY2024 appropriations bills: the Military Construction, Veterans Affairs, and Related Agencies Appropriations Act, 2024; the Agriculture, Rural Development, Food and Drug Administration, and Related Agencies Appropriations Act, 2024; the Commerce, Justice, Science, and Related Agencies Appropriations Act, 2024; the Energy and Water Development and Related Agencies Appropriations Act, 2024; the Department of the Interior, Environment, and Related Agencies Appropriations Act, 2024; and the Transportation, Housing and Urban Development, and Related Agencies Appropriations Act, 2024. The departments, agencies, and activities funded in the bill include Department of Defense military construction and family housing activities, the Department of Veterans Affairs, the Department of Agriculture, the Food and Drug Administration, the Department of Commerce, the Department of Justice, the science agencies, the Department of Energy, the U.S. Army Corps of Engineers, the Department of the Interior, the Environmental Protection Agency, the Department of Transportation, the Department of Housing and Urban Development, and several related and independent agencies. In addition, the bill includes several provisions that extend or otherwise modify various programs and authorities, including several public health programs.The bill also modifies the Compacts of Free Association that govern the relationship between the United States and the Republic of the Marshall Islands, the Federated States of Micronesia, and the Republic of Palau.",
            "Status": "Enacted",
            "Democrat_Yea": 0.0,
            "Democrat_Nay": 0.9858490566037736,
            "Republican_Yea": 0.9864864864864864,
            "Republican_Nay": 0.009009009009009
        },
        {
            "Bill Number": "H.R. 2724 (117th)",
            "First Name": "Jake Ellzey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 2724 (117th)",
            "Bill Name": "VA Peer Support Enhancement for MST Survivors Act",
            "Summary": "This bill requires the Department of Veterans Affairs to ensure that each individual who files a claim relating to military sexual trauma is assigned a peer support specialist during the claims process, unless the individual elects to not have such support.Under the bill, a peer support specialist must be trained as a victim advocate and may not be responsible for any part of adjudicating the individual's claim.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 2992 (117th)",
            "First Name": "Jake Ellzey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 2992 (117th)",
            "Bill Name": "Traumatic Brain Injury and Post-Traumatic Stress Disorder Law Enforcement Training Act",
            "Summary": "This bill requires the Bureau of Justice Assistance (BJA) to consult with relevant agencies to establish crisis intervention training tools for first responders to address individuals with traumatic brain injuries, acquired brain injuries, and post-traumatic stress disorder. The BJA must ensure that at least one police department designated as a Law Enforcement Mental Health Learning Site utilizes the tools and that such tools are part of the Police-Mental Health Collaboration Toolkit.Additionally, the bill requires the Centers for Disease Control and Prevention to study and report about the prevalence and incidence of concussions among first responders.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 7335 (117th)",
            "First Name": "Jake Ellzey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 7335 (117th)",
            "Bill Name": "MST Claims Coordination Act",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 2670",
            "First Name": "Jake Ellzey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 2670",
            "Bill Name": "National Defense Authorization Act for Fiscal Year 2024",
            "Summary": NaN,
            "Status": "Enacted",
            "Democrat_Yea": 0.7652582159624414,
            "Democrat_Nay": 0.2112676056338028,
            "Republican_Yea": 0.665158371040724,
            "Republican_Nay": 0.3303167420814479
        },
        {
            "Bill Number": "H.R. 6604 (117th)",
            "First Name": "Jake Ellzey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 6604 (117th)",
            "Bill Name": "Veterans Eligible to Transfer School (VETS) Credit Act",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 6868 (117th)",
            "First Name": "Jake Ellzey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 6868 (117th)",
            "Bill Name": "Cybersecurity Grants for Schools Act of 2022",
            "Summary": "This bill allows the Cybersecurity and Infrastructure Security Agency (CISA) to award grants or other financial assistance for cybersecurity and infrastructure security education and training programs at the elementary and secondary education levels. Entities eligible for the assistance include states, localities, institutions of higher education, and nonprofits. Additionally, CISA must include information about how the grants and assistance enhance cybersecurity education for underserved populations or communities in annual briefings.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3508 (117th)",
            "First Name": "Jake Ellzey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3508 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 39 West Main Street, in Honeoye Falls, New York, as the \\u201cCW4 Christian J. Koch Memorial Post Office\\u201d.",
            "Summary": "This bill designates the facility of the United States Postal Service located at 39 West Main Street, in Honeoye Falls, New York, as the CW4 Christian J. Koch Memorial Post Office.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 92 (117th)",
            "First Name": "Jake Ellzey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 92 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 110 Johnson Street in Pickens, South Carolina, as the \\u201cSpecialist Four Charles Johnson Post Office\\u201d.",
            "Summary": "This bill designates the facility of the United States Postal Service located at 110 Johnson Street in Pickens, South Carolina, as the Specialist Four Charles Johnson Post Office.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 91 (117th)",
            "First Name": "Jake Ellzey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 91 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 810 South Pendleton Street in Easley, South Carolina, as the \\u201cPrivate First Class Barrett Lyle Austin Post Office Building\\u201d.",
            "Summary": "This bill designates the facility of the United States Postal Service located at 810 South Pendleton Street in Easley, South Carolina, as the Private First Class Barrett Lyle Austin Post Office Building.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1096",
            "First Name": "Jake Ellzey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1096",
            "Bill Name": "250th Anniversary of the United States Marine Corps Commemorative Coin Act",
            "Summary": "This bill directs the Department of the Treasury to mint and issue not more than 50,000 $5 gold coins, 400,000 $1 silver coins, and 750,000 half-dollar clad coins emblematic of the 250th anniversary of the United States Marine Corps.All surcharges received by Treasury from the sale of such coins must be paid to the Marine Corps Heritage Foundation and shall only be used for the purposes of supporting the mission of the Marine Corps Heritage Center.",
            "Status": "Enacted",
            "Democrat_Yea": 0.9528301886792452,
            "Democrat_Nay": 0.0,
            "Republican_Yea": 0.9366515837104072,
            "Republican_Nay": 0.004524886877828
        },
        {
            "Bill Number": "H.R. 6386 (117th)",
            "First Name": "Jake Ellzey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 6386 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 450 West Schaumburg Road in Schaumburg, Illinois, as the \\u201cVeterans of Iraq and Afghanistan Memorial Post Office Building\\u201d.",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 700 (117th)",
            "First Name": "Jake Ellzey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 700 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 303 East Mississippi Avenue in Elwood, Illinois, as the \\u201cLawrence M. \\u2018Larry\\u2019 Walsh Sr. Post Office\\u201d.",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 5900 (117th)",
            "First Name": "Jake Ellzey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 5900 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 2016 East 1st Street in Los Angeles, California, as the \\u201cMarine Corps Reserve PVT Jacob Cruz Post Office\\u201d.",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 224 (117th)",
            "First Name": "Jake Ellzey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 224 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 5302 Galveston Road in Houston, Texas, as the Vanessa Guill\\u00e9n Post Office Building.",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1437 (117th)",
            "First Name": "Jake Ellzey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1437 (117th)",
            "Bill Name": "Further Continuing Appropriations and Extensions Act, 2023",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 7077 (117th)",
            "First Name": "Jake Ellzey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 7077 (117th)",
            "Bill Name": "Empowering the U.S. Fire Administration Act",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 935 (117th)",
            "First Name": "Jake Ellzey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 935 (117th)",
            "Bill Name": "Small Business Mergers, Acquisitions, Sales, and Brokerage Simplification Act of 2021",
            "Summary": "This bill exempts from securities registration requirements certain merger-and-acquisition brokers that facilitate transfer of ownership in privately held companies with earnings or revenues under a specified threshold. However, this exemption shall not apply to certain brokers, including those that provide financing related to the transfer of ownership, engage on behalf of any party in a transaction involving specified shell companies, or have been barred or suspended from association with a broker or dealer.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3672",
            "First Name": "Jake Ellzey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3672",
            "Bill Name": "To designate the clinic of the Department of Veterans Affairs in Indian River, Michigan, as the \\u201cPfc. Justin T. Paton Department of Veterans Affairs Clinic\\u201d.",
            "Summary": NaN,
            "Status": "Enacted",
            "Democrat_Yea": 0.9386792452830188,
            "Democrat_Nay": 0.0,
            "Republican_Yea": 0.9502262443438914,
            "Republican_Nay": 0.0
        },
        {
            "Bill Number": "H.R. 3746",
            "First Name": "Jake Ellzey",
            "Vote": "Aye",
            "Bill Number.1": "H.R. 3746",
            "Bill Name": "Fiscal Responsibility Act of 2023",
            "Summary": NaN,
            "Status": "Enacted",
            "Democrat_Yea": 0.9166666666666666,
            "Democrat_Nay": 0.0833333333333333,
            "Republican_Yea": 0.3469387755102041,
            "Republican_Nay": 0.6326530612244898
        },
        {
            "Bill Number": "H.R. 7276 (117th)",
            "First Name": "Jake Ellzey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 7276 (117th)",
            "Bill Name": "Ukraine Invasion War Crimes Deterrence and Accountability Act",
            "Summary": "This bill requires the President to report to Congress on atrocities committed during Russia's invasion of Ukraine since February 24, 2022.Specifically, the report must describe in detail (1) U.S. government efforts to collect, analyze, and preserve evidence related to war crimes and other atrocities committed during the invasion; (2) media, public diplomacy, and information operations to make the Russian people, including their military and political leaders, aware of efforts to identify and prosecute those responsible for such atrocities; and (3) the process for a domestic, foreign, or international court or tribunal to obtain information from the U.S. government related to such atrocities.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1218 (117th)",
            "First Name": "Jake Ellzey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1218 (117th)",
            "Bill Name": "Data Mapping to Save Moms\\u2019 Lives Act",
            "Summary": "This bill directs the Federal Communications Commission (FCC) to include data on certain maternal health outcomes in its broadband health mapping tool. This is an online platform that allows users to visualize, overlay, and analyze broadband and health data at national, state, and county levels.The FCC must consult with the Centers for Disease Control and Prevention to determine which maternal health outcomes should be incorporated.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 6833 (117th)",
            "First Name": "Jake Ellzey",
            "Vote": "Nay",
            "Bill Number.1": "H.R. 6833 (117th)",
            "Bill Name": "Continuing Appropriations and Ukraine Supplemental Appropriations Act, 2023",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1734",
            "First Name": "Jake Ellzey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1734",
            "Bill Name": "TRANQ Research Act of 2023",
            "Summary": "This bill requires the National Institute of Standards and Technology (NIST) to support research and other activities related to identifying xylazine (a compound used in veterinary medicine as a nonopioid tranquilizer), novel synthetic opioids, and other new psychoactive substances.In particular, NIST must support basic measurement science and research; near-real time spectrometry capabilities (i.e., a technique for rapidly identifying the chemical composition of a substance); strategies and voluntary best practices for handling, transporting, and analyzing such substances; and collaboration with other government agencies, institutions of higher education, and the private sector to enhance relevant narcotic and opioid detection and analysis capabilities. Additionally, the Government Accountability Office must conduct a study on the capabilities of the federal government to detect, identify, and otherwise respond to threats of new psychoactive substances, such as xylazine.",
            "Status": "Enacted",
            "Democrat_Yea": 0.9671361502347418,
            "Democrat_Nay": 0.0,
            "Republican_Yea": 0.9864864864864864,
            "Republican_Nay": 0.0
        },
        {
            "Bill Number": "H.R. 2954 (117th)",
            "First Name": "Jake Ellzey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 2954 (117th)",
            "Bill Name": "Securing a Strong Retirement Act of 2021",
            "Summary": "This bill makes various changes with respect to employer-sponsored retirement plans, including providing for the automatic enrollment of employees in certain plans and increasing the age at which participants are required to begin receiving mandatory distributions.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3359 (117th)",
            "First Name": "Jake Ellzey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3359 (117th)",
            "Bill Name": "Homicide Victims\\u2019 Families\\u2019 Rights Act of 2021",
            "Summary": "This bill establishes a framework for immediate family members of a victim of murder under federal law to request a review of the victim's case file if the murder was committed more than three years prior, the murder was investigated by a federal law enforcement entity, all probative investigative leads have been exhausted, and no likely perpetrator has been identified.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3197 (117th)",
            "First Name": "Jake Ellzey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3197 (117th)",
            "Bill Name": "Save the Liberty Theatre Act of 2021",
            "Summary": NaN,
            "Status": NaN
        },
        {
            "Bill Number": "H.R. 3113 (117th)",
            "First Name": "Jake Ellzey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3113 (117th)",
            "Bill Name": "Modernizing Access to Our Public Land Act",
            "Summary": "This bill directs the Department of the Interior, the Forest Service, and the U.S. Army Corps of Engineers to jointly develop and adopt interagency standards to ensure compatibility and interoperability among federal databases for the collection and dissemination of outdoor recreation data related to federal lands and used to depict locations at which recreation uses are available to the public.Interior, the Forest Service, and the Corps of Engineers must digitize and publish geographic information system data that includes federal interests, including easements and rights-of-way, in private land; status information as to whether roads and trails are open or closed; the dates on which roads and trails are seasonally opened and closed; the types of vehicles and recreational uses that are allowed on each segment of roads and trails; and the boundaries of areas where hunting or recreational shooting is permanently restricted or closed. Interior, the Forest Service, and the Corps of Engineers may work with the U.S. Geological Survey to collect, digitize, standardize, or publish data to meet the requirements of this bill.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 2471 (117th)",
            "First Name": "Jake Ellzey",
            "Vote": "Nay",
            "Bill Number.1": "H.R. 2471 (117th)",
            "Bill Name": "Consolidated Appropriations Act, 2022",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 2471 (117th)",
            "First Name": "Jake Ellzey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 2471 (117th)",
            "Bill Name": "Consolidated Appropriations Act, 2022",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 55 (117th)",
            "First Name": "Jake Ellzey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 55 (117th)",
            "Bill Name": "Emmett Till Antilynching Act",
            "Summary": "This bill makes lynching a federal hate crime offense.Specifically, the bill imposes criminal penalties—a fine, a prison term of up to 30 years, or both—on an individual who conspires to commit a hate crime offense that results in death or serious bodily injury or that includes kidnapping or an attempt to kidnap, aggravated sexual abuse or an attempt to commit aggravated sexual abuse, or an attempt to kill.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3539 (117th)",
            "First Name": "Jake Ellzey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3539 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 223 West Chalan Santo Papa in Hagatna, Guam, as the \\u201cAtanasio Taitano Perez Post Office\\u201d.",
            "Summary": "This bill designates the facility of the United States Postal Service located at 223 West Chalan Santo Papa in Hagatna, Guam, as the Atanasio Taitano Perez Post Office.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 735 (117th)",
            "First Name": "Jake Ellzey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 735 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 502 East Cotati Avenue in Cotati, California, as the \\u201cArturo L. Ibleto Post Office Building\\u201d.",
            "Summary": "This bill designates the facility of the United States Postal Service located at 502 East Cotati Avenue in Cotati, California, as the Arturo L. Ibleto Post Office Building.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3076 (117th)",
            "First Name": "Jake Ellzey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3076 (117th)",
            "Bill Name": "Postal Service Reform Act of 2022",
            "Summary": "This bill addresses the finances and operations of the U.S. Postal Service (USPS).The bill requires the Office of Personnel Management (OPM) to establish the Postal Service Health Benefits Program within the Federal Employees Health Benefits Program under which OPM may contract with carriers to offer health benefits plans for USPS employees and retirees.The bill provides for coordinated enrollment of retirees under this program and Medicare.The bill repeals the requirement that the USPS annually prepay future retirement health benefits.Additionally, the USPS may establish a program to enter into agreements with an agency of any state government, local government, or tribal government, and with other government agencies, to provide certain nonpostal products and services that reasonably contribute to the costs of the USPS and meet other specified criteria.The USPS must develop and maintain a publicly available dashboard to track service performance and must report regularly on its operations and financial condition.The Postal Regulatory Commission must annually submit to the USPS a budget of its expenses. It must also conduct a study to identify the causes and effects of postal inefficiencies relating to flats (e.g., large envelopes).The USPS Office of Inspector General shall perform oversight of the Postal Regulatory Commission.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 2324 (117th)",
            "First Name": "Jake Ellzey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 2324 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 2800 South Adams Street in Tallahassee, Florida, as the \\u201cD. Edwina Stephens Post Office\\u201d.",
            "Summary": "This bill designates the facility of the United States Postal Service located at 2800 South Adams Street in Tallahassee, Florida, as the D. Edwina Stephens Post Office.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1226",
            "First Name": "Jake Ellzey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1226",
            "Bill Name": "Wounded Warrior Access Act",
            "Summary": NaN,
            "Status": "Enacted",
            "Democrat_Yea": 0.9575471698113208,
            "Democrat_Nay": 0.0,
            "Republican_Yea": 0.9864864864864864,
            "Republican_Nay": 0.0
        },
        {
            "Bill Number": "H.R. 5577 (117th)",
            "First Name": "Jake Ellzey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 5577 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 3900 Crown Road Southwest in Atlanta, Georgia, as the \\u201cJohn R. Lewis Post Office Building\\u201d.",
            "Summary": "This bill designates the facility of the United States Postal Service located at 3900 Crown Road Southwest in Atlanta, Georgia, as the John R. Lewis Post Office Building.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 346",
            "First Name": "Jake Ellzey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 346",
            "Bill Name": "NOTAM Improvement Act of 2023",
            "Summary": "This bill directs the Federal Aviation Administration (FAA) to establish the FAA Task Force on NOTAM (notice to air missions required by international or domestic law) Improvement and requires the FAA to implement a federal NOTAM system. A NOTAM is a notice containing information essential to personnel concerned with flight operations but not known far enough in advance to be publicized by other means. It states the abnormal status of a component of the National Airspace System.Specifically, the task force must (1) review existing methods for publishing NOTAMs and flight operations information for pilots; (2) review regulations, policies, systems, and international standards relating to NOTAMs, including their content and presentation to pilots; (3) evaluate and determine best practices to organize, prioritize, and present flight operations information in a manner that optimizes pilot review and retention of relevant information; (4) provide recommendations to improve the publication and delivery of NOTAM information; and (5) report to Congress on its reviews and evaluations.By September 30, 2024, the FAA must (1) complete implementation of a federal NOTAM system and implement a back-up system, and (2) brief Congress on a plan to enhance information delivery through this federal system to promote further global harmonization and provide users of the National Airspace System a consistent format for domestic and international operations.",
            "Status": "Enacted",
            "Democrat_Yea": 0.9764150943396226,
            "Democrat_Nay": 0.0,
            "Republican_Yea": 0.9774774774774776,
            "Republican_Nay": 0.018018018018018
        }
    ],
    "CosponsoredBills": [
        {
            "Bill Number": "H.R. 1096",
            "First Name": "Jake  Ellzey",
            "Last Name": "cosponsor",
            "Role": "H.R. 1096",
            "Bill Name": "250th Anniversary of the United States Marine Corps Commemorative Coin Act",
            "Subject Areas": "Military personnel and dependents",
            "Summary": "This bill directs the Department of the Treasury to mint and issue not more than 50,000 $5 gold coins, 400,000 $1 silver coins, and 750,000 half-dollar clad coins emblematic of the 250th anniversary of the United States Marine Corps.All surcharges received by Treasury from the sale of such coins must be paid to the Marine Corps Heritage Foundation and shall only be used for the purposes of supporting the mission of the Marine Corps Heritage Center."
        },
        {
            "Bill Number": "H.R. 203 (117th)",
            "First Name": "Jake  Ellzey",
            "Last Name": "cosponsor",
            "Role": "H.R. 203 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 4020 Broadway Street in Houston, Texas, as the Benny C. Martinez Post Office Building.",
            "Subject Areas": NaN,
            "Summary": NaN
        },
        {
            "Bill Number": "H.R. 5865 (117th)",
            "First Name": "Jake  Ellzey",
            "Last Name": "cosponsor",
            "Role": "H.R. 5865 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 4110 Bluebonnet Drive in Stafford, Texas, as the \\u201cLeonard Scarcella Post Office Building\\u201d.",
            "Subject Areas": "Government Operations and Politics, Congressional tributes, Government buildings, facilities, and property, Postal service, State and local government operations, Texas",
            "Summary": NaN
        },
        {
            "Bill Number": "H.R. 8203 (117th)",
            "First Name": "Jake  Ellzey",
            "Last Name": "cosponsor",
            "Role": "H.R. 8203 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 651 Business Interstate Highway 35 North Suite 420 in New Braunfels, Texas, as the \\u201cBob Krueger Post Office\\u201d.",
            "Subject Areas": "Texas",
            "Summary": NaN
        },
        {
            "Bill Number": "H.R. 6064 (117th)",
            "First Name": "Jake  Ellzey",
            "Last Name": "cosponsor",
            "Role": "H.R. 6064 (117th)",
            "Bill Name": "To direct the Secretary of Veterans Affairs to seek to enter into an agreement with the National Academies of Sciences, Engineering, and Medicine for a review of examinations, furnished by the Secretary, to individuals who submit claim",
            "Subject Areas": NaN,
            "Summary": NaN
        },
        {
            "Bill Number": "H.R. 310 (117th)",
            "First Name": "Jake  Ellzey",
            "Last Name": "cosponsor",
            "Role": "H.R. 310 (117th)",
            "Bill Name": "To posthumously award the Congressional Gold Medal, collectively, to Glen Doherty, Tyrone Woods, J. Christopher Stevens, and Sean Smith, in recognition of their contributions to the Nation.",
            "Subject Areas": "Intelligence activities, surveillance, classified information, Law enforcement officers, Libya, Middle East, Terrorism, Veterans' organizations and recognition",
            "Summary": NaN
        },
        {
            "Bill Number": "H.R. 8876 (117th)",
            "First Name": "Jake  Ellzey",
            "Last Name": "cosponsor",
            "Role": "H.R. 8876 (117th)",
            "Bill Name": "Jackie Walorski Maternal and Child Home Visiting Reauthorization Act of 2022",
            "Subject Areas": "Health, Appropriations, Census and government statistics, Child care and development, Child health, Child safety and welfare, Computers and information technology, Congressional oversight, Family planning and birth control, Family services, Government information and archives, Government studies and investigations, Health promotion and preventive care, Health technology, devices, supplies, Home and outpatient care, Intergovernmental relations, Performance measurement, Social work, volunteer service, charitable organizations, State and local finance, State and local government operations, Women's health",
            "Summary": "This bill reauthorizes through FY2027, increases funding for, and modifies the Maternal, Infant, and Early Childhood Home Visiting Program. This program supports home visits for expectant and new parents who live in communities that are at-risk for poor maternal and child health outcomes.Changes to the program include setting out requirements for allocating program funds; increasing the percentage of funds reserved for tribal entities; establishing a publicly available dashboard that reports program outcomes; requiring activities to reduce unnecessary data collection, reporting, and other administrative requirements of the program; and allowing for virtual home visits (provided certain conditions are met)."
        },
        {
            "Bill Number": "H.R. 3630 (117th)",
            "First Name": "Jake  Ellzey",
            "Last Name": "cosponsor",
            "Role": "H.R. 3630 (117th)",
            "Bill Name": "Lymphedema Treatment Act",
            "Subject Areas": "Health, Labor and Employment, Cardiovascular and respiratory health, Health care coverage and access, Immunology and vaccination, Medicare",
            "Summary": "This bill provides for Medicare coverage of lymphedema compression treatment items. Specifically, the bill provides for coverage of standard and custom fitted gradient compression garments and other approved items that are prescribed by a physician or other specified health care professional to treat lymphedema."
        },
        {
            "Bill Number": "H.R. 7500 (117th)",
            "First Name": "Jake  Ellzey",
            "Last Name": "cosponsor",
            "Role": "H.R. 7500 (117th)",
            "Bill Name": "Fiscal Year 2022 Veterans Affairs Major Medical Facility Authorization Act",
            "Subject Areas": "Armed Forces and National Security, Building construction, California, Department of Veterans Affairs, Government buildings, facilities, and property, Health facilities and institutions, Home and outpatient care, Kentucky, Medical research, Mental health, Mississippi, Missouri, Neurological disorders, New York State, Oklahoma, Oregon, Surgery and anesthesia, Texas, Veterans' medical care",
            "Summary": NaN
        },
        {
            "Bill Number": "H.R. 8656 (117th)",
            "First Name": "Jake  Ellzey",
            "Last Name": "cosponsor",
            "Role": "H.R. 8656 (117th)",
            "Bill Name": "To designate the clinic of the Department of Veterans Affairs in Mishawaka, Indiana, as the \\u201cJackie Walorski VA Clinic\\u201d.",
            "Subject Areas": "Armed Forces and National Security, Congressional tributes, Department of Veterans Affairs, Government buildings, facilities, and property, Health facilities and institutions, Indiana, Veterans' medical care",
            "Summary": NaN
        },
        {
            "Bill Number": "H.R. 6411 (117th)",
            "First Name": "Jake  Ellzey",
            "Last Name": "cosponsor",
            "Role": "H.R. 6411 (117th)",
            "Bill Name": "STRONG Veterans Act of 2022",
            "Subject Areas": "Armed Forces and National Security, Alaska Natives and Hawaiians, Census and government statistics, Commemorative events and holidays, Congressional oversight, Correctional facilities and imprisonment, Cultural exchanges and relations, Department of Veterans Affairs, Disability assistance, Drug, alcohol, tobacco use, Emergency communications systems, Emergency medical services and trauma care, Employment and training programs, Federal-Indian relations, Foreign language and bilingual programs, Government employee pay, benefits, personnel management, Government information and archives, Government studies and investigations, Health care coverage and access, Health care quality, Health facilities and institutions, Health information and medical records, Health personnel, Health promotion and preventive care, Higher education, Home and outpatient care, Judicial procedure and administration, Law enforcement administration and funding, Medical education, Medical research, Medical tests and diagnostic methods, Mental health, Military medicine, Military personnel and dependents, Minority employment, Minority health, Neurological disorders, Nursing, Performance measurement, Research administration and funding, Rural conditions and development, Social work, volunteer service, charitable organizations, Specialized courts, Student aid and college costs, Telephone and wireless communication, Veterans' education, employment, rehabilitation, Veterans' medical care, Veterans' organizations and recognition, Veterans' pensions and compensation, Women's employment",
            "Summary": "This bill addresses mental health care provided by the Department of Veterans Affairs (VA), including by requiring the VA to update training for the VA workforce and Veterans Crisis Line staff, implement pilot programs, expand access to mental health care, conduct studies and research, and provide outreach to veterans regarding mental health resources.Among other requirements, the VA must ensure its medical centers have at least one full-time minority veteran coordinator and that such coordinators receive training on culturally appropriate mental health and suicide prevention services for American Indian and Alaska Native veterans; increase the number of full-time equivalent employees at Vet Centers and paid mental health trainees in the VA's workforce; expand specified scholarships and loan repayment programs for mental health providers and students; review and update the training for Veterans Crisis Line responders and social service assistants; designate a Buddy Check Week to organize outreach events and educate veterans on conducting peer wellness checks; update the Veterans Justice Outreach Program, including by conducting program outreach to justice-involved veterans; make permanent and expand the Peer Specialist Support program; expand eligibility for Vet Center services; offer mental health consultations to certain veterans; improve the assessment and treatment of veterans with sleep disorders; and perform various studies and research related to mental health issues and care. Additionally, the bill permanently authorizes and expands the Solid Start program."
        },
        {
            "Bill Number": "H.R. 1057 (117th)",
            "First Name": "Jake  Ellzey",
            "Last Name": "cosponsor",
            "Role": "H.R. 1057 (117th)",
            "Bill Name": "Greatest Generation Commemorative Coin Act",
            "Subject Areas": "Finance and Financial Sector, Conflicts and wars, Currency, Military history, Monuments and memorials, U.S. history, Veterans' organizations and recognition",
            "Summary": "This bill directs the Department of the Treasury to mint and issue up to 50,000 $5 coins, 400,000 $1 silver coins, and 750,000 half-dollar clad coins in commemoration of the National World War II Memorial in the District of Columbia.The design of the coins shall be emblematic of the memorial and the service and sacrifice of American soldiers and civilians during World War II.All surcharges received from the sale of such coins shall be paid to the Friends of the National World War II Memorial to support the National Park Service in maintaining and repairing the memorial, and for educational and commemorative programs."
        },
        {
            "Bill Number": "H.R. 224 (117th)",
            "First Name": "Jake  Ellzey",
            "Last Name": "cosponsor",
            "Role": "H.R. 224 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 5302 Galveston Road in Houston, Texas, as the Vanessa Guill\\u00e9n Post Office Building.",
            "Subject Areas": "Government Operations and Politics, Congressional tributes, Government buildings, facilities, and property, Postal service, Texas",
            "Summary": NaN
        },
        {
            "Bill Number": "H.R. 6015 (117th)",
            "First Name": "Jake  Ellzey",
            "Last Name": "cosponsor",
            "Role": "H.R. 6015 (117th)",
            "Bill Name": "Benjamin Berell Ferencz Congressional Gold Medal Act",
            "Subject Areas": "International Affairs, Congressional tributes, Criminal investigation, prosecution, interrogation, Europe, Germany, International law and treaties, Lawyers and legal services, Museums, exhibitions, cultural centers, War crimes, genocide, crimes against humanity",
            "Summary": "This bill provides for the award of a Congressional Gold Medal to Benjamin Berell Ferencz in recognition of his service to the United States and the international community during the post-World War II Nuremberg trials and his lifelong advocacy for international criminal justice and the rule of law."
        },
        {
            "Bill Number": "H.R. 1842 (117th)",
            "First Name": "Jake  Ellzey",
            "Last Name": "cosponsor",
            "Role": "H.R. 1842 (117th)",
            "Bill Name": "Harriet Tubman Bicentennial Commemorative Coin Act",
            "Subject Areas": "U.S. history, Women's rights",
            "Summary": "This bill directs the Department of the Treasury to mint and issue 50,000 $5 gold coins, 400,000 $1 silver coins, and 750,000 half-dollar clad coins emblematic of the legacy of Harriet Tubman as an abolitionist.The Secretary may issue coins under this bill only during the period of January 1, 2024, through December 31, 2024.All surcharges received by Treasury from the sale of such coins must be paid equally to the National Underground Railroad Freedom Center in Cincinnati, Ohio, and The Harriet Tubman Home, Inc. in Auburn, New York, for the purpose of accomplishing and advancing their missions."
        },
        {
            "Bill Number": "H.R. 5954 (117th)",
            "First Name": "Jake  Ellzey",
            "Last Name": "cosponsor",
            "Role": "H.R. 5954 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 1304 4th Avenue in Canyon, Texas, as the \\u201cGary James Fletcher Post Office Building\\u201d.",
            "Subject Areas": NaN,
            "Summary": NaN
        },
        {
            "Bill Number": "H.R. 5509 (117th)",
            "First Name": "Jake  Ellzey",
            "Last Name": "cosponsor",
            "Role": "H.R. 5509 (117th)",
            "Bill Name": "Student Veteran COVID-19 Protection Act of 2021",
            "Subject Areas": NaN,
            "Summary": "This bill addresses the administration of certain Department of Veterans Affairs (VA) educational assistance benefits and home loans, including by authorizing the VA to waive certain enrollment verifications, exempting foreign educational institutions from certain requirements, extending the time limitations on the use of educational assistance benefits, and adjusting certain home loan fees."
        },
        {
            "Bill Number": "H.R. 5142 (117th)",
            "First Name": "Jake  Ellzey",
            "Last Name": "cosponsor",
            "Role": "H.R. 5142 (117th)",
            "Bill Name": "To award posthumously a Congressional Gold Medal, in commemoration to the servicemembers who perished in Afghanistan on August 26, 2021, during the evacuation of citizens of the United States and Afghan allies at Hamid Karzai Internati",
            "Subject Areas": "Armed Forces and National Security, International Affairs, Afghanistan, Asia, Conflicts and wars, Congressional tributes, Emergency planning and evacuation, Military operations and strategy, Military personnel and dependents, Museums, exhibitions, cultural centers, Smithsonian Institution, Terrorism",
            "Summary": "This bill posthumously provides for the award of a Congressional Gold Medal in commemoration of the 13 service members who died on August 26, 2021, while stationed at Hamid Karzai International Airport in Afghanistan."
        },
        {
            "Bill Number": "H.R. 3577 (117th)",
            "First Name": "Jake  Ellzey",
            "Last Name": "cosponsor",
            "Role": "H.R. 3577 (117th)",
            "Bill Name": "United States Army Rangers Veterans of World War II Congressional Gold Medal Act",
            "Subject Areas": "Armed Forces and National Security, Conflicts and wars, Congressional tributes, Military history, Museums, exhibitions, cultural centers, Smithsonian Institution, Veterans' organizations and recognition",
            "Summary": "This bill provides for the award of a single Congressional Gold Medal to the U.S. Army Rangers Veterans of World War II in recognition of their dedicated service during World War II."
        },
        {
            "Bill Number": "H.R. 1179 (117th)",
            "First Name": "Jake  Ellzey",
            "Last Name": "cosponsor",
            "Role": "H.R. 1179 (117th)",
            "Bill Name": "Iran Hostages Congressional Gold Medal Act",
            "Subject Areas": "International Affairs, Congressional tributes, Detention of persons, Diplomacy, foreign officials, Americans abroad, Iran, Middle East, Museums, exhibitions, cultural centers, Smithsonian Institution",
            "Summary": "This bill requires the Speaker of the House of Representatives and the President pro tempore of the Senate to arrange for the award of a Congressional Gold Medal commemorating the bravery and endurance of the 53 hostages of the Iran Hostage Crisis.Following its award, the medal shall be given to the National Museum of American History of the Smithsonian Institution for display and research.The Department of the Treasury must strike duplicate medals in silver for presentation to a hostage (or the personal representative of a deceased hostage), and Treasury may also strike and sell duplicate medals in bronze."
        },
        {
            "Bill Number": "H.R. 7870 (117th)",
            "First Name": "Jake  Ellzey",
            "Last Name": "cosponsor",
            "Role": "H.R. 7870 (117th)",
            "Bill Name": "To include certain computer-related projects in the Federal permitting program under title XLI of the FAST Act, and for other purposes.",
            "Subject Areas": "Environmental Protection, Computer security and identity theft, Computers and information technology, Environmental assessment, monitoring, research, Licensing and registrations",
            "Summary": "This bill expands the expedited environmental review and permitting process under Title 41 of the Fixing America's Surface Transportation (FAST) Act, commonly known as FAST-41, to include certain computer-related infrastructure projects. Specifically, the bill provides for the expedited review of infrastructure projects concerning semiconductors, artificial intelligence and machine learning, high-performance computing and advanced computer hardware and software, quantum information science and technology, data storage and data management, or cybersecurity."
        },
        {
            "Bill Number": "H.R. 2954 (117th)",
            "First Name": "Jake  Ellzey",
            "Last Name": "cosponsor",
            "Role": "H.R. 2954 (117th)",
            "Bill Name": "Securing a Strong Retirement Act of 2021",
            "Subject Areas": "Labor and Employment, Administrative law and regulatory procedures, Bank accounts, deposits, capital, Banking and financial institutions regulation, Business records, Congressional oversight, Criminal procedure and sentencing, Department of Labor, Department of the Treasury, Disability and paralysis, Disability assistance, Drug trafficking and controlled substances, Employee benefits and pensions, Employment taxes, Financial services and investments, First responders and emergency personnel, Higher education, Income tax deferral, Income tax exclusion, Inflation and prices, Interest, dividends, interest rates, Life, casualty, property insurance, Military personnel and dependents, Sales and excise taxes, Securities, Small business, Student aid and college costs, Tax administration and collection, taxpayers, Wages and earnings",
            "Summary": "This bill makes various changes with respect to employer-sponsored retirement plans, including providing for the automatic enrollment of employees in certain plans and increasing the age at which participants are required to begin receiving mandatory distributions."
        },
        {
            "Bill Number": "H.R. 7014 (117th)",
            "First Name": "Jake  Ellzey",
            "Last Name": "cosponsor",
            "Role": "H.R. 7014 (117th)",
            "Bill Name": "To suspend normal trade relations treatment for the Russian Federation and the Republic of Belarus, and for other purposes.",
            "Subject Areas": "Congressional oversight, Europe, Free trade and trade barriers, International organizations and cooperation, Legislative rules and procedure, Military operations and strategy, Oil and gas, Russia, Tariffs, Trade restrictions, Ukraine",
            "Summary": "This bill suspends normal trade relations with Russia and Belarus. It also prohibits the importation of energy products from Russia.Specifically, the bill authorizes the President to proclaim increases in the rates of duty applicable to products of Russia or Belarus. This authority terminates on January 1, 2024. The President may restore normal trade relations with Russia and Belarus, subject to congressional disapproval.Additionally, the bill prohibits the importation of Russian products that are classified under chapter 27 of the Harmonized Tariff Schedule (which includes mineral fuels, mineral oils and products of their distillation, bituminous substances, and mineral waxes).The bill directs the U.S. Trade Representative to take certain actions, including to consider steps to suspend Russia's participation in the World Trade Organization and seek to halt the accession process of Belarus."
        },
        {
            "Bill Number": "H.R. 6291 (117th)",
            "First Name": "Jake  Ellzey",
            "Last Name": "cosponsor",
            "Role": "H.R. 6291 (117th)",
            "Bill Name": "Micro Act",
            "Subject Areas": NaN,
            "Summary": "This bill directs the Department of Energy (DOE) to carry out a cross-cutting program of research, development, and demonstration of microelectronics relevant to the mission of DOE and in the service of the nation's global competitiveness in the field of microelectronics.In carrying out such program, DOE shall award financial assistance to eligible entities, such as national laboratories, to carry out research projects in, among other things, foundational science areas and methods for leveraging artificial intelligence.The Office of Science within DOE shall establish up to four Microelectronics Science Research Centers to conduct mission-driven research to address foundational challenges in the design, development, and fabrication of microelectronics and to facilitate the translation of research results to industry.The Office of Science, in coordination with the Office of Technology Transitions, shall implement partnerships with industry groups to facilitate the translation and transfer of research results produced by the centers."
        },
        {
            "Bill Number": "H.R. 5073 (117th)",
            "First Name": "Jake  Ellzey",
            "Last Name": "cosponsor",
            "Role": "H.R. 5073 (117th)",
            "Bill Name": "REACH for Veterans Act",
            "Subject Areas": "Armed Forces and National Security, Congressional oversight, Department of Veterans Affairs, Drug, alcohol, tobacco use, Emergency communications systems, Emergency medical services and trauma care, Government employee pay, benefits, personnel management, Government information and archives, Health promotion and preventive care, Mental health, Social work, volunteer service, charitable organizations, Telephone and wireless communication, Veterans' medical care, Veterans' organizations and recognition",
            "Summary": "This bill requires the Department of Veterans Affairs (VA) to update training and procedures for call responders of the Veterans Crisis Line.Specifically, the VA must enter into an agreement with an outside organization to review the training for crisis line call responders. The VA must update the training if any deficiencies are identified after the review.Among other requirements, the VA must develop guidelines on retraining and quality management for when a call responder has an adverse event or needs improvement, annually perform a common cause analysis for identified callers to the crisis line who died by suicide in situations where the crisis line was the last point of contact, develop enhanced guidance and procedures to respond to calls to the crisis line related to substance use and overdose risk, review the current emergency dispatch standard operating procedure of the crisis line, and solicit feedback from veterans service organizations on how to conduct outreach regarding the move to 988 as the new suicide and mental health crisis hotline. Each call responder must be subject to at least two calls per month that are silently monitored by a supervisor to check for quality of conduct.The Veterans Crisis Line, Office of Mental Health and Suicide Prevention of the VA, and National Center for Patient Safety of the VA must establish quality management processes and expectations for staff of the crisis line."
        },
        {
            "Bill Number": "H.R. 4880 (117th)",
            "First Name": "Jake  Ellzey",
            "Last Name": "cosponsor",
            "Role": "H.R. 4880 (117th)",
            "Bill Name": "Veterans\\u2019 Prostate Cancer Treatment and Research Act",
            "Subject Areas": "Armed Forces and National Security, Cancer, Congressional oversight, Government information and archives, Health care quality, Health information and medical records, Medical research, Medical tests and diagnostic methods, Veterans' medical care",
            "Summary": "This bill requires the Department of Veterans Affairs (VA) to establish in its National Surgery Office an interdisciplinary clinical pathway for all stages of prostate cancer. Clinical pathways are health care management tools designed around research and evidence-based practices that provide direction for the care and treatment of a specific condition. The clinical pathway must include specified elements, such as a diagnosis pathway and a treatment pathway.The VA must consult with and incorporate feedback from (1) veterans who have received prostate cancer care at its medical facilities, and (2) experts in multidisciplinary cancer care and clinical research.Additionally, the VA must publish the clinical pathway on a public VA website and annually update the pathway as needed based on medical literature and evidence-based guidelines.The bill also requires the VA to submit a plan to establish a prostate cancer program using the comprehensive prostate cancer clinical pathway."
        }
    ],
    "SponsoredBills": [
        {
            "Bill Number": "H.R. 6626 (117th)",
            "First Name": "Jake  Ellzey",
            "Last Name": "sponsor",
            "Role": "H.R. 6626 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 3903 Melear Drive in Arlington, Texas, as the \\u201cRon Wright Post Office Building\\u201d.",
            "Subject Areas": "Government Operations and Politics, Congressional tributes, Government buildings, facilities, and property, Postal service, Texas",
            "Summary": NaN
        },
        {
            "Bill Number": "H.R. 5516 (117th)",
            "First Name": "Jake  Ellzey",
            "Last Name": "sponsor",
            "Role": "H.R. 5516 (117th)",
            "Bill Name": "VITAL Assessment Act",
            "Subject Areas": "Mental health, Veterans' education, employment, rehabilitation, Veterans' medical care, Veterans' organizations and recognition",
            "Summary": "This bill implements changes related to the Department of Veterans Affairs (VA) Veterans Integration to Academic Leadership (VITAL) program, which focuses on enhancing student veterans' academic success and retention by assisting with things like mental and physical health.The VA must report on the program and establish best practices, goals, and measures for the program that are uniform among the VA's medical centers.The bill also requires the VA to conduct outreach among the Armed Forces, veterans service organizations, institutions of higher learning, and noncollege degree programs regarding the VITAL program.Additionally, the VA must assess the feasibility and advisability of including the suicide rate for student veterans in the National Veteran Suicide Prevention Annual Report."
        }
    ],
    "VotingRecord": [
        {
            "Bill Number": "H.R. 1917 (117th)",
            "First Name": "Jake Ellzey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1917 (117th)",
            "Bill Name": "Hazard Eligibility and Local Projects Act",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 5677 (117th)",
            "First Name": "Jake Ellzey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 5677",
            "Bill Name": "5G SALE Act",
            "Summary": "This bill temporarily authorizes the Federal Communications Commission (FCC) to process applications for licenses or permits for the use of specified bands of the electromagnetic spectrum that were auctioned on or before March 9, 2023. The authorization terminates 90 days after the enactment of the bill.The FCC has not processed the licenses or permits for the previously auctioned spectrum because its authority to conduct auctions lapsed on March 9, 2023.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 5110",
            "First Name": "Jake Ellzey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 5110",
            "Bill Name": "Protecting Hunting Heritage and Education Act",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3630 (117th)",
            "First Name": "Jake Ellzey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3630 (117th)",
            "Bill Name": "Lymphedema Treatment Act",
            "Summary": "This bill provides for Medicare coverage of lymphedema compression treatment items. Specifically, the bill provides for coverage of standard and custom fitted gradient compression garments and other approved items that are prescribed by a physician or other specified health care professional to treat lymphedema.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3462 (117th)",
            "First Name": "Jake Ellzey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 346",
            "Bill Name": "NOTAM Improvement Act of 2023",
            "Summary": "This bill directs the Federal Aviation Administration (FAA) to establish the FAA Task Force on NOTAM (notice to air missions required by international or domestic law) Improvement and requires the FAA to implement a federal NOTAM system. A NOTAM is a notice containing information essential to personnel concerned with flight operations but not known far enough in advance to be publicized by other means. It states the abnormal status of a component of the National Airspace System.Specifically, the task force must (1) review existing methods for publishing NOTAMs and flight operations information for pilots; (2) review regulations, policies, systems, and international standards relating to NOTAMs, including their content and presentation to pilots; (3) evaluate and determine best practices to organize, prioritize, and present flight operations information in a manner that optimizes pilot review and retention of relevant information; (4) provide recommendations to improve the publication and delivery of NOTAM information; and (5) report to Congress on its reviews and evaluations.By September 30, 2024, the FAA must (1) complete implementation of a federal NOTAM system and implement a back-up system, and (2) brief Congress on a plan to enhance information delivery through this federal system to promote further global harmonization and provide users of the National Airspace System a consistent format for domestic and international operations.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 4368",
            "First Name": "Jake Ellzey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 4368",
            "Bill Name": "Agriculture, Rural Development, Food and Drug Administration, and Related Agencies Appropriations Act, 2024",
            "Summary": "This bill provides FY2024 appropriations for the Department of Agriculture (USDA), the Food and Drug Administration, and related agencies.The bill provides appropriations to USDA for agricultural programs, including the Office of the Secretary, Executive Operations, the Economic Research Service, the National Agricultural Statistics Service, the Agricultural Research Service, the National Institute of Food and Agriculture, the Animal and Plant Health Inspection Service, the Agricultural Marketing Service, and the Food Safety and Inspection Service. The bill also provides appropriations to USDA for farm production and conservation programs, including the Farm Production and Conservation Business Center, the Farm Service Agency, the Risk Management Agency, and the Natural Resources Conservation Service. The bill provides appropriations to the Federal Crop Insurance Corporation Fund and the Commodity Credit Corporation Fund.For USDA rural development programs, the bill includes appropriations forSalaries and Expenses, the Rural Housing Service, the Rural Business-Cooperative Service, and the Rural Utilities Service. The bill provides appropriations to the Food and Nutrition Service for Child Nutrition Programs; the Special Supplemental Nutrition Program for Women, Infants, and Children (WIC); the Supplemental Nutrition Assistance Program (SNAP); the Commodity Assistance Program; and Nutrition Programs Administration. The bill provides appropriations to the Foreign Agricultural Service for (1) Food for Peace Title II Grants, and (2) McGovern-Dole International Food for Education and Child Nutrition Program Grants.The bill also provides appropriations for the Food and Drug Administration, the Commodity Futures Trading Commission, and the Farm Credit Administration. Additionally, the bill sets forth requirements and restrictions for using funds provided by this and other appropriations acts.",
            "Status": "Failed"
        },
        {
            "Bill Number": "H.R. 4394",
            "First Name": "Jake Ellzey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 4394",
            "Bill Name": "Energy and Water Development and Related Agencies Appropriations Act, 2024",
            "Summary": "This bill provides FY2024 appropriations for U.S. Army Corps of Engineers civil works projects, the Department of the Interior's Bureau of Reclamation, the Department of Energy (DOE), and several independent agencies.The bill provides appropriations for U.S. Army Corps of Engineers civil works projects, including for Investigations, Construction, Mississippi River and Tributaries, Operation and Maintenance, the Regulatory Program, the Formerly Utilized Sites Remedial Action Program, Flood Control and Coastal Emergencies, Expenses, the Office of the Assistant Secretary of the Army for Civil Works, and the Water Infrastructure Finance and Innovation Program. The bill provides appropriations to the Department of the Interior for the Central Utah Project and the Bureau of Reclamation.The bill provides appropriations to DOE for energy programs, including Energy Efficiency and Renewable Energy; Cybersecurity, Energy Security, and Emergency Response; Electricity; Nuclear Energy; Fossil Energy and Carbon Management; Naval Petroleum and Oil Shale Reserves; the Strategic Petroleum Reserve; the Northeast Home Heating Oil Reserve; the Energy Information Administration; Non-Defense Environmental Cleanup; the Uranium Enrichment Decontamination and Decommissioning Fund; Science; Nuclear Waste Disposal; Technology Transitions; Clean Energy Demonstrations; the Advanced Research Projects Agency—Energy; the Title 17 Innovative Technology Loan Guarantee Program; the Advanced Technology Vehicles Manufacturing Loan Program; the Tribal Energy Loan Guarantee Program; Indian Energy Policy and Programs; Departmental Administration; and the Office of the Inspector General. The bill also provides appropriations to DOE for Atomic Energy Defense Activities of the National Nuclear Security Administration, Environmental and Other Defense Activities, and the Power Marketing Administrations. The bill provides appropriations to several independent agencies, including the Federal Energy Regulatory Commission and the Nuclear Regulatory Commission.The bill includes provisions that address the operation of the Central Valley Project (CVP), which is a federal water project in California owned and operated by the Bureau of Reclamation, and the California State Water Project (SWP), which is operated jointly with the CVP.In addition, the bill makes the Bureau of Reclamation the lead agency for the purpose of coordinating all permitting and related activities required to construct certain new surface water storage projects.The bill also sets forth requirements and restrictions for using funds provided by this and other appropriations acts.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1619 (117th)",
            "First Name": "Jake Ellzey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1619 (117th)",
            "Bill Name": "Catawba Indian Nation Lands Act",
            "Summary": "This bill ratifies and confirms the actions of the Department of the Interior to take into trust approximately 17 acres of land in Cleveland County, North Carolina, for the benefit of the Catawba Indian Nation. The land is made part of the Catawba Reservation.The bill allows gaming on the land taken into trust for the tribe.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 4364",
            "First Name": "Jake Ellzey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 4364",
            "Bill Name": "Legislative Branch Appropriations Act, 2024",
            "Summary": "This bill provides FY2024 appropriations for the legislative branch, including the House of Representatives and joint items such as the Joint Economic Committee, the Joint Committee on Taxation, the Office of the Attending Physician, and the Office of Congressional Accessibility Services. In addition, the bill provides FY2024 appropriations for the Capitol Police; the Office of Congressional Workplace Rights; the Congressional Budget Office; the Architect of the Capitol; the Library of Congress, including the Congressional Research Service and the Copyright Office; the Government Publishing Office; the Government Accountability Office; Congressional Office for International Leadership Fund; and the John C. Stennis Center for Public Service Training and Development. (Pursuant to the longstanding practice of each chamber of Congress determining its own requirements, funds for the Senate are not included in the House bill.)The bill also sets forth requirements and restrictions for using funds provided by this bill.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 263 (117th)",
            "First Name": "Jake Ellzey",
            "Vote": "Nay",
            "Bill Number.1": "H.R. 263 (117th)",
            "Bill Name": "Big Cat Public Safety Act",
            "Summary": "This bill revises requirements governing the trade of big cats (i.e., species of lion, tiger, leopard, cheetah, jaguar, or cougar or any hybrid of such species). Specifically, it revises restrictions on the possession and exhibition of big cats, including to restrict direct contact between the public and big cats.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 4346",
            "First Name": "Jake Ellzey",
            "Vote": "Nay",
            "Bill Number.1": "H.R. 4346",
            "Bill Name": "CHIPS Act of 2022 / Research and Development, Competition, and Innovation Act / Supreme Court Security Funding Act of 2022",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 6965 (117th)",
            "First Name": "Jake Ellzey",
            "Vote": "Nay",
            "Bill Number.1": "H.R. 6965 (117th)",
            "Bill Name": "Visit America Act",
            "Summary": "This bill implements measures to support the U.S. travel and tourism industry and to address the declining percentage of international visitors to the United States.Specifically, the bill requires the Department of Commerce to develop a 10-year travel and tourism strategy with annual goals for the number of international visitors to the United States and for tourism commerce. The bill also establishes the role of Assistant Secretary of Commerce for Travel and Tourism, whose responsibilities shall include setting an annual goal for the number of international visitors to the United States and facilitating international business travel to the United States.Further, the assistant secretary must develop and implement a COVID-19 pandemic recovery strategy to assist the recovery of the U.S. travel and tourism industry.The bill also provides statutory authority for the United States Travel and Tourism Advisory Board, which shall aid the assistant secretary in developing and implementing the COVID-19 pandemic recovery strategy.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 7776 (117th)",
            "First Name": "Jake Ellzey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 7776 (117th)",
            "Bill Name": "James M. Inhofe National Defense Authorization Act for Fiscal Year 2023",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 4365",
            "First Name": "Jake Ellzey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 4365",
            "Bill Name": "Department of Defense Appropriations Act, 2024",
            "Summary": "This bill provides FY2024 appropriations to the Department of Defense (DOD) for military activities.(The bill excludes military construction, military family housing, civil works projects of the Army Corps of Engineers, and nuclear warheads, which are all included in other appropriations bills.)Within the DOD budget, the bill provides appropriations for Military Personnel; Operation and Maintenance; Procurement; Research, Development, Test and Evaluation; and Revolving and Management Funds. The bill provides appropriations for Other Department of Defense Programs, including the Defense Health Program, Chemical Agents and Munitions Destruction, Drug Interdiction and Counter-Drug Activities, and the Office of the Inspector General. In addition, the bill provides appropriations for Related Agencies, including (1) the Central Intelligence Agency Retirement and Disability System Fund, and (2) the Intelligence Community Management Account.The bill also sets forth requirements and restrictions for using funds provided by this and other appropriations acts.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1154 (117th)",
            "First Name": "Jake Ellzey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1154 (117th)",
            "Bill Name": "Great Dismal Swamp National Heritage Area Act",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 7777 (117th)",
            "First Name": "Jake Ellzey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 7777 (117th)",
            "Bill Name": "Industrial Control Systems Cybersecurity Training Act",
            "Summary": "This bill establishes within the Cybersecurity and Infrastructure Security Agency an initiative to provide the cybersecurity workforce with no-cost training related to securing industrial control systems. These are information systems used to control industrial processes, such as manufacturing, product handling, production, and distribution.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 884 (117th)",
            "First Name": "Jake Ellzey",
            "Vote": "Nay",
            "Bill Number.1": "H.R. 884 (117th)",
            "Bill Name": "National Aviation Preparedness Plan Act of 2022",
            "Summary": "This bill directs the Department of Transportation (DOT) to develop a national aviation preparedness plan for communicable disease outbreaks, including to (1) create a process to identify appropriate personal protective equipment to reduce the likelihood of exposure to a communicable disease that has the potential to cause an epidemic or pandemic of infectious disease that would constitute a public health emergency of international concern (i.e., a covered communicable disease); and (2) improve coordination between airports, air carriers, and governmental entities with respect to preparing for and responding to communicable disease outbreaks.In developing the plan, DOT must consult with aviation industry and labor stakeholders such as air carriers.The Government Accountability Office must conduct a study assessing the plan, including (1) whether the plan meets the obligations of the United States under international conventions and treaties, and (2) the extent to which the U.S. aviation system is prepared to respond to an outbreak of a covered communicable disease.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3531 (117th)",
            "First Name": "Jake Ellzey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3531 (117th)",
            "Bill Name": "Women Who Worked on the Home Front World War II Memorial Act",
            "Summary": "This bill authorizes the Women Who Worked on the Home Front Foundation to establish a commemorative work on federal land in the District of Columbia in commemoration of the commitment and service represented by women who worked on the home front during World War II.The foundation shall be solely responsible for the acceptance of contributions for, and payment of the expenses of, establishing the commemorative work.The establishment of the commemorative work shall be in accordance with the Commemorative Works Act.The bill prohibits federal funds from being used to pay any expense for the establishment of the commemorative work.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 2882",
            "First Name": "Jake Ellzey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 2882",
            "Bill Name": "Further Consolidated Appropriations Act, 2024",
            "Summary": "This bill provides FY2024 appropriations for several federal departments and agencies. It also extends various expiring programs and authorities. Specifically, the bill includes 6 of the 12 regular FY2024 appropriations bills: the Department of Defense Appropriations Act, 2024; the Financial Services and General Government Appropriations Act, 2024; the Department of Homeland Security Appropriations Act, 2024; the Departments of Labor, Health and Human Services, and Education, and Related Agencies Appropriations Act, 2024; the Legislative Branch Appropriations Act, 2024; and the Department of State, Foreign Operations, and Related Programs Appropriations Act, 2024. The departments, agencies, and activities funded in the bill include the military activities of the Department of Defense, the Department of the Treasury, the Executive Office of the President, the judiciary, federal payments to the District of Columbia, the Department of Homeland Security, the Department of Labor, the Department of Health and Human Services, the Department of Education, Congress and the agencies that serve Congress, the Department of State, and several related and independent agencies. In addition, the bill extends various programs and authorities, including the National Flood Insurance Program, the Morris K. Udall and Stewart L. Udall Foundation Trust Fund, and several authorities and programs related to immigration.The bill also prohibits State Department funds from being used to make payments to the U.N. Relief and Works Agency until March 25, 2025.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1667 (117th)",
            "First Name": "Jake Ellzey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1667 (117th)",
            "Bill Name": "Dr. Lorna Breen Health Care Provider Protection Act",
            "Summary": "This bill establishes grants and requires other activities to improve mental and behavioral health among health care providers.Specifically, the Department of Health and Human Services (HHS) must award grants to hospitals, medical professional associations, and other health care entities for programs to promote mental health and resiliency among health care providers. In addition, HHS may award grants for relevant mental and behavioral health training for health care students, residents, or professionals.Additionally, HHS must conduct a campaign to (1) encourage health care providers to seek support and treatment for mental and behavioral health concerns, and (2) disseminate best practices to prevent suicide and improve mental health and resiliency among health care providers.HHS must also study and develop policy recommendations on improving mental and behavioral health among health care providers, removing barriers to accessing care and treatment, and identifying strategies to promote resiliency. Furthermore, the Government Accountability Office must report on the extent to which relevant federal grant programs address the prevalence and severity of mental health conditions and substance use disorders among health care providers.",
            "Status": "Enacted"
        }
    ]
}