{
    "Name": "Lloyd Doggett",
    "Profile": {
        "Public Office": {
            "Member of the U.S. House of Representativesfrom Texas": {
                "Incumbent": "Incumbent",
                "Assumed office": "January 3, 1995",
                "Preceded by": "J. J. Pickle",
                "Constituency": "10th district, (1995–2005),25th district, (2005–2013),35th district, (2013–2023),37th district, (2023–present)"
            },
            "Justice of the Texas Supreme Court": {
                "In office": "January 1, 1989 – December 31, 1994",
                "Preceded by": "Ted Robertson",
                "Succeeded by": "Priscilla Owen"
            },
            "Member of the Texas Senatefrom the 14th district": {
                "In office": "August 18, 1973 – January 8, 1985",
                "Preceded by": "Charles Herring",
                "Succeeded by": "Gonzalo Barrientos"
            }
        },
        "Personal Details": {
            "Personal details": {
                "Born": "Lloyd Alton Doggett II, (,1946-10-06,) ,October 6, 1946, (age 76),Austin,, ,Texas,, U.S.",
                "Political party": "Democratic",
                "Spouse": "Libby Belk, ,,(,m., 1969),",
                "Children": "2",
                "Education": "University of Texas at Austin, (,BA,, ,JD,)",
                "Website": "House website"
            }
        }
    },
    "UnusedVotingRecords": [
        {
            "Bill Number": "H.R. 2911 (117th)",
            "First Name": "Lloyd Doggett",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 2911 (117th)",
            "Bill Name": "VA Transparency & Trust Act of 2021",
            "Summary": "This bill requires the Department of Veterans Affairs (VA) to submit a plan for obligating and expending covered funds, which are funds made available to the VA for response to the COVID-19 pandemic.The bill requires the VA to submit biweekly reports regarding obligations, expenditures, and planned uses of the funds until seven days after the VA has expended all covered funds.The Inspector General of the VA must submit reports examining the obligations and expenditures made using covered funds during the specified reporting period.Finally, the Government Accountability Office must submit an interim report and final report containing a review of obligations and expenditures made using covered funds.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 92 (117th)",
            "First Name": "Lloyd Doggett",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 92 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 110 Johnson Street in Pickens, South Carolina, as the \\u201cSpecialist Four Charles Johnson Post Office\\u201d.",
            "Summary": "This bill designates the facility of the United States Postal Service located at 110 Johnson Street in Pickens, South Carolina, as the Specialist Four Charles Johnson Post Office.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 91 (117th)",
            "First Name": "Lloyd Doggett",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 91 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 810 South Pendleton Street in Easley, South Carolina, as the \\u201cPrivate First Class Barrett Lyle Austin Post Office Building\\u201d.",
            "Summary": "This bill designates the facility of the United States Postal Service located at 810 South Pendleton Street in Easley, South Carolina, as the Private First Class Barrett Lyle Austin Post Office Building.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1096",
            "First Name": "Lloyd Doggett",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1096",
            "Bill Name": "250th Anniversary of the United States Marine Corps Commemorative Coin Act",
            "Summary": "This bill directs the Department of the Treasury to mint and issue not more than 50,000 $5 gold coins, 400,000 $1 silver coins, and 750,000 half-dollar clad coins emblematic of the 250th anniversary of the United States Marine Corps.All surcharges received by Treasury from the sale of such coins must be paid to the Marine Corps Heritage Foundation and shall only be used for the purposes of supporting the mission of the Marine Corps Heritage Center.",
            "Status": "Enacted",
            "Democrat_Yea": 0.9528301886792452,
            "Democrat_Nay": 0.0,
            "Republican_Yea": 0.9366515837104072,
            "Republican_Nay": 0.004524886877828
        },
        {
            "Bill Number": "H.R. 6386 (117th)",
            "First Name": "Lloyd Doggett",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 6386 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 450 West Schaumburg Road in Schaumburg, Illinois, as the \\u201cVeterans of Iraq and Afghanistan Memorial Post Office Building\\u201d.",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 700 (117th)",
            "First Name": "Lloyd Doggett",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 700 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 303 East Mississippi Avenue in Elwood, Illinois, as the \\u201cLawrence M. \\u2018Larry\\u2019 Walsh Sr. Post Office\\u201d.",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 5900 (117th)",
            "First Name": "Lloyd Doggett",
            "Vote": "Not Voting",
            "Bill Number.1": "H.R. 5900 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 2016 East 1st Street in Los Angeles, California, as the \\u201cMarine Corps Reserve PVT Jacob Cruz Post Office\\u201d.",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 224 (117th)",
            "First Name": "Lloyd Doggett",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 224 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 5302 Galveston Road in Houston, Texas, as the Vanessa Guill\\u00e9n Post Office Building.",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1437 (117th)",
            "First Name": "Lloyd Doggett",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1437 (117th)",
            "Bill Name": "Further Continuing Appropriations and Extensions Act, 2023",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 7077 (117th)",
            "First Name": "Lloyd Doggett",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 7077 (117th)",
            "Bill Name": "Empowering the U.S. Fire Administration Act",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 935 (117th)",
            "First Name": "Lloyd Doggett",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 935 (117th)",
            "Bill Name": "Small Business Mergers, Acquisitions, Sales, and Brokerage Simplification Act of 2021",
            "Summary": "This bill exempts from securities registration requirements certain merger-and-acquisition brokers that facilitate transfer of ownership in privately held companies with earnings or revenues under a specified threshold. However, this exemption shall not apply to certain brokers, including those that provide financing related to the transfer of ownership, engage on behalf of any party in a transaction involving specified shell companies, or have been barred or suspended from association with a broker or dealer.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3672",
            "First Name": "Lloyd Doggett",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3672",
            "Bill Name": "To designate the clinic of the Department of Veterans Affairs in Indian River, Michigan, as the \\u201cPfc. Justin T. Paton Department of Veterans Affairs Clinic\\u201d.",
            "Summary": NaN,
            "Status": "Enacted",
            "Democrat_Yea": 0.9386792452830188,
            "Democrat_Nay": 0.0,
            "Republican_Yea": 0.9502262443438914,
            "Republican_Nay": 0.0
        },
        {
            "Bill Number": "H.R. 1899 (117th)",
            "First Name": "Lloyd Doggett",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1899 (117th)",
            "Bill Name": "Ensuring Compliance Against Drug Diversion Act of 2021",
            "Summary": "This bill provides statutory authority for certain regulations governing the modification, transfer, and termination of a registration to manufacture, distribute, or dispense controlled substances. It terminates the registration of individuals and entities when they die, cease legal existence, discontinue business, or surrender such registration. It sets forth notification requirements, as well as conditions for transferring or assigning a registration.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1762 (117th)",
            "First Name": "Lloyd Doggett",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1762 (117th)",
            "Bill Name": "Protecting Indian Tribes from Scams Act",
            "Summary": "This bill requires the Federal Trade Commission (FTC), after consultation with Indian tribes, to report on unfair or deceptive practices that target tribes or tribal members. The FTC must submit the report to Congress and make it publicly available. Further, the FTC must update its website to include information for consumers and businesses on identifying and avoiding unfair or deceptive practices that target tribes or tribal members.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1002 (117th)",
            "First Name": "Lloyd Doggett",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1002 (117th)",
            "Bill Name": "DEBAR Act of 2021",
            "Summary": "This bill authorizes the Drug Enforcement Administration (DEA) to bar an entity from registering to manufacture, distribute, or dispense controlled substances under certain circumstances.Specifically, the DEA may bar—temporarily or permanently—the registration of an entity that (1) meets or has met any condition for suspension or revocation of the registration, and (2) has a history of prior suspensions or revocations.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 941 (117th)",
            "First Name": "Lloyd Doggett",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 941 (117th)",
            "Bill Name": "TRANSPLANT Act of 2021",
            "Summary": "This bill modifies and reauthorizes through FY2026 the C.W. Bill Young Cell Transplantation Program, which provides support to patients who need a potentially life-saving bone marrow transplant or umbilical cord blood transplant.The bill also requires the Department of Health and Human Services to conduct a periodic review of the science of using adult stem cells and birthing tissues in therapeutic treatments.In addition, the Government Accountability Office must report on the regenerative medicine workforce.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1460 (117th)",
            "First Name": "Lloyd Doggett",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1460 (117th)",
            "Bill Name": "Nicholas and Zachary Burt Memorial Carbon Monoxide Poisoning Prevention Act of 2021",
            "Summary": "This bill directs the Consumer Product Safety Commission to award grants to states and tribal organizations to install carbon monoxide alarms in the homes of low-income families and older adults and facilities that commonly serve children or older adults. Such carbon monoxide alarms must comply with specified standards.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1215 (117th)",
            "First Name": "Lloyd Doggett",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1215 (117th)",
            "Bill Name": "Fraud and Scam Reduction Act",
            "Summary": "This bill expands activities to address mail, telephone, and internet fraud, particularly such scams targeting older adults.The bill establishes a Senior Scams Prevention Advisory Group, which must create model educational materials to educate employees of retailers, financial-services companies, and wire-transfer companies on how to identify and prevent scams that affect older adults.Further, the Federal Trade Commission (FTC) must establish an advisory office in the Bureau of Consumer Protection to assist the FTC in monitoring scams targeting older adults, educating consumers, and receiving complaints.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 172 (117th)",
            "First Name": "Lloyd Doggett",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 172 (117th)",
            "Bill Name": "United States Anti-Doping Agency Reauthorization Act of 2021",
            "Summary": "This bill authorizes appropriations for the U.S. Anti-Doping Agency (USADA) through FY2030.The bill adds requirements that USADA be responsible for certifying in advance any testing conducted by international organizations under the World Anti-Doping Code for international amateur athletes and athletic competitions occurring within the jurisdiction of the United States; and promote a positive youth sport experience by using a portion of its funding to provide educational materials on sportsmanship, character building, and healthy performance for those participating in youth sports. The bill requires any action taken by USADA to enforce a policy, procedure, or requirement against a person with respect to a violation of federal law, including an investigation, disciplinary action, sanction, or any other administrative action, to be carried out in a manner that provides due process protection.The Department of Justice, the Department of Homeland Security, and the Food and Drug Administration must provide to USADA information relating to the prevention of the use of performance-enhancing drugs or the prohibition of performance-enhancing methods.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1868 (117th)",
            "First Name": "Lloyd Doggett",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1868 (117th)",
            "Bill Name": "To prevent across-the-board direct spending cuts, and for other purposes.",
            "Summary": "This bill makes several budgetary and technical changes to provisions under Medicare and Medicaid. The bill continues to exempt Medicare from sequestration until December 31, 2021. (Sequestration is a process of automatic, usually across-the-board spending reductions under which budgetary resources are permanently cancelled to enforce specific budget policy goals.)The bill also specifically applies certain modified payment limits to rural health clinics that temporarily enrolled in Medicare during the public health emergency relating to COVID-19 (i.e., coronavirus disease 2019) or that applied to enroll by December 31, 2020; and preserves higher Medicaid disproportionate-share hospital payments for public hospitals in California under forthcoming payment methodology changes.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1868 (117th)",
            "First Name": "Lloyd Doggett",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1868 (117th)",
            "Bill Name": "To prevent across-the-board direct spending cuts, and for other purposes.",
            "Summary": "This bill makes several budgetary and technical changes to provisions under Medicare and Medicaid. The bill continues to exempt Medicare from sequestration until December 31, 2021. (Sequestration is a process of automatic, usually across-the-board spending reductions under which budgetary resources are permanently cancelled to enforce specific budget policy goals.)The bill also specifically applies certain modified payment limits to rural health clinics that temporarily enrolled in Medicare during the public health emergency relating to COVID-19 (i.e., coronavirus disease 2019) or that applied to enroll by December 31, 2020; and preserves higher Medicaid disproportionate-share hospital payments for public hospitals in California under forthcoming payment methodology changes.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3746",
            "First Name": "Lloyd Doggett",
            "Vote": "Aye",
            "Bill Number.1": "H.R. 3746",
            "Bill Name": "Fiscal Responsibility Act of 2023",
            "Summary": NaN,
            "Status": "Enacted",
            "Democrat_Yea": 0.9166666666666666,
            "Democrat_Nay": 0.0833333333333333,
            "Republican_Yea": 0.3469387755102041,
            "Republican_Nay": 0.6326530612244898
        },
        {
            "Bill Number": "H.R. 7276 (117th)",
            "First Name": "Lloyd Doggett",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 7276 (117th)",
            "Bill Name": "Ukraine Invasion War Crimes Deterrence and Accountability Act",
            "Summary": "This bill requires the President to report to Congress on atrocities committed during Russia's invasion of Ukraine since February 24, 2022.Specifically, the report must describe in detail (1) U.S. government efforts to collect, analyze, and preserve evidence related to war crimes and other atrocities committed during the invasion; (2) media, public diplomacy, and information operations to make the Russian people, including their military and political leaders, aware of efforts to identify and prosecute those responsible for such atrocities; and (3) the process for a domestic, foreign, or international court or tribunal to obtain information from the U.S. government related to such atrocities.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1652 (117th)",
            "First Name": "Lloyd Doggett",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1652 (117th)",
            "Bill Name": "VOCA Fix to Sustain the Crime Victims Fund Act of 2021",
            "Summary": "This bill adds a new source of revenue for the Crime Victims Fund and makes changes to formula grants supported by the fund.Specifically, the bill directs revenues collected from deferred prosecution and non-prosecution agreements to be deposited into the Crime Victims Fund. Currently, such revenues are deposited into the general fund of the Treasury.Additionally, the bill increases the percentage—from 60% to 75%—of state compensation payments to crime victims in the prior fiscal year used to calculate formula grants for state victim compensation programs.Finally, the bill directs states to waive the matching requirement for recipients of state victim assistance formula grants during and for one year after a pandemic-related national emergency. It also allows states to waive the matching requirement pursuant to a policy established by the state.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1085 (117th)",
            "First Name": "Lloyd Doggett",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1085 (117th)",
            "Bill Name": "To award three congressional gold medals to the United States Capitol Police and those who protected the U.S. Capitol on January 6, 2021.",
            "Summary": "This bill directs the Speaker of the House and the President pro tempore of the Senate to arrange for the award of three Congressional Gold Medals to the U.S. Capitol Police (USCP) and other law enforcement agencies that protected the U.S. Capitol on January 6, 2021.Following the award of these medals, one medal shall be given to the USCP, one medal shall be given to the Metropolitan Police Department of the District of Columbia, and one medal shall be given to the Smithsonian Institution and displayed with a plaque listing all law enforcement agencies that participated in protecting the Capitol on January 6, 2021.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1651 (117th)",
            "First Name": "Lloyd Doggett",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1651 (117th)",
            "Bill Name": "COVID-19 Bankruptcy Relief Extension Act of 2021",
            "Summary": "This bill extends existing provisions that provide relief to debtors in bankruptcy, including those related to the COVID-19 (i.e., coronavirus disease 2019) pandemic.These provisions (1) exclude certain COVID-19 aid payments from income for the purposes of bankruptcy, and (2) increase the debt eligibility threshold for businesses qualifying for certain types of Chapter 11 reorganization bankruptcy. Currently, these provisions expire March 27, 2021. The bill extends these provisions for one year.The bill also allows for modification of a Chapter 13 repayment plan for plans confirmed before the date of enactment of this bill if the debtor is experiencing material financial hardship due to COVID-19. Currently, such a modification is only available for plans confirmed before March 27, 2020.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1799 (117th)",
            "First Name": "Lloyd Doggett",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1799 (117th)",
            "Bill Name": "PPP Extension Act of 2021",
            "Summary": "This bill extends the Paycheck Protection Program, established to support small businesses in response to COVID-19 (i.e., coronavirus disease 2019), through June 30, 2021. Currently, the program is set to expire on March 31, 2021.For the final 30 days of the program (i.e., from June 1 until June 30), the Small Business Administration may only process applications submitted prior to June 1, and it may not accept any new loan applications.The bill excludes the budgetary effects of this bill from PAYGO scorecards under the Statutory Pay-As-You-Go Act of 2010 and from Senate PAYGO scorecards.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1218 (117th)",
            "First Name": "Lloyd Doggett",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1218 (117th)",
            "Bill Name": "Data Mapping to Save Moms\\u2019 Lives Act",
            "Summary": "This bill directs the Federal Communications Commission (FCC) to include data on certain maternal health outcomes in its broadband health mapping tool. This is an online platform that allows users to visualize, overlay, and analyze broadband and health data at national, state, and county levels.The FCC must consult with the Centers for Disease Control and Prevention to determine which maternal health outcomes should be incorporated.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1319 (117th)",
            "First Name": "Lloyd Doggett",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1319 (117th)",
            "Bill Name": "American Rescue Plan Act of 2021",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 6833 (117th)",
            "First Name": "Lloyd Doggett",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 6833 (117th)",
            "Bill Name": "Continuing Appropriations and Ukraine Supplemental Appropriations Act, 2023",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1734",
            "First Name": "Lloyd Doggett",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1734",
            "Bill Name": "TRANQ Research Act of 2023",
            "Summary": "This bill requires the National Institute of Standards and Technology (NIST) to support research and other activities related to identifying xylazine (a compound used in veterinary medicine as a nonopioid tranquilizer), novel synthetic opioids, and other new psychoactive substances.In particular, NIST must support basic measurement science and research; near-real time spectrometry capabilities (i.e., a technique for rapidly identifying the chemical composition of a substance); strategies and voluntary best practices for handling, transporting, and analyzing such substances; and collaboration with other government agencies, institutions of higher education, and the private sector to enhance relevant narcotic and opioid detection and analysis capabilities. Additionally, the Government Accountability Office must conduct a study on the capabilities of the federal government to detect, identify, and otherwise respond to threats of new psychoactive substances, such as xylazine.",
            "Status": "Enacted",
            "Democrat_Yea": 0.9671361502347418,
            "Democrat_Nay": 0.0,
            "Republican_Yea": 0.9864864864864864,
            "Republican_Nay": 0.0
        },
        {
            "Bill Number": "H.R. 2954 (117th)",
            "First Name": "Lloyd Doggett",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 2954 (117th)",
            "Bill Name": "Securing a Strong Retirement Act of 2021",
            "Summary": "This bill makes various changes with respect to employer-sponsored retirement plans, including providing for the automatic enrollment of employees in certain plans and increasing the age at which participants are required to begin receiving mandatory distributions.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3359 (117th)",
            "First Name": "Lloyd Doggett",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3359 (117th)",
            "Bill Name": "Homicide Victims\\u2019 Families\\u2019 Rights Act of 2021",
            "Summary": "This bill establishes a framework for immediate family members of a victim of murder under federal law to request a review of the victim's case file if the murder was committed more than three years prior, the murder was investigated by a federal law enforcement entity, all probative investigative leads have been exhausted, and no likely perpetrator has been identified.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3197 (117th)",
            "First Name": "Lloyd Doggett",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3197 (117th)",
            "Bill Name": "Save the Liberty Theatre Act of 2021",
            "Summary": NaN,
            "Status": NaN
        },
        {
            "Bill Number": "H.R. 3113 (117th)",
            "First Name": "Lloyd Doggett",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3113 (117th)",
            "Bill Name": "Modernizing Access to Our Public Land Act",
            "Summary": "This bill directs the Department of the Interior, the Forest Service, and the U.S. Army Corps of Engineers to jointly develop and adopt interagency standards to ensure compatibility and interoperability among federal databases for the collection and dissemination of outdoor recreation data related to federal lands and used to depict locations at which recreation uses are available to the public.Interior, the Forest Service, and the Corps of Engineers must digitize and publish geographic information system data that includes federal interests, including easements and rights-of-way, in private land; status information as to whether roads and trails are open or closed; the dates on which roads and trails are seasonally opened and closed; the types of vehicles and recreational uses that are allowed on each segment of roads and trails; and the boundaries of areas where hunting or recreational shooting is permanently restricted or closed. Interior, the Forest Service, and the Corps of Engineers may work with the U.S. Geological Survey to collect, digitize, standardize, or publish data to meet the requirements of this bill.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1319 (117th)",
            "First Name": "Lloyd Doggett",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1319 (117th)",
            "Bill Name": "American Rescue Plan Act of 2021",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1192 (117th)",
            "First Name": "Lloyd Doggett",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1192 (117th)",
            "Bill Name": "PRRADA",
            "Summary": "This bill requires professionals employed in debt adjustment cases involving Puerto Rico to file verified statements disclosing their connections with interested parties before seeking compensation for their services.The Financial Oversight and Management Board for Puerto Rico must establish a list of such interested parties, which shall include the debtor, creditors, any attorney or accountant of the debtor or creditors, persons employed by the U.S. Trustee Program, persons employed by the board, and any other interested party.Compensation may be denied to such a professional if these disclosures are not filed, are inadequate, or if the professional is found to have certain conflicts of interest.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 2471 (117th)",
            "First Name": "Lloyd Doggett",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 2471 (117th)",
            "Bill Name": "Consolidated Appropriations Act, 2022",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 2471 (117th)",
            "First Name": "Lloyd Doggett",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 2471 (117th)",
            "Bill Name": "Consolidated Appropriations Act, 2022",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 208 (117th)",
            "First Name": "Lloyd Doggett",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 208 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 500 West Main Street, Suite 102 in Tupelo, Mississippi, as the Colonel Carlyle Smitty Harris Post Office.",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 55 (117th)",
            "First Name": "Lloyd Doggett",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 55 (117th)",
            "Bill Name": "Emmett Till Antilynching Act",
            "Summary": "This bill makes lynching a federal hate crime offense.Specifically, the bill imposes criminal penalties—a fine, a prison term of up to 30 years, or both—on an individual who conspires to commit a hate crime offense that results in death or serious bodily injury or that includes kidnapping or an attempt to kidnap, aggravated sexual abuse or an attempt to commit aggravated sexual abuse, or an attempt to kill.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3539 (117th)",
            "First Name": "Lloyd Doggett",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3539 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 223 West Chalan Santo Papa in Hagatna, Guam, as the \\u201cAtanasio Taitano Perez Post Office\\u201d.",
            "Summary": "This bill designates the facility of the United States Postal Service located at 223 West Chalan Santo Papa in Hagatna, Guam, as the Atanasio Taitano Perez Post Office.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 735 (117th)",
            "First Name": "Lloyd Doggett",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 735 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 502 East Cotati Avenue in Cotati, California, as the \\u201cArturo L. Ibleto Post Office Building\\u201d.",
            "Summary": "This bill designates the facility of the United States Postal Service located at 502 East Cotati Avenue in Cotati, California, as the Arturo L. Ibleto Post Office Building.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3076 (117th)",
            "First Name": "Lloyd Doggett",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3076 (117th)",
            "Bill Name": "Postal Service Reform Act of 2022",
            "Summary": "This bill addresses the finances and operations of the U.S. Postal Service (USPS).The bill requires the Office of Personnel Management (OPM) to establish the Postal Service Health Benefits Program within the Federal Employees Health Benefits Program under which OPM may contract with carriers to offer health benefits plans for USPS employees and retirees.The bill provides for coordinated enrollment of retirees under this program and Medicare.The bill repeals the requirement that the USPS annually prepay future retirement health benefits.Additionally, the USPS may establish a program to enter into agreements with an agency of any state government, local government, or tribal government, and with other government agencies, to provide certain nonpostal products and services that reasonably contribute to the costs of the USPS and meet other specified criteria.The USPS must develop and maintain a publicly available dashboard to track service performance and must report regularly on its operations and financial condition.The Postal Regulatory Commission must annually submit to the USPS a budget of its expenses. It must also conduct a study to identify the causes and effects of postal inefficiencies relating to flats (e.g., large envelopes).The USPS Office of Inspector General shall perform oversight of the Postal Regulatory Commission.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 2324 (117th)",
            "First Name": "Lloyd Doggett",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 2324 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 2800 South Adams Street in Tallahassee, Florida, as the \\u201cD. Edwina Stephens Post Office\\u201d.",
            "Summary": "This bill designates the facility of the United States Postal Service located at 2800 South Adams Street in Tallahassee, Florida, as the D. Edwina Stephens Post Office.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 335 (117th)",
            "First Name": "Lloyd Doggett",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 335 (117th)",
            "Bill Name": "To provide for an exception to a limitation against appointment of persons as Secretary of Defense within seven years of relief from active duty as a regular commissioned officer of the Armed Forces.",
            "Summary": "This bill allows the first person nominated and appointed as Secretary of Defense after 12 p.m. (Eastern Standard Time) on January 20, 2021, to be a person who is, on the date of appointment, at least four years after relief from active duty as a commissioned officer of a regular component of the Armed Forces. Under current law, an individual may not be appointed as Secretary of Defense within seven years after relief from such active duty.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 22 (117th)",
            "First Name": "Lloyd Doggett",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 22 (117th)",
            "Bill Name": "Congressional Budget Justification Transparency Act of 2021",
            "Summary": "This bill requires federal agencies to make budget justification materials available to the public on a website. The bill also requires the Office of Management and Budget to make certain details regarding the materials available to the public, including a list of the agencies that submit budget justification materials to Congress, the dates that the materials are submitted to Congress and posted online, and links to the materials.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1226",
            "First Name": "Lloyd Doggett",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1226",
            "Bill Name": "Wounded Warrior Access Act",
            "Summary": NaN,
            "Status": "Enacted",
            "Democrat_Yea": 0.9575471698113208,
            "Democrat_Nay": 0.0,
            "Republican_Yea": 0.9864864864864864,
            "Republican_Nay": 0.0
        },
        {
            "Bill Number": "H.R. 5577 (117th)",
            "First Name": "Lloyd Doggett",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 5577 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 3900 Crown Road Southwest in Atlanta, Georgia, as the \\u201cJohn R. Lewis Post Office Building\\u201d.",
            "Summary": "This bill designates the facility of the United States Postal Service located at 3900 Crown Road Southwest in Atlanta, Georgia, as the John R. Lewis Post Office Building.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 346",
            "First Name": "Lloyd Doggett",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 346",
            "Bill Name": "NOTAM Improvement Act of 2023",
            "Summary": "This bill directs the Federal Aviation Administration (FAA) to establish the FAA Task Force on NOTAM (notice to air missions required by international or domestic law) Improvement and requires the FAA to implement a federal NOTAM system. A NOTAM is a notice containing information essential to personnel concerned with flight operations but not known far enough in advance to be publicized by other means. It states the abnormal status of a component of the National Airspace System.Specifically, the task force must (1) review existing methods for publishing NOTAMs and flight operations information for pilots; (2) review regulations, policies, systems, and international standards relating to NOTAMs, including their content and presentation to pilots; (3) evaluate and determine best practices to organize, prioritize, and present flight operations information in a manner that optimizes pilot review and retention of relevant information; (4) provide recommendations to improve the publication and delivery of NOTAM information; and (5) report to Congress on its reviews and evaluations.By September 30, 2024, the FAA must (1) complete implementation of a federal NOTAM system and implement a back-up system, and (2) brief Congress on a plan to enhance information delivery through this federal system to promote further global harmonization and provide users of the National Airspace System a consistent format for domestic and international operations.",
            "Status": "Enacted",
            "Democrat_Yea": 0.9764150943396226,
            "Democrat_Nay": 0.0,
            "Republican_Yea": 0.9774774774774776,
            "Republican_Nay": 0.018018018018018
        }
    ],
    "CosponsoredBills": [
        {
            "Bill Number": "H.R. 4004",
            "First Name": "Lloyd  Doggett",
            "Last Name": "cosponsor",
            "Role": "H.R. 4004",
            "Bill Name": "United States-Taiwan Initiative on 21st-Century Trade First Agreement Implementation Act",
            "Subject Areas": NaN,
            "Summary": "This bill expresses the approval of Congress for the June 1, 2023, agreement regarding trade between the United States and Taiwan. The bill also imposes requirements on the negotiations of certain further trade agreements between the United States and Taiwan. (The June 1, 2023, agreement, which addresses issues such as customs administration and regulatory practices, is the first of several expected agreements under the United States-Taiwan Initiative on 21st-Century Trade.)The June 1, 2023, agreement may enter into force no earlier than 30 days after the President certifies in writing to Congress that Taiwan has taken measures necessary to comply with the agreement.The bill also imposes requirements on the negotiation of further agreements under the United States-Taiwan Initiative on 21st-Century Trade, such as requiring the U.S. Trade Representative (USTR) to (1) share any U.S. negotiating texts with Congress prior to sharing the text with Taiwan or any parties outside of the executive branch, (2) share any negotiating texts from Taiwan within three days of receipt, and (3) provide daily briefings to certain Members of Congress during negotiating rounds. A further agreement shall not take effect unless (1) the President, at least 60 days before entering into the further agreement, makes the text publicly available on a USTR website; and (2) a bill is enacted into law expressly approving the further agreement."
        },
        {
            "Bill Number": "H.R. 1150",
            "First Name": "Lloyd  Doggett",
            "Last Name": "cosponsor",
            "Role": "H.R. 1150",
            "Bill Name": "John Lewis Civil Rights Fellowship Act of 2023",
            "Subject Areas": "International Affairs, Area studies and international education, Congressional oversight, Congressional tributes, Employment and training programs, Higher education, Human rights, International exchange and broadcasting",
            "Summary": "This bill establishes the John Lewis Civil Rights Fellowship Program within the J. William Fulbright Educational Exchange Program (commonly referred to as the Fulbright Program).The fellowship program shall honor the legacy of Representative John Lewis and advance U.S. foreign policy priorities by promoting studies, research, and international exchange in the subject of nonviolent civil rights movements around the world.The Fulbright Foreign Scholarship Board shall annually select qualified individuals to serve as fellows in the fellowship program. The Bureau of Educational and Cultural Affairs may determine the number of fellows for each year, with at least 25 fellows each year whenever feasible. Each fellow shall (1) work in an internship or research position with an approved organization in a country with an operational Fulbright U.S. Student Program, and (2) receive an award sufficient to cover the fellow's reasonable costs during the fellowship period and certain travel and lodging expenses related to the program."
        },
        {
            "Bill Number": "H.R. 203 (117th)",
            "First Name": "Lloyd  Doggett",
            "Last Name": "cosponsor",
            "Role": "H.R. 203 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 4020 Broadway Street in Houston, Texas, as the Benny C. Martinez Post Office Building.",
            "Subject Areas": NaN,
            "Summary": NaN
        },
        {
            "Bill Number": "H.R. 5865 (117th)",
            "First Name": "Lloyd  Doggett",
            "Last Name": "cosponsor",
            "Role": "H.R. 5865 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 4110 Bluebonnet Drive in Stafford, Texas, as the \\u201cLeonard Scarcella Post Office Building\\u201d.",
            "Subject Areas": "Government Operations and Politics, Congressional tributes, Government buildings, facilities, and property, Postal service, State and local government operations, Texas",
            "Summary": NaN
        },
        {
            "Bill Number": "H.R. 3285 (117th)",
            "First Name": "Lloyd  Doggett",
            "Last Name": "cosponsor",
            "Role": "H.R. 3285 (117th)",
            "Bill Name": "21st Century President Act",
            "Subject Areas": "Crime and Law Enforcement, Presidents and presidential powers, Vice Presidents, Protection of officials, Right of privacy, Sex, gender, sexual orientation discrimination, Violent crime",
            "Summary": NaN
        },
        {
            "Bill Number": "H.R. 263 (117th)",
            "First Name": "Lloyd  Doggett",
            "Last Name": "cosponsor",
            "Role": "H.R. 263 (117th)",
            "Bill Name": "Big Cat Public Safety Act",
            "Subject Areas": "Animals, Animal protection and human-animal relationships, Civil actions and liability, Crimes against animals and natural resources, Mammals, Museums, exhibitions, cultural centers, Trade restrictions, Wildlife conservation and habitat protection",
            "Summary": "This bill revises requirements governing the trade of big cats (i.e., species of lion, tiger, leopard, cheetah, jaguar, or cougar or any hybrid of such species). Specifically, it revises restrictions on the possession and exhibition of big cats, including to restrict direct contact between the public and big cats."
        },
        {
            "Bill Number": "H.R. 8404 (117th)",
            "First Name": "Lloyd  Doggett",
            "Last Name": "cosponsor",
            "Role": "H.R. 8404 (117th)",
            "Bill Name": "Respect for Marriage Act",
            "Subject Areas": "Civil Rights and Liberties, Minority Issues, Civil actions and liability, Due process and equal protection, Family relationships, Marriage and family status, Racial and ethnic relations, Sex, gender, sexual orientation discrimination",
            "Summary": NaN
        },
        {
            "Bill Number": "H.R. 3630 (117th)",
            "First Name": "Lloyd  Doggett",
            "Last Name": "cosponsor",
            "Role": "H.R. 3630 (117th)",
            "Bill Name": "Lymphedema Treatment Act",
            "Subject Areas": "Health, Labor and Employment, Cardiovascular and respiratory health, Health care coverage and access, Immunology and vaccination, Medicare",
            "Summary": "This bill provides for Medicare coverage of lymphedema compression treatment items. Specifically, the bill provides for coverage of standard and custom fitted gradient compression garments and other approved items that are prescribed by a physician or other specified health care professional to treat lymphedema."
        },
        {
            "Bill Number": "H.R. 5502 (117th)",
            "First Name": "Lloyd  Doggett",
            "Last Name": "cosponsor",
            "Role": "H.R. 5502 (117th)",
            "Bill Name": "To require online marketplaces to verify certain information regarding high-volume third party sellers of consumer products on such online marketplaces and to disclose to consumers certain contact and other information regarding such h",
            "Subject Areas": "Computer security and identity theft, Consumer affairs, Federal preemption, Retail and wholesale trades, State and local government operations",
            "Summary": "This bill requires online marketplaces (e.g., Amazon) to collect and verify certain contact and financial information from third-party sellers whose transactions and related revenues exceed specified thresholds.Subject to certain exceptions, online marketplaces must clearly and conspicuously disclose the contact information of certain high-volume third-party sellers to consumers and must also provide consumers with methods to report suspicious activity on the marketplace.The bill provides the Federal Trade Commission and state attorneys general with the authority to enforce these requirements."
        },
        {
            "Bill Number": "H.R. 5577 (117th)",
            "First Name": "Lloyd  Doggett",
            "Last Name": "cosponsor",
            "Role": "H.R. 5577 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 3900 Crown Road Southwest in Atlanta, Georgia, as the \\u201cJohn R. Lewis Post Office Building\\u201d.",
            "Subject Areas": "Government Operations and Politics, Congressional tributes, Georgia, Government buildings, facilities, and property, Postal service",
            "Summary": "This bill designates the facility of the United States Postal Service located at 3900 Crown Road Southwest in Atlanta, Georgia, as the John R. Lewis Post Office Building."
        },
        {
            "Bill Number": "H.R. 5313 (117th)",
            "First Name": "Lloyd  Doggett",
            "Last Name": "cosponsor",
            "Role": "H.R. 5313 (117th)",
            "Bill Name": "Reese\\u2019s Law",
            "Subject Areas": "Consumer Product Safety Commission, Consumer affairs, Energy storage, supplies, demand, Product safety and quality",
            "Summary": "This bill requires the Consumer Product Safety Commission to establish product safety standards with respect to batteries that pose an ingestion hazard (e.g., button cell or coin batteries).Specifically, consumer products with these batteries must include (1) a warning label instructing consumers to keep the batteries out of the reach of children, and (2) a battery compartment that prevents access to the batteries by children who are six years of age or younger.Additionally, such batteries, if sold separately or included separately with a product, must comply with federal child-resistant packaging regulations."
        },
        {
            "Bill Number": "H.R. 1057 (117th)",
            "First Name": "Lloyd  Doggett",
            "Last Name": "cosponsor",
            "Role": "H.R. 1057 (117th)",
            "Bill Name": "Greatest Generation Commemorative Coin Act",
            "Subject Areas": "Finance and Financial Sector, Conflicts and wars, Currency, Military history, Monuments and memorials, U.S. history, Veterans' organizations and recognition",
            "Summary": "This bill directs the Department of the Treasury to mint and issue up to 50,000 $5 coins, 400,000 $1 silver coins, and 750,000 half-dollar clad coins in commemoration of the National World War II Memorial in the District of Columbia.The design of the coins shall be emblematic of the memorial and the service and sacrifice of American soldiers and civilians during World War II.All surcharges received from the sale of such coins shall be paid to the Friends of the National World War II Memorial to support the National Park Service in maintaining and repairing the memorial, and for educational and commemorative programs."
        },
        {
            "Bill Number": "H.R. 224 (117th)",
            "First Name": "Lloyd  Doggett",
            "Last Name": "cosponsor",
            "Role": "H.R. 224 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 5302 Galveston Road in Houston, Texas, as the Vanessa Guill\\u00e9n Post Office Building.",
            "Subject Areas": "Government Operations and Politics, Congressional tributes, Government buildings, facilities, and property, Postal service, Texas",
            "Summary": NaN
        },
        {
            "Bill Number": "H.R. 6015 (117th)",
            "First Name": "Lloyd  Doggett",
            "Last Name": "cosponsor",
            "Role": "H.R. 6015 (117th)",
            "Bill Name": "Benjamin Berell Ferencz Congressional Gold Medal Act",
            "Subject Areas": "International Affairs, Congressional tributes, Criminal investigation, prosecution, interrogation, Europe, Germany, International law and treaties, Lawyers and legal services, Museums, exhibitions, cultural centers, War crimes, genocide, crimes against humanity",
            "Summary": "This bill provides for the award of a Congressional Gold Medal to Benjamin Berell Ferencz in recognition of his service to the United States and the international community during the post-World War II Nuremberg trials and his lifelong advocacy for international criminal justice and the rule of law."
        },
        {
            "Bill Number": "H.R. 7105 (117th)",
            "First Name": "Lloyd  Doggett",
            "Last Name": "cosponsor",
            "Role": "H.R. 7105 (117th)",
            "Bill Name": "STOP Act",
            "Subject Areas": "Health",
            "Summary": "This bill reauthorizes through FY2027 and revises grants and other activities for reducing underage drinking.In particular, the bill modifies the scope of certain activities to incorporate a focus on the adoption and enforcement of state laws and policies for preventing and reducing underage drinking. This includes (1) assessing in annual reports whether states have adopted best practices related to laws, regulations, and enforcement practices; and (2) establishing a pilot program to collect uniform data from states and localities about their enforcement of underage drinking laws.In addition, the Substance Abuse and Mental Health Services Administration must contract with the National Academy of Sciences to review the research literature regarding the influence of drinking on adolescent brain development."
        },
        {
            "Bill Number": "H.R. 7073 (117th)",
            "First Name": "Lloyd  Doggett",
            "Last Name": "cosponsor",
            "Role": "H.R. 7073 (117th)",
            "Bill Name": "Into the Light for MMH and SUD Act of 2022",
            "Subject Areas": NaN,
            "Summary": "This bill reauthorizes through FY2028 a program that addresses maternal depression and, among other changes, expands its scope to include mental health and substance use disorders. It also requires the Department of Health and Human Services to maintain a national hotline to provide mental health and substance use disorder resources to pregnant and postpartum women and their families."
        },
        {
            "Bill Number": "H.R. 1842 (117th)",
            "First Name": "Lloyd  Doggett",
            "Last Name": "cosponsor",
            "Role": "H.R. 1842 (117th)",
            "Bill Name": "Harriet Tubman Bicentennial Commemorative Coin Act",
            "Subject Areas": "U.S. history, Women's rights",
            "Summary": "This bill directs the Department of the Treasury to mint and issue 50,000 $5 gold coins, 400,000 $1 silver coins, and 750,000 half-dollar clad coins emblematic of the legacy of Harriet Tubman as an abolitionist.The Secretary may issue coins under this bill only during the period of January 1, 2024, through December 31, 2024.All surcharges received by Treasury from the sale of such coins must be paid equally to the National Underground Railroad Freedom Center in Cincinnati, Ohio, and The Harriet Tubman Home, Inc. in Auburn, New York, for the purpose of accomplishing and advancing their missions."
        },
        {
            "Bill Number": "H.R. 1448 (117th)",
            "First Name": "Lloyd  Doggett",
            "Last Name": "cosponsor",
            "Role": "H.R. 1448 (117th)",
            "Bill Name": "PAWS for Veterans Therapy Act",
            "Subject Areas": "Armed Forces and National Security, Animal protection and human-animal relationships, Congressional oversight, Disability assistance, Government information and archives, Government studies and investigations, Health programs administration and funding, Mammals, Mental health, Neurological disorders, Service animals, Veterans' education, employment, rehabilitation, Veterans' medical care",
            "Summary": "This bill implements a program and a policy related to service dog therapy for veterans. Specifically, the bill requires the Department of Veterans Affairs (VA) to implement a five-year pilot program to provide canine training to eligible veterans diagnosed with post-traumatic stress disorder as an element of a complementary and integrative health program. Eligible veterans are those who are enrolled in the VA health care system and have been recommended for participation by a qualified mental health care provider or clinical team.The VA must seek to enter agreements containing specified elements with accredited nongovernmental entities that have demonstrated ability to provide canine training.Veterans who participate in the program are authorized to adopt the dog they assisted in training if their health provider determines it is in the best interest of the veteran.The VA must establish processes to document and track the progress of participating veterans with respect to health benefits and improvements. The Government Accountability Office must brief Congress and submit a report on the program.The bill also authorizes the VA to provide service dogs to veterans with mental illnesses, regardless of whether they have a mobility impairment."
        },
        {
            "Bill Number": "H.R. 3642 (117th)",
            "First Name": "Lloyd  Doggett",
            "Last Name": "cosponsor",
            "Role": "H.R. 3642 (117th)",
            "Bill Name": "Harlem Hellfighters Congressional Gold Medal Act",
            "Subject Areas": "Armed Forces and National Security, Conflicts and wars, Congressional tributes, Military history, Military personnel and dependents, Museums, exhibitions, cultural centers, New York State, Racial and ethnic relations, Smithsonian Institution, Veterans' organizations and recognition",
            "Summary": "This bill provides for the award of a Congressional Gold Medal to the 369th Infantry Regiment, commonly known as the Harlem Hellfighters, in recognition of their bravery and outstanding service during World War I."
        },
        {
            "Bill Number": "H.R. 4407 (117th)",
            "First Name": "Lloyd  Doggett",
            "Last Name": "cosponsor",
            "Role": "H.R. 4407 (117th)",
            "Bill Name": "TRAIN Act",
            "Subject Areas": "Health, Allied health services, Education programs funding, Health programs administration and funding, Hospital care, Medical education, Medicare, Nursing",
            "Summary": "This bill modifies the methodology and application of Medicare Advantage nursing and allied health education payments for hospitals. Specifically, for 2010-2019, the bill eliminates the annual cap on total payments and excludes any resulting increase from factoring into calculations for graduate medical education payments for such hospitals. (The Centers for Medicare & Medicaid Services recently issued guidance providing for the recalculation and correction of certain payments to account for the annual payment cap.)"
        },
        {
            "Bill Number": "H.R. 2460 (117th)",
            "First Name": "Lloyd  Doggett",
            "Last Name": "cosponsor",
            "Role": "H.R. 2460 (117th)",
            "Bill Name": "Joint Consolidation Loan Separation Act",
            "Subject Areas": "Higher education, Marriage and family status, Student aid and college costs",
            "Summary": "This bill allows two borrowers, who had previously received a joint consolidation loan for their federal student loan debt, to submit a joint application to the Department of Education to sever their consolidated loan into two separate loans. One borrower may submit a separate application in the event that the individual is experiencing domestic or economic abuse from the other individual borrower or is unable to reasonably reach or access the loan information of the other borrower."
        },
        {
            "Bill Number": "H.R. 2252 (117th)",
            "First Name": "Lloyd  Doggett",
            "Last Name": "cosponsor",
            "Role": "H.R. 2252 (117th)",
            "Bill Name": "Emmett Till and Mamie Till-Mobley Congressional Gold Medal Act of 2021",
            "Subject Areas": "Racial and ethnic relations, Smithsonian Institution, U.S. history",
            "Summary": "This bill provides for the posthumous presentation of a Congressional Gold Medal in commemoration of Emmett Till and Mamie Till-Mobley.After the award the medal shall be given to the National Museum of African American History and Culture."
        },
        {
            "Bill Number": "H.R. 1085 (117th)",
            "First Name": "Lloyd  Doggett",
            "Last Name": "cosponsor",
            "Role": "H.R. 1085 (117th)",
            "Bill Name": "To award three congressional gold medals to the United States Capitol Police and those who protected the U.S. Capitol on January 6, 2021.",
            "Subject Areas": "Assault and harassment offenses, Congress, Congressional tributes, Crimes against property, District of Columbia, Government buildings, facilities, and property, Law enforcement officers, Museums, exhibitions, cultural centers, Protest and dissent, Smithsonian Institution, Subversive activities, Terrorism, U.S. Capitol, Violent crime",
            "Summary": "This bill directs the Speaker of the House and the President pro tempore of the Senate to arrange for the award of three Congressional Gold Medals to the U.S. Capitol Police (USCP) and other law enforcement agencies that protected the U.S. Capitol on January 6, 2021.Following the award of these medals, one medal shall be given to the USCP, one medal shall be given to the Metropolitan Police Department of the District of Columbia, and one medal shall be given to the Smithsonian Institution and displayed with a plaque listing all law enforcement agencies that participated in protecting the Capitol on January 6, 2021."
        },
        {
            "Bill Number": "H.R. 1012 (117th)",
            "First Name": "Lloyd  Doggett",
            "Last Name": "cosponsor",
            "Role": "H.R. 1012 (117th)",
            "Bill Name": "\\u2018Six Triple Eight\\u2019 Congressional Gold Medal Act of 2021",
            "Subject Areas": "Military history, Military personnel and dependents, Minority employment, Museums, exhibitions, cultural centers, Postal service, Smithsonian Institution, Women's employment",
            "Summary": "This bill directs the Speaker of the House of Representatives and the President pro tempore of the Senate to arrange for the award of a Congressional Gold Medal in honor of the women of the 6888th Central Postal Directory Battalion (commonly known as the Six Triple Eight) in recognition of their pioneering military service, devotion to duty, and contributions to increase the morale of personnel stationed in the European theater of operations during World War II. The medal shall be given to the Smithsonian Institution and made available for display and research."
        },
        {
            "Bill Number": "H.R. 3525 (117th)",
            "First Name": "Lloyd  Doggett",
            "Last Name": "cosponsor",
            "Role": "H.R. 3525 (117th)",
            "Bill Name": "Commission To Study the Potential Creation of a National Museum of Asian Pacific American History and Culture Act",
            "Subject Areas": NaN,
            "Summary": "This bill establishes a Commission to Study the Potential Creation of a National Museum of Asian Pacific American History and Culture.The commission must (1) report recommendations for a plan of action for the establishment and maintenance of a National Museum of Asian Pacific American History and Culture in Washington, DC; (2) develop a fundraising plan to support the establishment, operation, and maintenance of the museum through public contributions; (3) obtain an independent review of this fundraising plan, including an analysis of the resources necessary to fund the construction of the museum and its operations and maintenance in perpetuity without reliance on federal funds; and (4) submit a legislative plan of action to establish and construct the museum.The commission may convene a national conference relating to the museum.The commission shall be solely responsible for acceptance of contributions to it and payment of its expenses.No federal funding may be obligated to carry out this bill."
        },
        {
            "Bill Number": "H.R. 2954 (117th)",
            "First Name": "Lloyd  Doggett",
            "Last Name": "cosponsor",
            "Role": "H.R. 2954 (117th)",
            "Bill Name": "Securing a Strong Retirement Act of 2021",
            "Subject Areas": "Labor and Employment, Administrative law and regulatory procedures, Bank accounts, deposits, capital, Banking and financial institutions regulation, Business records, Congressional oversight, Criminal procedure and sentencing, Department of Labor, Department of the Treasury, Disability and paralysis, Disability assistance, Drug trafficking and controlled substances, Employee benefits and pensions, Employment taxes, Financial services and investments, First responders and emergency personnel, Higher education, Income tax deferral, Income tax exclusion, Inflation and prices, Interest, dividends, interest rates, Life, casualty, property insurance, Military personnel and dependents, Sales and excise taxes, Securities, Small business, Student aid and college costs, Tax administration and collection, taxpayers, Wages and earnings",
            "Summary": "This bill makes various changes with respect to employer-sponsored retirement plans, including providing for the automatic enrollment of employees in certain plans and increasing the age at which participants are required to begin receiving mandatory distributions."
        },
        {
            "Bill Number": "H.R. 2249 (117th)",
            "First Name": "Lloyd  Doggett",
            "Last Name": "cosponsor",
            "Role": "H.R. 2249 (117th)",
            "Bill Name": "Willie O\\u2019Ree Congressional Gold Medal Act",
            "Subject Areas": "Racial and ethnic relations",
            "Summary": "This bill provides for the award of a Congressional Gold Medal to Willie O'Ree or, if unavailable, to a member of his family, in recognition of his contributions and commitment to hockey, inclusion, and recreational opportunity."
        }
    ],
    "SponsoredBills": [
        {
            "Bill Number": "H.R. 8203 (117th)",
            "First Name": "Lloyd  Doggett",
            "Last Name": "sponsor",
            "Role": "H.R. 8203 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 651 Business Interstate Highway 35 North Suite 420 in New Braunfels, Texas, as the \\u201cBob Krueger Post Office\\u201d.",
            "Subject Areas": "Texas",
            "Summary": NaN
        }
    ],
    "VotingRecord": [
        {
            "Bill Number": "H.R. 3616 (117th)",
            "First Name": "Lloyd Doggett",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3616 (117th)",
            "Bill Name": "Bear River National Heritage Area Study Act",
            "Summary": "This bill directs the Department of the Interior to conduct a study to assess the suitability and feasibility of designating the study area, including areas in Utah and Idaho that are within the main drainage area of the Bear River, as a National Heritage Area, to be known as the Bear River National Heritage Area.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1917 (117th)",
            "First Name": "Lloyd Doggett",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1917 (117th)",
            "Bill Name": "Hazard Eligibility and Local Projects Act",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 4346",
            "First Name": "Lloyd Doggett",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 4346",
            "Bill Name": "CHIPS Act of 2022 / Research and Development, Competition, and Innovation Act / Supreme Court Security Funding Act of 2022",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1917 (117th)",
            "First Name": "Lloyd Doggett",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1917 (117th)",
            "Bill Name": "Hazard Eligibility and Local Projects Act",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3593 (117th)",
            "First Name": "Lloyd Doggett",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3593 (117th)",
            "Bill Name": "Department of Energy Science for the Future Act",
            "Summary": "This bill supports specified research and development activities of the Department of Energy (DOE) Office of Science.The bill establishes various programs, including a basic energy sciences research and development program; a program of research and development for the application of advanced computing practices to foundational and emerging research problems in chemistry and materials science; a web-based platform to develop and provide access to a database of computed information on known and predicted materials properties and computational tools to accelerate breakthroughs in materials discovery and design; a biological systems science and climate and environmental science research and development program; research and development activities in biomolecular characterization and imaging science; earth and environmental systems science research; a coastal zone research initiative; an initiative focused on the development of engineered ecosystems; a program to implement a strategy for achieving computing systems with capabilities beyond exascale computing systems; a program of fundamental research and development of energy efficient computing and data center technologies relevant to advanced computing applications; a Quantum User Expansion for Science and Technology program or QUEST program; a collaborative research and development program of fusion energy technologies; a research program in elementary particle physics and advanced technology research and development to improve the understanding of the fundamental properties of the universe, including constituents of matter and energy and the nature of space and time; research activities on the nature of the primary contents of the universe, including the nature of dark energy and dark matter; a research program to discover and understand various forms of nuclear matter; a program across the DOE for the production of isotopes, including the development of techniques to produce isotopes, that the DOE determines are needed for research, medical, industrial, or related purposes; a midscale instrumentation program to enable the development and acquisition of novel, state-of-the-art instruments ranging in cost from $1 million to $20 million each that would significantly accelerate scientific breakthroughs at user facilities; and a high intensity laser research initiative. The DOE Office of Science shall continue to leverage U.S. participation in the Large Hadron Collider and prioritize expanding international partnerships and investments in the Long-Baseline Neutrino Facility and Deep Underground Neutrino Experiment.DOE shall support construction of a Facility for Rare Isotope Beams to advance the understanding of rare nuclear isotopes and the evolution of the cosmos.DOE shall expand opportunities to increase the number, diversity, equity, and inclusion of highly skilled science, technology, engineering, and mathematics (STEM) professionals working in DOE mission-relevant disciplines and broaden the recruitment pool to increase diversity, including expanded partnerships with Historically Black Colleges, Tribal Colleges, Minority Serving Institutions, emerging research institutions, and scientific societies.DOE shall establish within the DOE Office of Science, a cross-cutting research initiative to leverage the federal government's innovative analytical resources and tools, user facilities, and advanced computational and networking capabilities in order to prevent, prepare for, and respond to emerging infectious diseases, including COVID-19.DOE may not carry out gain-of-function research of concern.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 2662 (117th)",
            "First Name": "Lloyd Doggett",
            "Vote": "Not Voting",
            "Bill Number.1": "H.R. 2662 (117th)",
            "Bill Name": "Inspector General Independence and Empowerment Act of 2021",
            "Summary": "This bill addresses issues regarding inspectors general (IGs) and the Council of the Inspectors General on Integrity and Efficiency (CIGIE) Integrity Committee. The committee is charged with investigating allegations of wrongdoing against office of IG officials.The bill allows an IG to be removed only for cause, such as for documented malfeasance. Congress must be notified before an IG is placed on nonduty status. The bill requires the President to explain any failure to nominate an IG and adds provisions regarding acting IGs when an IG position is vacant.The committee must notify Congress when an allegation of wrongdoing made by a Member of Congress is closed without referral for investigation.The bill requires CIGIE to report semiannually to Congress and the President on the activities of the committee. The bill adds provisions regarding appointment of former IGs to the committee. An IG must refer to the committee any allegation of wrongdoing against that IG.The bill grants (1) IGs the authority to subpoena witnesses who are not currently government employees, and (2) the Department of Justice (DOJ) IG the authority to investigate wrongdoing by DOJ attorneys.The bill requires notification to Congress of an IG's ongoing investigations when the IG is placed on nonduty status.IGs must notify Congress if agencies deny access to requested information.The bill requires the establishment of minimum standards and best practices for IG training.The Government Accountability Office shall review the effectiveness of the processes of the CIGIE committee and of the offices of IGs for ensuring IG accountability, integrity, and independence.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1437 (117th)",
            "First Name": "Lloyd Doggett",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1437 (117th)",
            "Bill Name": "Further Continuing Appropriations and Extensions Act, 2023",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 4365",
            "First Name": "Lloyd Doggett",
            "Vote": "Nay",
            "Bill Number.1": "H.R. 4365",
            "Bill Name": "Department of Defense Appropriations Act, 2024",
            "Summary": "This bill provides FY2024 appropriations to the Department of Defense (DOD) for military activities.(The bill excludes military construction, military family housing, civil works projects of the Army Corps of Engineers, and nuclear warheads, which are all included in other appropriations bills.)Within the DOD budget, the bill provides appropriations for Military Personnel; Operation and Maintenance; Procurement; Research, Development, Test and Evaluation; and Revolving and Management Funds. The bill provides appropriations for Other Department of Defense Programs, including the Defense Health Program, Chemical Agents and Munitions Destruction, Drug Interdiction and Counter-Drug Activities, and the Office of the Inspector General. In addition, the bill provides appropriations for Related Agencies, including (1) the Central Intelligence Agency Retirement and Disability System Fund, and (2) the Intelligence Community Management Account.The bill also sets forth requirements and restrictions for using funds provided by this and other appropriations acts.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 2617 (117th)",
            "First Name": "Lloyd Doggett",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 2617 (117th)",
            "Bill Name": "Consolidated Appropriations Act, 2023",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 7463",
            "First Name": "Lloyd Doggett",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 7463",
            "Bill Name": "Extension of Continuing Appropriations and Other Matters Act, 2024",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1154 (117th)",
            "First Name": "Lloyd Doggett",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1154 (117th)",
            "Bill Name": "Great Dismal Swamp National Heritage Area Act",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 2497 (117th)",
            "First Name": "Lloyd Doggett",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 2497 (117th)",
            "Bill Name": "Amache National Historic Site Act",
            "Summary": "This bill establishes the Amache National Historic Site in Colorado as a unit of the National Park System to preserve, protect, and interpret for the benefit of present and future generations resources associated with the incarceration of civilians of Japanese ancestry during World War II at Amache, also known as the Granada Relocation Center, and the military service of incarcerees at the Granada Relocation Center.The National Historic Site shall not be established until the date on which the Department of the Interior determines that a sufficient quantity of land or interests in land has been acquired to constitute a manageable park unit.After Interior makes such a determination, it shall publish in the Federal Register notice of the establishment of the historic site.Interior may acquire only by donation any land or interests in land located within the boundary of the Camp Amache National Historic Landmark.Any acquired lands or interests in land shall be included within the boundary of the historic site. Interior must prepare a general management plan for the historic site. Interior may enter into agreements with public or private entities to establish and operate facilities outside of the exterior boundary of the historic site for administration, visitor services, and curation of personal property; and other public or private entities to carry out this bill. Interior shall provide the town of Granada, Colorado, with access to those areas of the historic site determined necessary for the operation and maintenance of water infrastructure and appurtenances.Additionally, Interior may permit the town of Granada to construct or install new water infrastructure, systems, or appurtenances limited to the areas determined to be necessary.Finally, Interior may accept, for addition to and administration as part of the historic site, the donation of water infrastructure, systems, or appurtenances within the boundary of the site (including associated water rights) if the water infrastructure, systems, or appurtenances are no longer used by the town of Granada.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 4346",
            "First Name": "Lloyd Doggett",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 4346",
            "Bill Name": "CHIPS Act of 2022 / Research and Development, Competition, and Innovation Act / Supreme Court Security Funding Act of 2022",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3537 (117th)",
            "First Name": "Lloyd Doggett",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3537 (117th)",
            "Bill Name": "Accelerating Access to Critical Therapies for ALS Act",
            "Summary": "This bill establishes grant programs to address neurodegenerative diseases, such as amyotrophic lateral sclerosis (also known as ALS or Lou Gehrig's disease), and contains other related provisions.The Department of Health and Human Services (HHS) shall award grants to eligible entities for scientific research utilizing data from expanded access to investigational ALS treatments for individuals who are not otherwise eligible for clinical trials. The Food and Drug Administration (FDA) shall award grants to public and private entities to cover the costs of research and development of drugs that diagnose or treat ALS and other rare neurodegenerative diseases.HHS shall also establish the Public-Private Partnership for Neurodegenerative Diseases between the National Institutes of Health, the FDA, and at least one eligible entity (generally, an institution of higher education or a nonprofit organization). The partnership shall support the development and regulatory review of drugs that address ALS and other rare neurodegenerative diseases.The FDA shall publish on its website a five-year action plan for fostering the development of drugs that improve or extend the lives of people living with rare neurodegenerative diseases.The Government Accountability Office must report to Congress about the grants provided under this bill, including an analysis of the impact of such grants on research and development of treatments for ALS.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 263 (117th)",
            "First Name": "Lloyd Doggett",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 263 (117th)",
            "Bill Name": "Big Cat Public Safety Act",
            "Summary": "This bill revises requirements governing the trade of big cats (i.e., species of lion, tiger, leopard, cheetah, jaguar, or cougar or any hybrid of such species). Specifically, it revises restrictions on the possession and exhibition of big cats, including to restrict direct contact between the public and big cats.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3630 (117th)",
            "First Name": "Lloyd Doggett",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3630 (117th)",
            "Bill Name": "Lymphedema Treatment Act",
            "Summary": "This bill provides for Medicare coverage of lymphedema compression treatment items. Specifically, the bill provides for coverage of standard and custom fitted gradient compression garments and other approved items that are prescribed by a physician or other specified health care professional to treat lymphedema.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 567 (117th)",
            "First Name": "Lloyd Doggett",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 567 (117th)",
            "Bill Name": "Trans-Sahara Counterterrorism Partnership Program Act of 2021",
            "Summary": "This bill provides statutory authority for the Trans-Sahara Counterterrorism Partnership Program, an interagency program launched in 2005 to partner with countries in the Sahel and Maghreb regions of Africa to counter terrorism and violent extremism.The Department of State, in consultation with the Department of Defense and the U.S. Agency for International Development, shall establish the partnership program, which must coordinate all U.S. programs in North and West Africa related to various counterterrorism activities, such as building foreign-military capacity, enhancing border security, promoting youth employment, and supporting independent media to counter terrorist propaganda.The State Department must submit comprehensive, five-year strategies that include specified activities for the Sahel and Maghreb regions and for program counterterrorism efforts. Further, program activities must, among other things (1) be carried out in countries where there is an adequate level of partner country committment, and (2) have clearly defined outcomes and specific plans with indicators to regularly monitor and evaluate outcomes and impact. Such activities must also take into account the counterterrorism and development strategies of partner countries and align with such strategies to the extent possible.The State Department shall notify Congress before obligating funds for such programs, and must submit annual reports about program activities.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 390 (117th)",
            "First Name": "Lloyd Doggett",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 390 (117th)",
            "Bill Name": "To redesignate the Federal building located at 167 North Main Street in Memphis, Tennessee as the \\u201cOdell Horton Federal Building\\u201d.",
            "Summary": "This bill designates the federal building at 167 North Main Street in Memphis, Tennessee (commonly known as the Clifford Davis and Odell Horton Federal Building), as the Odell Horton Federal Building.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 4821",
            "First Name": "Lloyd Doggett",
            "Vote": "Nay",
            "Bill Number.1": "H.R. 4821",
            "Bill Name": "Department of the Interior, Environment, and Related Agencies Appropriations Act, 2024",
            "Summary": "This bill provides FY2024 appropriations for the Department of the Interior, the Environmental Protection Agency (EPA), and several related agencies.The bill provides appropriations to Interior for the Bureau of Land Management, the U.S. Fish and Wildlife Service, the National Park Service, the U.S. Geological Survey, the Bureau of Ocean Energy Management, the Bureau of Safety and Environmental Enforcement, the Office of Surface Mining Reclamation and Enforcement, the Bureau of Indian Affairs, the Bureau of Indian Education, the Bureau of Trust Funds Administration, Departmental Offices, and Department-Wide Programs. The bill also provides appropriations to the EPA and the Forest Service.Within the Department of Health and Human Services, the bill provides appropriations for the Indian Health Service, the National Institute of Environmental Health Sciences, and the Agency for Toxic Substances and Disease Registry. The bill provides appropriations to several related agencies, including the Council on Environmental Quality and Office of Environmental Quality, the Chemical Safety and Hazard Investigation Board, the Office of Navajo and Hopi Indian Relocation, the Institute of American Indian and Alaska Native Culture and Arts Development, the Smithsonian Institution, the National Gallery of Art, the John F. Kennedy Center for the Performing Arts, the Woodrow Wilson International Center for Scholars, the National Endowment for the Arts, the National Endowment for the Humanities, the Commission of Fine Arts, the Advisory Council on Historic Preservation. the National Capital Planning Commission, the U.S. Holocaust Memorial Museum, the World War I Centennial Commission, and the U.S. Semiquincentennial Commission. Additionally, the bill sets forth requirements and restrictions for using funds provided by this and other appropriations acts.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3469 (117th)",
            "First Name": "Lloyd Doggett",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 346",
            "Bill Name": "NOTAM Improvement Act of 2023",
            "Summary": "This bill directs the Federal Aviation Administration (FAA) to establish the FAA Task Force on NOTAM (notice to air missions required by international or domestic law) Improvement and requires the FAA to implement a federal NOTAM system. A NOTAM is a notice containing information essential to personnel concerned with flight operations but not known far enough in advance to be publicized by other means. It states the abnormal status of a component of the National Airspace System.Specifically, the task force must (1) review existing methods for publishing NOTAMs and flight operations information for pilots; (2) review regulations, policies, systems, and international standards relating to NOTAMs, including their content and presentation to pilots; (3) evaluate and determine best practices to organize, prioritize, and present flight operations information in a manner that optimizes pilot review and retention of relevant information; (4) provide recommendations to improve the publication and delivery of NOTAM information; and (5) report to Congress on its reviews and evaluations.By September 30, 2024, the FAA must (1) complete implementation of a federal NOTAM system and implement a back-up system, and (2) brief Congress on a plan to enhance information delivery through this federal system to promote further global harmonization and provide users of the National Airspace System a consistent format for domestic and international operations.",
            "Status": "Enacted"
        }
    ]
}