{
    "Name": "Mike Carey",
    "Profile": {
        "Public Office": {
            "Member of the U.S. House of Representativesfrom Ohio's 15th district": {
                "Incumbent": "Incumbent",
                "Assumed office": "November 4, 2021",
                "Preceded by": "Steve Stivers",
                "District Info": {
                    "Median householdincome": "$60,227",
                    "Distribution": "",
                    "Population": "784,794",
                    "Ethnicity": "75.3% ,White,17.0% ,Black,2.8% ,Two or more races,2.5% ,Hispanic,2.1% ,Asian,0.4% other"
                }
            }
        },
        "Personal Details": {
            "Personal details": {
                "Born": "(,1971-03-13,) ,March 13, 1971, (age 52),Sabina, Ohio,, U.S.",
                "Political party": "Republican",
                "Spouse": "Meghan Carey",
                "Children": "3, including Prescott Carey",
                "Education": "Marion Military Institute, (,AA,),Ohio State University, (,BA,)",
                "Website": "House website"
            }
        }
    },
    "UnusedVotingRecords": [
        {
            "Bill Number": "H.R. 6604 (117th)",
            "First Name": "Mike Carey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 6604 (117th)",
            "Bill Name": "Veterans Eligible to Transfer School (VETS) Credit Act",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 6868 (117th)",
            "First Name": "Mike Carey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 6868 (117th)",
            "Bill Name": "Cybersecurity Grants for Schools Act of 2022",
            "Summary": "This bill allows the Cybersecurity and Infrastructure Security Agency (CISA) to award grants or other financial assistance for cybersecurity and infrastructure security education and training programs at the elementary and secondary education levels. Entities eligible for the assistance include states, localities, institutions of higher education, and nonprofits. Additionally, CISA must include information about how the grants and assistance enhance cybersecurity education for underserved populations or communities in annual briefings.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3508 (117th)",
            "First Name": "Mike Carey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3508 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 39 West Main Street, in Honeoye Falls, New York, as the \\u201cCW4 Christian J. Koch Memorial Post Office\\u201d.",
            "Summary": "This bill designates the facility of the United States Postal Service located at 39 West Main Street, in Honeoye Falls, New York, as the CW4 Christian J. Koch Memorial Post Office.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 92 (117th)",
            "First Name": "Mike Carey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 92 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 110 Johnson Street in Pickens, South Carolina, as the \\u201cSpecialist Four Charles Johnson Post Office\\u201d.",
            "Summary": "This bill designates the facility of the United States Postal Service located at 110 Johnson Street in Pickens, South Carolina, as the Specialist Four Charles Johnson Post Office.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 91 (117th)",
            "First Name": "Mike Carey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 91 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 810 South Pendleton Street in Easley, South Carolina, as the \\u201cPrivate First Class Barrett Lyle Austin Post Office Building\\u201d.",
            "Summary": "This bill designates the facility of the United States Postal Service located at 810 South Pendleton Street in Easley, South Carolina, as the Private First Class Barrett Lyle Austin Post Office Building.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1096",
            "First Name": "Mike Carey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1096",
            "Bill Name": "250th Anniversary of the United States Marine Corps Commemorative Coin Act",
            "Summary": "This bill directs the Department of the Treasury to mint and issue not more than 50,000 $5 gold coins, 400,000 $1 silver coins, and 750,000 half-dollar clad coins emblematic of the 250th anniversary of the United States Marine Corps.All surcharges received by Treasury from the sale of such coins must be paid to the Marine Corps Heritage Foundation and shall only be used for the purposes of supporting the mission of the Marine Corps Heritage Center.",
            "Status": "Enacted",
            "Democrat_Yea": 0.9528301886792452,
            "Democrat_Nay": 0.0,
            "Republican_Yea": 0.9366515837104072,
            "Republican_Nay": 0.004524886877828
        },
        {
            "Bill Number": "H.R. 6386 (117th)",
            "First Name": "Mike Carey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 6386 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 450 West Schaumburg Road in Schaumburg, Illinois, as the \\u201cVeterans of Iraq and Afghanistan Memorial Post Office Building\\u201d.",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 700 (117th)",
            "First Name": "Mike Carey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 700 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 303 East Mississippi Avenue in Elwood, Illinois, as the \\u201cLawrence M. \\u2018Larry\\u2019 Walsh Sr. Post Office\\u201d.",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 5900 (117th)",
            "First Name": "Mike Carey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 5900 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 2016 East 1st Street in Los Angeles, California, as the \\u201cMarine Corps Reserve PVT Jacob Cruz Post Office\\u201d.",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 224 (117th)",
            "First Name": "Mike Carey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 224 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 5302 Galveston Road in Houston, Texas, as the Vanessa Guill\\u00e9n Post Office Building.",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1437 (117th)",
            "First Name": "Mike Carey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1437 (117th)",
            "Bill Name": "Further Continuing Appropriations and Extensions Act, 2023",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 7077 (117th)",
            "First Name": "Mike Carey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 7077 (117th)",
            "Bill Name": "Empowering the U.S. Fire Administration Act",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 935 (117th)",
            "First Name": "Mike Carey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 935 (117th)",
            "Bill Name": "Small Business Mergers, Acquisitions, Sales, and Brokerage Simplification Act of 2021",
            "Summary": "This bill exempts from securities registration requirements certain merger-and-acquisition brokers that facilitate transfer of ownership in privately held companies with earnings or revenues under a specified threshold. However, this exemption shall not apply to certain brokers, including those that provide financing related to the transfer of ownership, engage on behalf of any party in a transaction involving specified shell companies, or have been barred or suspended from association with a broker or dealer.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3672",
            "First Name": "Mike Carey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3672",
            "Bill Name": "To designate the clinic of the Department of Veterans Affairs in Indian River, Michigan, as the \\u201cPfc. Justin T. Paton Department of Veterans Affairs Clinic\\u201d.",
            "Summary": NaN,
            "Status": "Enacted",
            "Democrat_Yea": 0.9386792452830188,
            "Democrat_Nay": 0.0,
            "Republican_Yea": 0.9502262443438914,
            "Republican_Nay": 0.0
        },
        {
            "Bill Number": "H.R. 3746",
            "First Name": "Mike Carey",
            "Vote": "Aye",
            "Bill Number.1": "H.R. 3746",
            "Bill Name": "Fiscal Responsibility Act of 2023",
            "Summary": NaN,
            "Status": "Enacted",
            "Democrat_Yea": 0.9166666666666666,
            "Democrat_Nay": 0.0833333333333333,
            "Republican_Yea": 0.3469387755102041,
            "Republican_Nay": 0.6326530612244898
        },
        {
            "Bill Number": "H.R. 7276 (117th)",
            "First Name": "Mike Carey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 7276 (117th)",
            "Bill Name": "Ukraine Invasion War Crimes Deterrence and Accountability Act",
            "Summary": "This bill requires the President to report to Congress on atrocities committed during Russia's invasion of Ukraine since February 24, 2022.Specifically, the report must describe in detail (1) U.S. government efforts to collect, analyze, and preserve evidence related to war crimes and other atrocities committed during the invasion; (2) media, public diplomacy, and information operations to make the Russian people, including their military and political leaders, aware of efforts to identify and prosecute those responsible for such atrocities; and (3) the process for a domestic, foreign, or international court or tribunal to obtain information from the U.S. government related to such atrocities.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1218 (117th)",
            "First Name": "Mike Carey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1218 (117th)",
            "Bill Name": "Data Mapping to Save Moms\\u2019 Lives Act",
            "Summary": "This bill directs the Federal Communications Commission (FCC) to include data on certain maternal health outcomes in its broadband health mapping tool. This is an online platform that allows users to visualize, overlay, and analyze broadband and health data at national, state, and county levels.The FCC must consult with the Centers for Disease Control and Prevention to determine which maternal health outcomes should be incorporated.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 6833 (117th)",
            "First Name": "Mike Carey",
            "Vote": "Nay",
            "Bill Number.1": "H.R. 6833 (117th)",
            "Bill Name": "Continuing Appropriations and Ukraine Supplemental Appropriations Act, 2023",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1734",
            "First Name": "Mike Carey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1734",
            "Bill Name": "TRANQ Research Act of 2023",
            "Summary": "This bill requires the National Institute of Standards and Technology (NIST) to support research and other activities related to identifying xylazine (a compound used in veterinary medicine as a nonopioid tranquilizer), novel synthetic opioids, and other new psychoactive substances.In particular, NIST must support basic measurement science and research; near-real time spectrometry capabilities (i.e., a technique for rapidly identifying the chemical composition of a substance); strategies and voluntary best practices for handling, transporting, and analyzing such substances; and collaboration with other government agencies, institutions of higher education, and the private sector to enhance relevant narcotic and opioid detection and analysis capabilities. Additionally, the Government Accountability Office must conduct a study on the capabilities of the federal government to detect, identify, and otherwise respond to threats of new psychoactive substances, such as xylazine.",
            "Status": "Enacted",
            "Democrat_Yea": 0.9671361502347418,
            "Democrat_Nay": 0.0,
            "Republican_Yea": 0.9864864864864864,
            "Republican_Nay": 0.0
        },
        {
            "Bill Number": "H.R. 2954 (117th)",
            "First Name": "Mike Carey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 2954 (117th)",
            "Bill Name": "Securing a Strong Retirement Act of 2021",
            "Summary": "This bill makes various changes with respect to employer-sponsored retirement plans, including providing for the automatic enrollment of employees in certain plans and increasing the age at which participants are required to begin receiving mandatory distributions.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3359 (117th)",
            "First Name": "Mike Carey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3359 (117th)",
            "Bill Name": "Homicide Victims\\u2019 Families\\u2019 Rights Act of 2021",
            "Summary": "This bill establishes a framework for immediate family members of a victim of murder under federal law to request a review of the victim's case file if the murder was committed more than three years prior, the murder was investigated by a federal law enforcement entity, all probative investigative leads have been exhausted, and no likely perpetrator has been identified.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3197 (117th)",
            "First Name": "Mike Carey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3197 (117th)",
            "Bill Name": "Save the Liberty Theatre Act of 2021",
            "Summary": NaN,
            "Status": NaN
        },
        {
            "Bill Number": "H.R. 3113 (117th)",
            "First Name": "Mike Carey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3113 (117th)",
            "Bill Name": "Modernizing Access to Our Public Land Act",
            "Summary": "This bill directs the Department of the Interior, the Forest Service, and the U.S. Army Corps of Engineers to jointly develop and adopt interagency standards to ensure compatibility and interoperability among federal databases for the collection and dissemination of outdoor recreation data related to federal lands and used to depict locations at which recreation uses are available to the public.Interior, the Forest Service, and the Corps of Engineers must digitize and publish geographic information system data that includes federal interests, including easements and rights-of-way, in private land; status information as to whether roads and trails are open or closed; the dates on which roads and trails are seasonally opened and closed; the types of vehicles and recreational uses that are allowed on each segment of roads and trails; and the boundaries of areas where hunting or recreational shooting is permanently restricted or closed. Interior, the Forest Service, and the Corps of Engineers may work with the U.S. Geological Survey to collect, digitize, standardize, or publish data to meet the requirements of this bill.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 2471 (117th)",
            "First Name": "Mike Carey",
            "Vote": "Nay",
            "Bill Number.1": "H.R. 2471 (117th)",
            "Bill Name": "Consolidated Appropriations Act, 2022",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 2471 (117th)",
            "First Name": "Mike Carey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 2471 (117th)",
            "Bill Name": "Consolidated Appropriations Act, 2022",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 55 (117th)",
            "First Name": "Mike Carey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 55 (117th)",
            "Bill Name": "Emmett Till Antilynching Act",
            "Summary": "This bill makes lynching a federal hate crime offense.Specifically, the bill imposes criminal penalties—a fine, a prison term of up to 30 years, or both—on an individual who conspires to commit a hate crime offense that results in death or serious bodily injury or that includes kidnapping or an attempt to kidnap, aggravated sexual abuse or an attempt to commit aggravated sexual abuse, or an attempt to kill.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3539 (117th)",
            "First Name": "Mike Carey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3539 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 223 West Chalan Santo Papa in Hagatna, Guam, as the \\u201cAtanasio Taitano Perez Post Office\\u201d.",
            "Summary": "This bill designates the facility of the United States Postal Service located at 223 West Chalan Santo Papa in Hagatna, Guam, as the Atanasio Taitano Perez Post Office.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 735 (117th)",
            "First Name": "Mike Carey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 735 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 502 East Cotati Avenue in Cotati, California, as the \\u201cArturo L. Ibleto Post Office Building\\u201d.",
            "Summary": "This bill designates the facility of the United States Postal Service located at 502 East Cotati Avenue in Cotati, California, as the Arturo L. Ibleto Post Office Building.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3076 (117th)",
            "First Name": "Mike Carey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3076 (117th)",
            "Bill Name": "Postal Service Reform Act of 2022",
            "Summary": "This bill addresses the finances and operations of the U.S. Postal Service (USPS).The bill requires the Office of Personnel Management (OPM) to establish the Postal Service Health Benefits Program within the Federal Employees Health Benefits Program under which OPM may contract with carriers to offer health benefits plans for USPS employees and retirees.The bill provides for coordinated enrollment of retirees under this program and Medicare.The bill repeals the requirement that the USPS annually prepay future retirement health benefits.Additionally, the USPS may establish a program to enter into agreements with an agency of any state government, local government, or tribal government, and with other government agencies, to provide certain nonpostal products and services that reasonably contribute to the costs of the USPS and meet other specified criteria.The USPS must develop and maintain a publicly available dashboard to track service performance and must report regularly on its operations and financial condition.The Postal Regulatory Commission must annually submit to the USPS a budget of its expenses. It must also conduct a study to identify the causes and effects of postal inefficiencies relating to flats (e.g., large envelopes).The USPS Office of Inspector General shall perform oversight of the Postal Regulatory Commission.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 2324 (117th)",
            "First Name": "Mike Carey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 2324 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 2800 South Adams Street in Tallahassee, Florida, as the \\u201cD. Edwina Stephens Post Office\\u201d.",
            "Summary": "This bill designates the facility of the United States Postal Service located at 2800 South Adams Street in Tallahassee, Florida, as the D. Edwina Stephens Post Office.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1226",
            "First Name": "Mike Carey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1226",
            "Bill Name": "Wounded Warrior Access Act",
            "Summary": NaN,
            "Status": "Enacted",
            "Democrat_Yea": 0.9575471698113208,
            "Democrat_Nay": 0.0,
            "Republican_Yea": 0.9864864864864864,
            "Republican_Nay": 0.0
        },
        {
            "Bill Number": "H.R. 5577 (117th)",
            "First Name": "Mike Carey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 5577 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 3900 Crown Road Southwest in Atlanta, Georgia, as the \\u201cJohn R. Lewis Post Office Building\\u201d.",
            "Summary": "This bill designates the facility of the United States Postal Service located at 3900 Crown Road Southwest in Atlanta, Georgia, as the John R. Lewis Post Office Building.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 346",
            "First Name": "Mike Carey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 346",
            "Bill Name": "NOTAM Improvement Act of 2023",
            "Summary": "This bill directs the Federal Aviation Administration (FAA) to establish the FAA Task Force on NOTAM (notice to air missions required by international or domestic law) Improvement and requires the FAA to implement a federal NOTAM system. A NOTAM is a notice containing information essential to personnel concerned with flight operations but not known far enough in advance to be publicized by other means. It states the abnormal status of a component of the National Airspace System.Specifically, the task force must (1) review existing methods for publishing NOTAMs and flight operations information for pilots; (2) review regulations, policies, systems, and international standards relating to NOTAMs, including their content and presentation to pilots; (3) evaluate and determine best practices to organize, prioritize, and present flight operations information in a manner that optimizes pilot review and retention of relevant information; (4) provide recommendations to improve the publication and delivery of NOTAM information; and (5) report to Congress on its reviews and evaluations.By September 30, 2024, the FAA must (1) complete implementation of a federal NOTAM system and implement a back-up system, and (2) brief Congress on a plan to enhance information delivery through this federal system to promote further global harmonization and provide users of the National Airspace System a consistent format for domestic and international operations.",
            "Status": "Enacted",
            "Democrat_Yea": 0.9764150943396226,
            "Democrat_Nay": 0.0,
            "Republican_Yea": 0.9774774774774776,
            "Republican_Nay": 0.018018018018018
        }
    ],
    "CosponsoredBills": [
        {
            "Bill Number": "H.R. 1096",
            "First Name": "Mike  Carey",
            "Last Name": "cosponsor",
            "Role": "H.R. 1096",
            "Bill Name": "250th Anniversary of the United States Marine Corps Commemorative Coin Act",
            "Subject Areas": "Military personnel and dependents",
            "Summary": "This bill directs the Department of the Treasury to mint and issue not more than 50,000 $5 gold coins, 400,000 $1 silver coins, and 750,000 half-dollar clad coins emblematic of the 250th anniversary of the United States Marine Corps.All surcharges received by Treasury from the sale of such coins must be paid to the Marine Corps Heritage Foundation and shall only be used for the purposes of supporting the mission of the Marine Corps Heritage Center."
        },
        {
            "Bill Number": "H.R. 4622 (117th)",
            "First Name": "Mike  Carey",
            "Last Name": "cosponsor",
            "Role": "H.R. 4622 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 226 North Main Street in Roseville, Ohio, as the Ronald E. Rosser Post Office.",
            "Subject Areas": NaN,
            "Summary": NaN
        },
        {
            "Bill Number": "H.R. 7073 (117th)",
            "First Name": "Mike  Carey",
            "Last Name": "cosponsor",
            "Role": "H.R. 7073 (117th)",
            "Bill Name": "Into the Light for MMH and SUD Act of 2022",
            "Subject Areas": NaN,
            "Summary": "This bill reauthorizes through FY2028 a program that addresses maternal depression and, among other changes, expands its scope to include mental health and substance use disorders. It also requires the Department of Health and Human Services to maintain a national hotline to provide mental health and substance use disorder resources to pregnant and postpartum women and their families."
        },
        {
            "Bill Number": "H.R. 1842 (117th)",
            "First Name": "Mike  Carey",
            "Last Name": "cosponsor",
            "Role": "H.R. 1842 (117th)",
            "Bill Name": "Harriet Tubman Bicentennial Commemorative Coin Act",
            "Subject Areas": "U.S. history, Women's rights",
            "Summary": "This bill directs the Department of the Treasury to mint and issue 50,000 $5 gold coins, 400,000 $1 silver coins, and 750,000 half-dollar clad coins emblematic of the legacy of Harriet Tubman as an abolitionist.The Secretary may issue coins under this bill only during the period of January 1, 2024, through December 31, 2024.All surcharges received by Treasury from the sale of such coins must be paid equally to the National Underground Railroad Freedom Center in Cincinnati, Ohio, and The Harriet Tubman Home, Inc. in Auburn, New York, for the purpose of accomplishing and advancing their missions."
        },
        {
            "Bill Number": "H.R. 3577 (117th)",
            "First Name": "Mike  Carey",
            "Last Name": "cosponsor",
            "Role": "H.R. 3577 (117th)",
            "Bill Name": "United States Army Rangers Veterans of World War II Congressional Gold Medal Act",
            "Subject Areas": "Armed Forces and National Security, Conflicts and wars, Congressional tributes, Military history, Museums, exhibitions, cultural centers, Smithsonian Institution, Veterans' organizations and recognition",
            "Summary": "This bill provides for the award of a single Congressional Gold Medal to the U.S. Army Rangers Veterans of World War II in recognition of their dedicated service during World War II."
        }
    ],
    "VotingRecord": [
        {
            "Bill Number": "H.R. 7454",
            "First Name": "Mike Carey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 7454",
            "Bill Name": "Airport and Airway Extension Act of 2024",
            "Summary": "This bill temporarily extends specific Federal Aviation and Administration (FAA) programs and activities through May 10, 2024.For example, the bill extends the FAA Unmanned Aircraft Systems (UAS) pilot programs (e.g., the UAS Test Site Program and the UAS remote detection and identification pilot program), weather reporting programs, Remote Tower Pilot Program, and Essential Air Service Program. The bill also extends the authorization for the Airport Improvement Program (AIP). (This program provides grants for planning, development, and noise compatibility projects at or associated with certain public-use airports.)Further, the bill extends through May 10, 2024, the FAA's authority for expenditures from the Airport and Airway Trust Fund (AATF) and to collect various taxes and fees to fund the AATF, including taxes on aviation fuel and airline tickets. (The AATF is the primary funding source for all major FAA accounts that fund federal aviation programs, with the remainder coming from general fund appropriations.)The bill also extends through May 10, 2024, the authority of the Department of Homeland Security and the Department of Justice to take certain actions to mitigate a credible threat to certain facilities or assets from a UAS. These include certain facilities that are located in the United States and identified as high-risk and a potential target for unlawful UAS activity.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 390 (117th)",
            "First Name": "Mike Carey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 390 (117th)",
            "Bill Name": "To redesignate the Federal building located at 167 North Main Street in Memphis, Tennessee as the \\u201cOdell Horton Federal Building\\u201d.",
            "Summary": "This bill designates the federal building at 167 North Main Street in Memphis, Tennessee (commonly known as the Clifford Davis and Odell Horton Federal Building), as the Odell Horton Federal Building.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3843 (117th)",
            "First Name": "Mike Carey",
            "Vote": "Nay",
            "Bill Number.1": "H.R. 3843 (117th)",
            "Bill Name": "Merger Filing Fee Modernization Act of 2022",
            "Summary": "This bill modifies and expands the schedule for graduated merger filing fees and requires that such fees be adjusted each year based on the Consumer Price Index. It also (1) requires parties to disclose in their premerger notification filings any subsidy received from a foreign entity of concern, (2) modifies the venue rules for multi-district antitrust litigation, and (3) establishes various reporting requirements.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1437 (117th)",
            "First Name": "Mike Carey",
            "Vote": "Nay",
            "Bill Number.1": "H.R. 1437 (117th)",
            "Bill Name": "Further Continuing Appropriations and Extensions Act, 2023",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 4394",
            "First Name": "Mike Carey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 4394",
            "Bill Name": "Energy and Water Development and Related Agencies Appropriations Act, 2024",
            "Summary": "This bill provides FY2024 appropriations for U.S. Army Corps of Engineers civil works projects, the Department of the Interior's Bureau of Reclamation, the Department of Energy (DOE), and several independent agencies.The bill provides appropriations for U.S. Army Corps of Engineers civil works projects, including for Investigations, Construction, Mississippi River and Tributaries, Operation and Maintenance, the Regulatory Program, the Formerly Utilized Sites Remedial Action Program, Flood Control and Coastal Emergencies, Expenses, the Office of the Assistant Secretary of the Army for Civil Works, and the Water Infrastructure Finance and Innovation Program. The bill provides appropriations to the Department of the Interior for the Central Utah Project and the Bureau of Reclamation.The bill provides appropriations to DOE for energy programs, including Energy Efficiency and Renewable Energy; Cybersecurity, Energy Security, and Emergency Response; Electricity; Nuclear Energy; Fossil Energy and Carbon Management; Naval Petroleum and Oil Shale Reserves; the Strategic Petroleum Reserve; the Northeast Home Heating Oil Reserve; the Energy Information Administration; Non-Defense Environmental Cleanup; the Uranium Enrichment Decontamination and Decommissioning Fund; Science; Nuclear Waste Disposal; Technology Transitions; Clean Energy Demonstrations; the Advanced Research Projects Agency—Energy; the Title 17 Innovative Technology Loan Guarantee Program; the Advanced Technology Vehicles Manufacturing Loan Program; the Tribal Energy Loan Guarantee Program; Indian Energy Policy and Programs; Departmental Administration; and the Office of the Inspector General. The bill also provides appropriations to DOE for Atomic Energy Defense Activities of the National Nuclear Security Administration, Environmental and Other Defense Activities, and the Power Marketing Administrations. The bill provides appropriations to several independent agencies, including the Federal Energy Regulatory Commission and the Nuclear Regulatory Commission.The bill includes provisions that address the operation of the Central Valley Project (CVP), which is a federal water project in California owned and operated by the Bureau of Reclamation, and the California State Water Project (SWP), which is operated jointly with the CVP.In addition, the bill makes the Bureau of Reclamation the lead agency for the purpose of coordinating all permitting and related activities required to construct certain new surface water storage projects.The bill also sets forth requirements and restrictions for using funds provided by this and other appropriations acts.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3630 (117th)",
            "First Name": "Mike Carey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3630 (117th)",
            "Bill Name": "Lymphedema Treatment Act",
            "Summary": "This bill provides for Medicare coverage of lymphedema compression treatment items. Specifically, the bill provides for coverage of standard and custom fitted gradient compression garments and other approved items that are prescribed by a physician or other specified health care professional to treat lymphedema.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 2220 (117th)",
            "First Name": "Mike Carey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 2220 (117th)",
            "Bill Name": "To amend title 40, United States Code, to modify the treatment of certain bargain-price options to purchase at less than fair market value, and for other purposes.",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 897 (117th)",
            "First Name": "Mike Carey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 897 (117th)",
            "Bill Name": "Agua Caliente Land Exchange Fee to Trust Confirmation Act",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 4366",
            "First Name": "Mike Carey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 4366",
            "Bill Name": "Consolidated Appropriations Act, 2024",
            "Summary": "This bill provides FY2024 appropriations for several federal departments and agencies. It also extends various expiring programs and authorities, including several public health programs.Specifically, the bill includes 6 of the 12 regular FY2024 appropriations bills: the Military Construction, Veterans Affairs, and Related Agencies Appropriations Act, 2024; the Agriculture, Rural Development, Food and Drug Administration, and Related Agencies Appropriations Act, 2024; the Commerce, Justice, Science, and Related Agencies Appropriations Act, 2024; the Energy and Water Development and Related Agencies Appropriations Act, 2024; the Department of the Interior, Environment, and Related Agencies Appropriations Act, 2024; and the Transportation, Housing and Urban Development, and Related Agencies Appropriations Act, 2024. The departments, agencies, and activities funded in the bill include Department of Defense military construction and family housing activities, the Department of Veterans Affairs, the Department of Agriculture, the Food and Drug Administration, the Department of Commerce, the Department of Justice, the science agencies, the Department of Energy, the U.S. Army Corps of Engineers, the Department of the Interior, the Environmental Protection Agency, the Department of Transportation, the Department of Housing and Urban Development, and several related and independent agencies. In addition, the bill includes several provisions that extend or otherwise modify various programs and authorities, including several public health programs.The bill also modifies the Compacts of Free Association that govern the relationship between the United States and the Republic of the Marshall Islands, the Federated States of Micronesia, and the Republic of Palau.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 7335 (117th)",
            "First Name": "Mike Carey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 7335 (117th)",
            "Bill Name": "MST Claims Coordination Act",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 6503",
            "First Name": "Mike Carey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 6503",
            "Bill Name": "Airport and Airway Extension Act of 2023, Part II",
            "Summary": "This bill temporarily extends specific Federal Aviation and Administration (FAA) programs and activities through March 8, 2024.For example, the bill extends the FAA Unmanned Aircraft Systems (UAS) pilot programs (e.g., the UAS Test Site Program and the UAS remote detection and identification pilot program), weather reporting programs, Remote Tower Pilot Program, and Essential Air Service Program. The bill also extends the authorization for the Airport Improvement Program (AIP). (This program provides grants for planning, development, and noise compatibility projects at or associated with certain public-use airports.)Further, the bill extends through March 8, 2024, the FAA's authority for expenditures from the Airport and Airway Trust Fund (AATF) and to collect various taxes and fees to fund the AATF, including taxes on aviation fuel and airline tickets. (The AATF is the primary funding source for all major FAA accounts that fund federal aviation programs, with the remainder coming from general fund appropriations.)",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 4368",
            "First Name": "Mike Carey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 4368",
            "Bill Name": "Agriculture, Rural Development, Food and Drug Administration, and Related Agencies Appropriations Act, 2024",
            "Summary": "This bill provides FY2024 appropriations for the Department of Agriculture (USDA), the Food and Drug Administration, and related agencies.The bill provides appropriations to USDA for agricultural programs, including the Office of the Secretary, Executive Operations, the Economic Research Service, the National Agricultural Statistics Service, the Agricultural Research Service, the National Institute of Food and Agriculture, the Animal and Plant Health Inspection Service, the Agricultural Marketing Service, and the Food Safety and Inspection Service. The bill also provides appropriations to USDA for farm production and conservation programs, including the Farm Production and Conservation Business Center, the Farm Service Agency, the Risk Management Agency, and the Natural Resources Conservation Service. The bill provides appropriations to the Federal Crop Insurance Corporation Fund and the Commodity Credit Corporation Fund.For USDA rural development programs, the bill includes appropriations forSalaries and Expenses, the Rural Housing Service, the Rural Business-Cooperative Service, and the Rural Utilities Service. The bill provides appropriations to the Food and Nutrition Service for Child Nutrition Programs; the Special Supplemental Nutrition Program for Women, Infants, and Children (WIC); the Supplemental Nutrition Assistance Program (SNAP); the Commodity Assistance Program; and Nutrition Programs Administration. The bill provides appropriations to the Foreign Agricultural Service for (1) Food for Peace Title II Grants, and (2) McGovern-Dole International Food for Education and Child Nutrition Program Grants.The bill also provides appropriations for the Food and Drug Administration, the Commodity Futures Trading Commission, and the Farm Credit Administration. Additionally, the bill sets forth requirements and restrictions for using funds provided by this and other appropriations acts.",
            "Status": "Failed"
        },
        {
            "Bill Number": "H.R. 6363",
            "First Name": "Mike Carey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 6363",
            "Bill Name": "Further Continuing Appropriations and Other Extensions Act, 2024",
            "Summary": "This bill provides continuing FY2024 appropriations for federal agencies. The bill also extends several expiring programs and authorities, including programs authorized by the 2018 farm bill and several public health programs.DIVISION A--FURTHER CONTINUING APPROPRIATIONS ACT, 2024Further Continuing Appropriations Act, 2024(Sec. 101) This section provides continuing FY2024 appropriations for federal agencies and extends several expiring programs and authorities.It is known as a continuing resolution (CR) and prevents a government shutdown that would otherwise occur if the FY2024 appropriations bills have not been enacted when the existing CR expires on November 17, 2023.The CR provides funding through January 19, 2024, for agencies and programs that were funded in the following four FY2023 appropriations acts: the Agriculture, Rural Development, Food and Drug Administration, and Related Agencies Appropriations Act, 2023; the Energy and Water Development and Related Agencies Appropriations Act, 2023; the Military Construction, Veterans Affairs, and Related Agencies Appropriations Act, 2023; and the Transportation, Housing and Urban Development, and Related Agencies Appropriations Act, 2023. For most other federal agencies and programs, the CR provides funding through February 2, 2024.The CR generally funds most programs and activities at the FY2023 levels with several exceptions that provide funding flexibility and additional appropriations for various programs. For example, the CR includes exceptions for: the Navy's procurement of one Columbia Class Submarine, activities of the U.S. Secret Service that are related to National Special Security Events and the 2024 Presidential Campaign, and activities of the Department of Education that are necessary to ensure the continuation of student loan servicing activities. This section also extends several expiring programs and authorities, including the U.S. Parole Commission, the authority for the Department of Defense (DOD) to provide physical protection and personal security for certain former or retired DOD officials who face serious and credible threats arising from duties performed while employed by DOD, restrictions on firearms that are undetectable by walk-through metal detectors and X-ray machines commonly used at airports, limits on pay increases for the Vice President and certain senior political appointees, the exemption from the Antideficiency Act for the Federal Communications Commission's Universal Service Fund, and the Department of Homeland Security's Countering Weapons of Mass Destruction Office. This section provides appropriations for a payment to Katherine Anne Feinstein, the beneficiary of the late Senator Dianne Feinstein.DIVISION B--OTHER MATTERSTITLE I--EXTENSIONS AND OTHER MATTERS(Sec. 101) This section extends provisions that provide grants and other financial assistance to the Federated States of Micronesia and the Republic of the Marshall Islands.(Sec. 102) This section extends programs authorized by the Agriculture Improvement Act of 2018 (commonly known as the 2018 farm bill) until the later of (1) September 30, 2024, or (2) the date specified in the provision of the act.This section extends and amends Department of Agriculture (USDA) commodity programs, including by extending various programs for covered commodities, a loan commodity, sugarcane, or sugar beets for the 2024 crop year; extending the Dairy Margin Coverage (DMC) program through December 31, 2024; limiting the 25% premium discount for the DMC program in 2024 to participating dairy operations that received the discount in 2023; allowing Dairy Forward Pricing Program contracts to be extended through September 30, 2027 (currently September 30, 2026); extending the Price Loss Coverage (PLC) payments through the 2024 crop year for a covered commodity; extending the suspension of permanent price support authorities for the 2024 crop year for covered commodities, cotton, and sugar and through December 31, 2024, for milk; and extending the suspension of provisions related to corn and wheat marketing quotas for wheat planted for harvest in calendar year 2024. This section reauthorizes, and extends funding for, the Grassroots Source Water Protection Program (SWPP) for FY2024. The SWPP is a joint project with the Farm Service Agency and the National Rural Water Association (a nonprofit water and wastewater utility membership organization), which is designed to help prevent pollution of surface and ground water that is used as the primary source of drinking water by rural residents.This section reauthorizes, and extends funding for, the Voluntary Public Access and Habitat Incentive Program through FY2024. The program provides funding to help state and tribal governments encourage landowners to allow public access to their land for hunting, fishing, and other wildlife-dependent recreation.This section reauthorizes, and extends funding for, the Feral Swine Eradication and Control Pilot Program through FY2024. The program responds to the threat feral swine pose to agriculture, native ecosystems, and human and animal health.This section extends the Bill Emerson Humanitarian Trust through FY2024 to allow for eligible commodities to remain in the trust until September 30, 2024. The program makes funds available to provide emergency food assistance to developing countries.This section extends the Emergency Food Assistance Program (TEFAP) through FY2024. TEFAP provides food commodities (and cash support for storage and distribution costs) through states to local emergency feeding organizations (e.g., food banks).This section reauthorizes, and extends funding for, the Rural Economic Development Loan & Grant Program through FY2024 to provide funding for rural projects through local utility organizations.This section provides specified funds for scholarships for students at 1890 Institutions and extends the annual grant limitation by one year. This National Institute of Food and Agriculture (NIFA) program provides grants to 1890 Institutions (i.e., historically Black colleges and universities that belong to the U.S. land-grant university system) for awarding scholarships to students who intend to pursue a career in the food and agricultural sciences.This section also reauthorizes, and extends funding for, the Urban, Indoor, and other Emerging Agricultural Production Research, Education, and Extension Initiative for FY2024, a NIFA competitive grant program; provides specified funds for the Foundation for Food and Agriculture Research, a nonprofit corporation established to advance the research mission of USDA by supporting research activities focused on key problems of national and international significance; and extends through FY2024 a provision that prohibits USDA from declaring the Grazinglands Research Laboratory in El Reno, Oklahoma, to be excess or surplus federal property, or otherwise conveying or transferring the property. This section reauthorizes, and extends funding for, the biobased markets program (i.e., BioPreferred Program) through FY2024 to promote biobased products through (1) mandatory purchasing requirements for federal agencies and their contractors, and (2) a voluntary labeling initiative for biobased products.This section reauthorizes, and extends funding for, the bioenergy program for advanced biofuels (i.e., Advanced Biofuel Payment Program) through FY2024. The program provides payments to fuel producers to support and expand production of advanced biofuels (i.e., not derived from corn starch).This section extends through the 2024 crop the Feedstock Flexibility Program (FFP) for Bioenergy Producers, which allows the Commodity Credit Corporation to purchase surplus sugar from processors for resale to ethanol producers for ethanol fuel. Further, this section extends through September 1, 2024, requirements for USDA to provide notice to eligible entities and bioenergy producers of the quantity of eligible commodities that must be made available for purchase and sale for the crop year.This section extends the authority and funding through FY2024 for USDA to collect and report data on the production and marketing of organic agricultural products.This section reauthorizes, and extends funding through FY2024 for, modernization and improvement of international trade technology systems and data collection for imports of organically produced agricultural products.This section reauthorizes, and extends funding for, the Organic Certification Cost Share Program for FY2024. The program provides cost-share assistance to producers and handlers of agricultural products who are obtaining or renewing their certification under the National Organic Program.This section reauthorizes, and extends funding for, the multiple crop and pesticide use survey of farmers through FY2024. The USDA Office of Pest Management Policy conducts this survey to collect data for risk assessment modeling and mitigation for an active ingredient.This section also extends the Pima Agriculture Cotton Trust Fund through December 31, 2024, which provides assistance to reduce the economic injury to domestic manufacturers resulting from tariffs on cotton fabric that are higher than tariffs on certain apparel articles made of cotton fabric; the Agriculture Wool Apparel Manufacturers Trust Fund through December 31, 2024, which provides assistance to reduce the economic injury to domestic manufacturers resulting from tariffs on wool fabric that are higher than tariffs on certain apparel articles made of wool fabric; the Wool Research and Promotion Program through FY2024, which provides grants to assist U.S. wool producers with improving the quality of wool and with developing and promoting the wool market; the Emergency Citrus Disease Research and Development Trust Fund through FY2024, which funds a program that aims to bring together scientists to find scientifically sound and financially sustainable solutions to Huanglongbing (i.e., citrus greening, a bacterial disease spread by an insect that feeds on citrus); and the Sheep Production & Marketing Grant Program through FY2024, which seeks to strengthen and enhance the production and marketing of sheep and sheep products in the United States. This section specifies that the extension of farm bill programs does not apply to certain mandatory funding that was provided for (1) the Farm Service Agency to implement USDA commodity programs, and (2) certain payments under the Conservation Reserve Program for forest management thinning and transition contracts.This section extends various reporting requirements authorized by the Agriculture Improvement Act of 2018.This section rescinds specified funds that were provided to USDA for the Biorefinery, Renewable Chemical, and Biobased Product Manufacturing Assistance Program, which provides loan guarantees to assist in the development of new and emerging technologies for the development of advanced biofuels, renewable chemicals, and biobased product manufacturing.This section, with limited exceptions, must be applied and administered as if it had been enacted on September 30, 2023.TITLE II--HEALTH AND HUMAN SERVICESSubtitle A--Public Health Extenders(Sec. 201) This section extends through January 19, 2024, funding for the Teaching Health Center Graduate Medical Education Program, the Community Health Center Fund, and the National Health Services Corps. (The program supports education and training of medical students in primary care residency programs in community-based ambulatory patient care centers. The fund supports (1) grants for outpatient health care facilities that serve medically underserved populations; and (2) the National Health Service Corps, which provides scholarships and student loan repayment awards to health care providers who agree to work in areas with health care provider shortages.)(Sec. 202) This section extends funding through January 19, 2024, for the Special Diabetes Program for Type I Diabetes and the Special Diabetes Program for Indians. (The Special Diabetes Program for Type I Diabetes supports research on the prevention and cure of Type I diabetes, and the Special Diabetes Program for Indians supports diabetes treatment and prevention for tribal populations.)(Sec. 203) This section extends through January 19, 2024, the authority that allows states and tribes to request the temporary reassignment of state and local health department personnel who are funded through certain federal programs to immediately address a public health emergency.It also extends through January 19, 2024, provisions that prohibit the disclosure of information about Department of Health and Human Services (HHS) programs that could compromise national security (e.g., information regarding biomedical threats).The section extends provisions that authorize HHS to engage with developers of medical countermeasures, and that provide for related antitrust exemptions, for the purpose of furthering product development.Additionally, the section extends through January 19, 2024, the National Advisory Committee on Children and Disasters, the National Advisory Committee on Seniors and Disasters, and the National Advisory Committee on Individuals with Disabilities and Disasters.It also extends through January 19, 2024, the authority of HHS to directly appoint candidates to positions within the National Disaster Medical System if HHS determines the number of personnel in the system is insufficient to address a public health emergency or potential public health emergency.(The National Disaster Medical System is a partnership between HHS, the Department of Defense, and other federal departments that responds to public health and other emergencies, including by deploying medical response teams.)Subtitle B--Medicaid(Sec. 301) This section delays reductions to Medicaid disproportionate-share hospital (DSH) allotments until January 20, 2024. (DSHs are hospitals that receive additional payments under Medicaid for treating a large share of low-income patients.)(Sec. 302) This section reduces the amount of funding available to the Medicaid Improvement Fund for activities relating to mechanized claims systems beginning in FY2028.Subtitle C--Human Services(Sec. 401) This section funds through January 19, 2024, programs that support child welfare services and activities. Specifically, it funds the (1) Stephanie Tubbs Jones Child Welfare Service Program, which provides grants to states and Indian tribes to support preventive interventions and other activities to keep families together; and (2) the MaryLee Allen Promoting Safe and Stable Families Program, which supports efforts to prevent the unnecessary separation of children from their families, improve quality of care and services to children and their families, and ensure permanent living arrangements for children (e.g., parental reunification or adoption).(Sec. 402) This section extends funding through January 19, 2024, for the Sexual Risk Avoidance Education Program. This program supports projects to implement sexual risk avoidance education that teaches participants to voluntarily refrain from nonmarital sexual activities.(Sec. 403) This section extends funding through January 19, 2024, for the Personal Responsibility Education Program. This program provides grants to states to educate young people about abstinence and contraception for prevention of pregnancy and sexually transmitted infections. The program also supports pregnant and parenting youth.Subtitle D--Medicare(Sec. 501) This section extends through January 19, 2024, certain minimum adjustments to the work geographic index with respect to payments for physician services under Medicare.(Sec. 502) This section delays until 2025 certain laboratory reporting requirements that are used to determine payment rates for clinical diagnostic laboratory tests under Medicare, as well as related payment reductions.(Sec. 503) This section increases funding for the Medicare Improvement Fund.TITLE III--MISCELLANEOUS EXTENSIONS(Sec. 601) This section extends through February 3, 2024, the authority of the Department of Homeland Security and the Department of Justice to take certain actions to mitigate a credible threat to certain facilities or assets from an unmanned aircraft system (UAS). These include certain facilities that are located in the United States and identified as high-risk and a potential target for unlawful UAS activity.TITLE IV--BUDGETARY EFFECTS(Sec. 701) This section exempts the budgetary effects of this division from (1) the Statutory Pay-As-You-Go Act of 2010 (PAYGO Act), (2) the Senate PAYGO rule, and (3) certain budget scorekeeping rules.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 6833 (117th)",
            "First Name": "Mike Carey",
            "Vote": "Nay",
            "Bill Number.1": "H.R. 6833 (117th)",
            "Bill Name": "Continuing Appropriations and Ukraine Supplemental Appropriations Act, 2023",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3537 (117th)",
            "First Name": "Mike Carey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3537 (117th)",
            "Bill Name": "Accelerating Access to Critical Therapies for ALS Act",
            "Summary": "This bill establishes grant programs to address neurodegenerative diseases, such as amyotrophic lateral sclerosis (also known as ALS or Lou Gehrig's disease), and contains other related provisions.The Department of Health and Human Services (HHS) shall award grants to eligible entities for scientific research utilizing data from expanded access to investigational ALS treatments for individuals who are not otherwise eligible for clinical trials. The Food and Drug Administration (FDA) shall award grants to public and private entities to cover the costs of research and development of drugs that diagnose or treat ALS and other rare neurodegenerative diseases.HHS shall also establish the Public-Private Partnership for Neurodegenerative Diseases between the National Institutes of Health, the FDA, and at least one eligible entity (generally, an institution of higher education or a nonprofit organization). The partnership shall support the development and regulatory review of drugs that address ALS and other rare neurodegenerative diseases.The FDA shall publish on its website a five-year action plan for fostering the development of drugs that improve or extend the lives of people living with rare neurodegenerative diseases.The Government Accountability Office must report to Congress about the grants provided under this bill, including an analysis of the impact of such grants on research and development of treatments for ALS.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 4346",
            "First Name": "Mike Carey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 4346",
            "Bill Name": "CHIPS Act of 2022 / Research and Development, Competition, and Innovation Act / Supreme Court Security Funding Act of 2022",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 6965 (117th)",
            "First Name": "Mike Carey",
            "Vote": "Nay",
            "Bill Number.1": "H.R. 6965 (117th)",
            "Bill Name": "Visit America Act",
            "Summary": "This bill implements measures to support the U.S. travel and tourism industry and to address the declining percentage of international visitors to the United States.Specifically, the bill requires the Department of Commerce to develop a 10-year travel and tourism strategy with annual goals for the number of international visitors to the United States and for tourism commerce. The bill also establishes the role of Assistant Secretary of Commerce for Travel and Tourism, whose responsibilities shall include setting an annual goal for the number of international visitors to the United States and facilitating international business travel to the United States.Further, the assistant secretary must develop and implement a COVID-19 pandemic recovery strategy to assist the recovery of the U.S. travel and tourism industry.The bill also provides statutory authority for the United States Travel and Tourism Advisory Board, which shall aid the assistant secretary in developing and implementing the COVID-19 pandemic recovery strategy.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 4367",
            "First Name": "Mike Carey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 4367",
            "Bill Name": "Department of Homeland Security Appropriations Act, 2024",
            "Summary": "This bill provides FY2024 appropriations for the Department of Homeland Security (DHS).Specifically, the bill provides appropriations to DHS for Departmental Management, Intelligence, Situational Awareness, and Oversight, including the Office of the Secretary and Executive Management; the Management Directorate; Intelligence, Analysis, and Situational Awareness; and the Office of the Inspector General. In addition, the bill provides appropriations for Security, Enforcement, and Investigations, including U.S. Customs and Border Protection, U.S. Immigration and Customs Enforcement, the Transportation Security Administration, the U.S. Coast Guard, and the U.S. Secret Service. The bill provides appropriations for Protection, Preparedness, Response, and Recovery, including the Cybersecurity and Infrastructure Security Agency, and the Federal Emergency Management Agency (FEMA). The bill provides appropriations for Research, Development, Training, and Services, including U.S. Citizenship and Immigration Services, the Federal Law Enforcement Training Centers, the Science and Technology Directorate, and the Countering Weapons of Mass Destruction Office. The bill also sets forth requirements and restrictions for using funds provided by this and other appropriations acts.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 4665",
            "First Name": "Mike Carey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 4665",
            "Bill Name": "Department of State, Foreign Operations, and Related Programs Appropriations Act, 2024",
            "Summary": "This bill provides FY2024 appropriations for the Department of State, foreign operations, and related programs.The bill provides appropriations to the State Department for Administration of Foreign Affairs, International Organizations, and International Commissions. The bill provides appropriations for related agencies and programs, including the U.S. Agency for Global Media, the Asia Foundation, the U.S. Institute of Peace, the Center for Middle Eastern-Western Dialogue Trust Fund, the Eisenhower Exchange Fellowship Program, the Israeli Arab Scholarship Program, the East-West Center, and the National Endowment for Democracy. The bill provides appropriations for other commissions, including the Commission for the Preservation of America's Heritage Abroad, the U.S. Commission on International Religious Freedom, the Commission on Security and Cooperation in Europe, the Congressional-Executive Commission on the People's Republic of China, and the U.S.-China Economic and Security Review Commission. The bill provides appropriations to the U.S. Agency for International Development (USAID), the State Department and the President for International Security Assistance, and International Financial Institutions for Multilateral Assistance. The bill provides appropriations for bilateral economic assistance, including programs and activities conducted by the President; the State Department; Independent Agencies, including the Peace Corps, the Millennium Challenge Corporation, the Inter-American Foundation, and the U.S. African Development Foundation; and the Department of the Treasury. The bill provides appropriations for export and investment assistance to the Export-Import Bank of the United States, the U.S. International Development Finance Corporation, and the U.S. Trade and Development Agency. The bill sets forth requirements and restrictions for using funds provided by this and other appropriations acts.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 7776 (117th)",
            "First Name": "Mike Carey",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 7776 (117th)",
            "Bill Name": "James M. Inhofe National Defense Authorization Act for Fiscal Year 2023",
            "Summary": NaN,
            "Status": "Enacted"
        }
    ]
}