{
    "Name": "Ted Budd",
    "Profile": {
        "Public Office": {
            "United States Senatorfrom North Carolina": {
                "Incumbent": "Incumbent",
                "Assumed office": "January 3, 2023Serving with Thom Tillis",
                "Preceded by": "Richard Burr"
            },
            "Member of the U.S. House of Representativesfrom North Carolina's 13th district": {
                "In office": "January 3, 2017 – January 3, 2023",
                "Preceded by": "George Holding",
                "Succeeded by": "Wiley Nickel",
                "District Info": {
                    "Median householdincome": "$58,845",
                    "Distribution": "63.35% urban,36.65% rural",
                    "Population": "754,893",
                    "Ethnicity": "75.7% ,White,11.5% ,Black,7.7% ,Hispanic,2.8% ,Asian,2.5% ,Native American,0.1% ,Pacific Islander Americans,0.1% other"
                }
            }
        },
        "Personal Details": {
            "Personal details": {
                "Born": "Theodore Paul Budd, (,1971-10-21,) ,October 21, 1971, (age 51),Winston-Salem, North Carolina,, U.S.",
                "Political party": "Republican",
                "Spouse": "Amy Kate Adams, ,,(,m., 1994),",
                "Children": "3",
                "Education": "Appalachian State University, (,BS,),Dallas Theological Seminary, (,AM,),Wake Forest University, (,MBA,)",
                "Website": "Senate website"
            }
        }
    },
    "UnusedVotingRecords": [
        {
            "Bill Number": "S.J.Res. 13 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Nay",
            "Bill Number.1": "S.J.Res. 13 (117th)",
            "Bill Name": "A joint resolution providing for congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the Equal Employment Opportunity Commission relating to \\u201cUpdate of Commission\\u2019s Conciliation Procedur",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 2724 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 2724 (117th)",
            "Bill Name": "VA Peer Support Enhancement for MST Survivors Act",
            "Summary": "This bill requires the Department of Veterans Affairs to ensure that each individual who files a claim relating to military sexual trauma is assigned a peer support specialist during the claims process, unless the individual elects to not have such support.Under the bill, a peer support specialist must be trained as a victim advocate and may not be responsible for any part of adjudicating the individual's claim.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 2992 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 2992 (117th)",
            "Bill Name": "Traumatic Brain Injury and Post-Traumatic Stress Disorder Law Enforcement Training Act",
            "Summary": "This bill requires the Bureau of Justice Assistance (BJA) to consult with relevant agencies to establish crisis intervention training tools for first responders to address individuals with traumatic brain injuries, acquired brain injuries, and post-traumatic stress disorder. The BJA must ensure that at least one police department designated as a Law Enforcement Mental Health Learning Site utilizes the tools and that such tools are part of the Police-Mental Health Collaboration Toolkit.Additionally, the bill requires the Centers for Disease Control and Prevention to study and report about the prevalence and incidence of concussions among first responders.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "S. 475 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Yea",
            "Bill Number.1": "S. 475",
            "Bill Name": "A bill to designate the clinic of the Department of Veterans Affairs in Gallup, New Mexico, as the Hiroshi \\u201cHershey\\u201d Miyamura VA Clinic.",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 7335 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Not Voting",
            "Bill Number.1": "H.R. 7335 (117th)",
            "Bill Name": "MST Claims Coordination Act",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3325 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3325 (117th)",
            "Bill Name": "To award four congressional gold medals to the United States Capitol Police and those who protected the U.S. Capitol on January 6, 2021.",
            "Summary": "This bill provides for the award of Congressional Gold Medals to the U.S. Capitol Police and the Metropolitan Police Department of the District of Columbia in recognition of the law enforcement agencies that protected the U.S. Capitol on January 6, 2021.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 6604 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Not Voting",
            "Bill Number.1": "H.R. 6604 (117th)",
            "Bill Name": "Veterans Eligible to Transfer School (VETS) Credit Act",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "S. 2514 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Not Voting",
            "Bill Number.1": "S. 2514 (117th)",
            "Bill Name": "A bill to rename the Provo Veterans Center in Orem, Utah, as the \\u201cCol. Gail S. Halvorsen \\u2018Candy Bomber\\u2019 Veterans Center\\u201d.",
            "Summary": "This bill designates the Provo Veterans Center of the Department of Veterans Affairs in Orem, Utah, as the Col. Gail S. Halvorsen \"Candy Bomber\" Veterans Center.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "S. 1760 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Not Voting",
            "Bill Number.1": "S. 1760 (117th)",
            "Bill Name": "A bill to designate the community-based outpatient clinic of the Department of Veterans Affairs planned to be built in Oahu, Hawaii, as the \\u201cDaniel Kahikina Akaka Department of Veterans Affairs Community-Based Outpatient Clinic\\u201d.",
            "Summary": "This bill designates the community-based outpatient clinic of the Department of Veterans Affairs that will be built in Oahu, Hawaii, as the Daniel Kahikina Akaka Department of Veterans Affairs Community-Based Outpatient Clinic or the Daniel Kahikina Akaka VA Clinic.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 6868 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Not Voting",
            "Bill Number.1": "H.R. 6868 (117th)",
            "Bill Name": "Cybersecurity Grants for Schools Act of 2022",
            "Summary": "This bill allows the Cybersecurity and Infrastructure Security Agency (CISA) to award grants or other financial assistance for cybersecurity and infrastructure security education and training programs at the elementary and secondary education levels. Entities eligible for the assistance include states, localities, institutions of higher education, and nonprofits. Additionally, CISA must include information about how the grants and assistance enhance cybersecurity education for underserved populations or communities in annual briefings.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3237 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Nay",
            "Bill Number.1": "H.R. 3237 (117th)",
            "Bill Name": "Emergency Security Supplemental Appropriations Act, 2021",
            "Summary": "This bill provides FY2021 supplemental appropriations for federal agencies to respond to the events at the U.S. Capitol Complex on January 6, 2021, and assist Afghan refugees.It also provides supplemental appropriations for the legislative branch to address COVID-19 and modifies requirements for certain programs that provide special immigrant status to eligible nationals of Afghanistan or Iraq,TITLE I--DEPARTMENT OF DEFENSEThis title provides appropriations for the National Guard to respond to the events at the U.S. Capitol Complex on January 6, 2021, and for related purposes.The title also provides appropriations to the Department of Defense for overseas humanitarian, disaster, and civic aid.TITLE II--DEPARTMENT OF HEALTH AND HUMAN SERVICESThis title provides appropriations to the Administration for Children and Families for refugee and entrance assistance activities.The funding must be used for activities for Afghan individuals within the United States who have been granted special immigrant status.TITLE III--LEGISLATIVE BRANCHThis title provides appropriations for the legislative branch to respond to the events at the U.S. Capitol Complex on January 6, 2021, and address COVID-19.Specifically, the title provides appropriations for the Senate, the House of Representatives, the U.S. Capitol Police, U.S. Capitol Police Mutual Aid Reimbursements, and the Architect of the Capitol (AOC). The title also provides appropriations for payments to the widows and heirs of deceased Members of Congress, including (1) Susan M. Wright, widow of the late Representative Ronald Wright; and (2) the heirs of the late Representative Alcee Hastings.(Sec. 301) This section designates the wellness program of the U.S. Capitol Police as the Howard C. Liebengood Center for Wellness.(Sec. 302) This section modifies the salary cap for the U.S. Capitol Police during 2021. (Sec. 310) This section prohibits funds from being used to install permanent, above-ground fencing around the perimeter, or any portion thereof, of the U.S. Capitol Grounds.(Sec. 311) With congressional approval, the AOC may accept contributions of, and incur obligations and make expenditures out of available appropriations for, supplies, products, and services necessary to respond to an emergency involving the safety of human life or the protection of property, as determined or declared by the Capitol Police Board.TITLE IV--BILATERAL ECONOMIC ASSISTANCEThis title provides appropriations to the Department of State for migration and refugee assistance to address humanitarian needs in Afghanistan and to assist Afghan refugees. The title also provides appropriations to the State Department for the United States Emergency Refugee and Migration Assistance Fund.(Sec. 401) This section increases the number of special immigrant visas available to qualified Afghan nationals who worked for the U.S. government or a North Atlantic Treaty Organization (NATO) mission in Afghanistan, extends the deadline for applying for such visas, and relaxes certain qualifications.All applicants for such a visa must establish that the applicant was employed with the U.S. government or a NATO mission for one year, where currently some applicants must prove two years of employment. This section also eliminates a requirement that the applicant faces an ongoing serious threat in Afghanistan due to such employment.Furthermore, for an applicant qualifying for a visa by performing duties for U.S. military personnel stationed with a NATO mission, this section eliminates a requirement that the duties performed qualify as sensitive and trusted duties.This section also relaxes limits to appealing rejections for applications for such visas.(Sec. 402) This bill authorizes the State Department and the Department of Homeland Security (DHS) to jointly postpone the medical exam requirement for individuals seeking entry into the United States under the program described in Section 401.If an individual receives such a postponement, DHS shall ensure to the greatest extent possible that individual undergoes a medical exam no later than 30 days after admission into the United States. Such an individual's status as a lawful permanent resident shall be conditional until the individual undergoes the required medical exam.(Sec. 403) This section modifies the immigration benefits of the surviving family members of certain deceased individuals.The surviving spouse or child of a U.S. government employee abroad shall qualify as a special immigrant if that employee performed at least 15 years of faithful service or was killed in the line of duty.This section also expands surviving family member benefits for certain programs that provide special immigrant status to eligible nationals of Afghanistan or Iraq, including the program described in Section 401. Specifically, if an individual submitted an application to the Chief of Mission that included an accompanying spouse or child and that application would have been approved but for the individual's death, the surviving spouse or child shall remain eligible to receive a visa under the respective program. Currently, such survivor rights only apply if the deceased individual's petition was approved.(Sec. 404) If an individual has an approved petition under a program that provided special immigrant status to translators who worked for the Armed Forces in Afghanistan or Iraq but a visa is not immediately available, the State Department or DHS may convert that petition to an approved petition under another program which provides special immigrant status to certain Iraqi nationals, if there are visas available under that second program. (DHS and the State Department currently only have the authority to convert petitions filed before October 1, 2008.)TITLE V--DEPARTMENT OF JUSTICEThis title provides appropriations to the Department of Justice (DOJ) for state and local law enforcement assistance.DOJ must use the funds for restoring funds that were used for extraordinary law enforcement and related costs directly associated with protection of the President-elect from November 4, 2020, until the inauguration of the President-elect as President.TITLE VI--GENERAL PROVISIONS--THIS ACT(Sec. 601) This section specifies that the funds provided by this bill are in addition to funds otherwise appropriated for the fiscal year involved.(Sec. 602) Funds provided by this bill may not remain available beyond the current fiscal year, unless this bill provides otherwise.(Sec. 603) Unless otherwise specified by this bill, the funds provided by this bill are subject to the authorities and conditions that apply to the applicable appropriations account for FY2021.(Sec. 604) This section specifies that funding provided by this bill may only be used for the purposes specifically described in the bill. The section includes an exception for funds used to restore amounts for obligations incurred prior to the date of the enactment of this bill.(Sec. 605) This section specifies that the term coronavirus in this bill means SARS-CoV-2 or another coronavirus with pandemic potential.(Sec. 606) This section provides that amounts designated by this bill as emergency requirements are only available (or rescinded or transferred, if applicable) if the President subsequently designates the amounts and transmits the designations to Congress.(Sec. 607) This section specifies that the emergency funds that are transferred pursuant to this bill retain the emergency designation.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3508 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Not Voting",
            "Bill Number.1": "H.R. 3508 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 39 West Main Street, in Honeoye Falls, New York, as the \\u201cCW4 Christian J. Koch Memorial Post Office\\u201d.",
            "Summary": "This bill designates the facility of the United States Postal Service located at 39 West Main Street, in Honeoye Falls, New York, as the CW4 Christian J. Koch Memorial Post Office.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "S. 937 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Nay",
            "Bill Number.1": "S. 937 (117th)",
            "Bill Name": "COVID-19 Hate Crimes Act",
            "Summary": "This bill requires a designated officer or employee of the Department of Justice (DOJ) to facilitate the expedited review of hate crimes and reports of hate crimes.DOJ must issue guidance for state, local, and tribal law enforcement agencies on establishing online hate crime reporting processes, collecting data disaggregated by protected characteristic (e.g., race or national origin), and expanding education campaigns.Additionally, DOJ and the Department of Health and Human Services must issue guidance aimed at raising awareness of hate crimes during the COVID-19 (i.e., coronavirus disease 2019) pandemic.The bill establishes grants for states to create state-run hate crimes reporting hotlines. It also authorizes grants for states and local governments to implement the National Incident-Based Reporting System and to conduct law enforcement activities or crime reduction programs to prevent, address, or respond to hate crimes.Finally, in the case of an individual convicted of a hate crime offense and placed on supervised release, the bill allows a court to order that the individual participate in educational classes or community service as a condition of supervised release.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 2911 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 2911 (117th)",
            "Bill Name": "VA Transparency & Trust Act of 2021",
            "Summary": "This bill requires the Department of Veterans Affairs (VA) to submit a plan for obligating and expending covered funds, which are funds made available to the VA for response to the COVID-19 pandemic.The bill requires the VA to submit biweekly reports regarding obligations, expenditures, and planned uses of the funds until seven days after the VA has expended all covered funds.The Inspector General of the VA must submit reports examining the obligations and expenditures made using covered funds during the specified reporting period.Finally, the Government Accountability Office must submit an interim report and final report containing a review of obligations and expenditures made using covered funds.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 92 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Not Voting",
            "Bill Number.1": "H.R. 92 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 110 Johnson Street in Pickens, South Carolina, as the \\u201cSpecialist Four Charles Johnson Post Office\\u201d.",
            "Summary": "This bill designates the facility of the United States Postal Service located at 110 Johnson Street in Pickens, South Carolina, as the Specialist Four Charles Johnson Post Office.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 91 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Not Voting",
            "Bill Number.1": "H.R. 91 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 810 South Pendleton Street in Easley, South Carolina, as the \\u201cPrivate First Class Barrett Lyle Austin Post Office Building\\u201d.",
            "Summary": "This bill designates the facility of the United States Postal Service located at 810 South Pendleton Street in Easley, South Carolina, as the Private First Class Barrett Lyle Austin Post Office Building.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 6386 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Not Voting",
            "Bill Number.1": "H.R. 6386 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 450 West Schaumburg Road in Schaumburg, Illinois, as the \\u201cVeterans of Iraq and Afghanistan Memorial Post Office Building\\u201d.",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 700 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Not Voting",
            "Bill Number.1": "H.R. 700 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 303 East Mississippi Avenue in Elwood, Illinois, as the \\u201cLawrence M. \\u2018Larry\\u2019 Walsh Sr. Post Office\\u201d.",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 5900 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Not Voting",
            "Bill Number.1": "H.R. 5900 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 2016 East 1st Street in Los Angeles, California, as the \\u201cMarine Corps Reserve PVT Jacob Cruz Post Office\\u201d.",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 224 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Not Voting",
            "Bill Number.1": "H.R. 224 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 5302 Galveston Road in Houston, Texas, as the Vanessa Guill\\u00e9n Post Office Building.",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "S. 1872 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Not Voting",
            "Bill Number.1": "S. 1872 (117th)",
            "Bill Name": "United States Army Rangers Veterans of World War II Congressional Gold Medal Act",
            "Summary": "This bill provides for the award of a single Congressional Gold Medal to the U.S. Army Rangers Veterans of World War II in recognition of their dedicated service during World War II.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1437 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Not Voting",
            "Bill Number.1": "H.R. 1437 (117th)",
            "Bill Name": "Further Continuing Appropriations and Extensions Act, 2023",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 7077 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Not Voting",
            "Bill Number.1": "H.R. 7077 (117th)",
            "Bill Name": "Empowering the U.S. Fire Administration Act",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 935 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Not Voting",
            "Bill Number.1": "H.R. 935 (117th)",
            "Bill Name": "Small Business Mergers, Acquisitions, Sales, and Brokerage Simplification Act of 2021",
            "Summary": "This bill exempts from securities registration requirements certain merger-and-acquisition brokers that facilitate transfer of ownership in privately held companies with earnings or revenues under a specified threshold. However, this exemption shall not apply to certain brokers, including those that provide financing related to the transfer of ownership, engage on behalf of any party in a transaction involving specified shell companies, or have been barred or suspended from association with a broker or dealer.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "S. 66 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Not Voting",
            "Bill Number.1": "S. 66",
            "Bill Name": "NOTAM Improvement Act of 2023",
            "Summary": "This bill directs the Federal Aviation Administration (FAA) to establish the FAA Task Force on NOTAM (notice to air missions required by international or domestic law) Improvement. A NOTAM is a notice containing information essential to personnel concerned with flight operations but not known far enough in advance to be publicized by other means. It states the abnormal status of a component of the National Airspace System.Specifically, the task force must (1) review existing methods for presenting NOTAMs and flight operations information for pilots; (2) review regulations and policies relating to NOTAMs, including their content and presentation to pilots; (3) evaluate and determine best practices to organize, prioritize, and present flight operations information in a manner that optimizes pilot review and retention of relevant information; (4) provide recommendations to improve the presentation of NOTAM information; and (5) report to Congress on its reviews and evaluations.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1899 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1899 (117th)",
            "Bill Name": "Ensuring Compliance Against Drug Diversion Act of 2021",
            "Summary": "This bill provides statutory authority for certain regulations governing the modification, transfer, and termination of a registration to manufacture, distribute, or dispense controlled substances. It terminates the registration of individuals and entities when they die, cease legal existence, discontinue business, or surrender such registration. It sets forth notification requirements, as well as conditions for transferring or assigning a registration.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1762 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1762 (117th)",
            "Bill Name": "Protecting Indian Tribes from Scams Act",
            "Summary": "This bill requires the Federal Trade Commission (FTC), after consultation with Indian tribes, to report on unfair or deceptive practices that target tribes or tribal members. The FTC must submit the report to Congress and make it publicly available. Further, the FTC must update its website to include information for consumers and businesses on identifying and avoiding unfair or deceptive practices that target tribes or tribal members.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1002 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1002 (117th)",
            "Bill Name": "DEBAR Act of 2021",
            "Summary": "This bill authorizes the Drug Enforcement Administration (DEA) to bar an entity from registering to manufacture, distribute, or dispense controlled substances under certain circumstances.Specifically, the DEA may bar—temporarily or permanently—the registration of an entity that (1) meets or has met any condition for suspension or revocation of the registration, and (2) has a history of prior suspensions or revocations.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 941 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 941 (117th)",
            "Bill Name": "TRANSPLANT Act of 2021",
            "Summary": "This bill modifies and reauthorizes through FY2026 the C.W. Bill Young Cell Transplantation Program, which provides support to patients who need a potentially life-saving bone marrow transplant or umbilical cord blood transplant.The bill also requires the Department of Health and Human Services to conduct a periodic review of the science of using adult stem cells and birthing tissues in therapeutic treatments.In addition, the Government Accountability Office must report on the regenerative medicine workforce.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1460 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1460 (117th)",
            "Bill Name": "Nicholas and Zachary Burt Memorial Carbon Monoxide Poisoning Prevention Act of 2021",
            "Summary": "This bill directs the Consumer Product Safety Commission to award grants to states and tribal organizations to install carbon monoxide alarms in the homes of low-income families and older adults and facilities that commonly serve children or older adults. Such carbon monoxide alarms must comply with specified standards.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1215 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1215 (117th)",
            "Bill Name": "Fraud and Scam Reduction Act",
            "Summary": "This bill expands activities to address mail, telephone, and internet fraud, particularly such scams targeting older adults.The bill establishes a Senior Scams Prevention Advisory Group, which must create model educational materials to educate employees of retailers, financial-services companies, and wire-transfer companies on how to identify and prevent scams that affect older adults.Further, the Federal Trade Commission (FTC) must establish an advisory office in the Bureau of Consumer Protection to assist the FTC in monitoring scams targeting older adults, educating consumers, and receiving complaints.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "S. 164 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Yea",
            "Bill Number.1": "S. 164 (117th)",
            "Bill Name": "Advancing Education on Biosimilars Act of 2021",
            "Summary": "This bill requires the Food and Drug Administration (FDA) to advance education and awareness among health care providers about biological products as appropriate, including by developing or improving continuing education programs that address the prescribing of biological products and biosimilars. (A biosimilar is a biological product that is highly similar to an FDA-approved reference biological product and has no clinically meaningful differences from that reference product.) The FDA may also maintain and operate a website to provide educational materials about biological products.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "S. 578 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Yea",
            "Bill Number.1": "S. 578 (117th)",
            "Bill Name": "FASTER Act of 2021",
            "Summary": "This bill expands the definition of major food allergen for purposes of certain food-labeling requirements to specifically include sesame. In addition, the Department of Health and Human Services must report on certain information related to food allergy research and data collection activities.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 172 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 172 (117th)",
            "Bill Name": "United States Anti-Doping Agency Reauthorization Act of 2021",
            "Summary": "This bill authorizes appropriations for the U.S. Anti-Doping Agency (USADA) through FY2030.The bill adds requirements that USADA be responsible for certifying in advance any testing conducted by international organizations under the World Anti-Doping Code for international amateur athletes and athletic competitions occurring within the jurisdiction of the United States; and promote a positive youth sport experience by using a portion of its funding to provide educational materials on sportsmanship, character building, and healthy performance for those participating in youth sports. The bill requires any action taken by USADA to enforce a policy, procedure, or requirement against a person with respect to a violation of federal law, including an investigation, disciplinary action, sanction, or any other administrative action, to be carried out in a manner that provides due process protection.The Department of Justice, the Department of Homeland Security, and the Food and Drug Administration must provide to USADA information relating to the prevention of the use of performance-enhancing drugs or the prohibition of performance-enhancing methods.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1868 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Nay",
            "Bill Number.1": "H.R. 1868 (117th)",
            "Bill Name": "To prevent across-the-board direct spending cuts, and for other purposes.",
            "Summary": "This bill makes several budgetary and technical changes to provisions under Medicare and Medicaid. The bill continues to exempt Medicare from sequestration until December 31, 2021. (Sequestration is a process of automatic, usually across-the-board spending reductions under which budgetary resources are permanently cancelled to enforce specific budget policy goals.)The bill also specifically applies certain modified payment limits to rural health clinics that temporarily enrolled in Medicare during the public health emergency relating to COVID-19 (i.e., coronavirus disease 2019) or that applied to enroll by December 31, 2020; and preserves higher Medicaid disproportionate-share hospital payments for public hospitals in California under forthcoming payment methodology changes.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "S. 812 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Not Voting",
            "Bill Number.1": "S. 812 (117th)",
            "Bill Name": "A bill to direct the Secretary of State to develop a strategy to regain observer status for Taiwan in the World Health Organization, and for other purposes.",
            "Summary": "This bill directs the Department of State to include additional information in its annual reports concerning Taiwan's participation at the World Health Organization's World Health Assembly (WHA) as an observer. The report shall describe changes and improvements to the State Department's plan to support Taiwan's observer status at the WHA, following any meetings at which Taiwan did not participate under such status. (China has opposed Taiwan's participation in the WHA.)",
            "Status": "Enacted"
        },
        {
            "Bill Number": "S.Amdt. 125 (Sullivan) to H.R. 3746",
            "First Name": "Ted Budd",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3746",
            "Bill Name": "Fiscal Responsibility Act of 2023",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "S.Amdt. 106 (Cotton) to H.R. 3746",
            "First Name": "Ted Budd",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3746",
            "Bill Name": "Fiscal Responsibility Act of 2023",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "S.Amdt. 134 (Budd) to H.R. 3746",
            "First Name": "Ted Budd",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3746",
            "Bill Name": "Fiscal Responsibility Act of 2023",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "S.Amdt. 101 (Kaine) to H.R. 3746",
            "First Name": "Ted Budd",
            "Vote": "Nay",
            "Bill Number.1": "H.R. 3746",
            "Bill Name": "Fiscal Responsibility Act of 2023",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "S.Amdt. 98 (Lee) to H.R. 3746",
            "First Name": "Ted Budd",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3746",
            "Bill Name": "Fiscal Responsibility Act of 2023",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "S.Amdt. 93 (Hawley) to H.R. 3746",
            "First Name": "Ted Budd",
            "Vote": "Nay",
            "Bill Number.1": "H.R. 3746",
            "Bill Name": "Fiscal Responsibility Act of 2023",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3746",
            "First Name": "Ted Budd",
            "Vote": "Nay",
            "Bill Number.1": "H.R. 3746",
            "Bill Name": "Fiscal Responsibility Act of 2023",
            "Summary": NaN,
            "Status": "Enacted",
            "Democrat_Yea": 0.9166666666666666,
            "Democrat_Nay": 0.0833333333333333,
            "Republican_Yea": 0.3469387755102041,
            "Republican_Nay": 0.6326530612244898
        },
        {
            "Bill Number": "S.Amdt. 104 (Kennedy) to H.R. 3746",
            "First Name": "Ted Budd",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3746",
            "Bill Name": "Fiscal Responsibility Act of 2023",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1868 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Nay",
            "Bill Number.1": "H.R. 1868 (117th)",
            "Bill Name": "To prevent across-the-board direct spending cuts, and for other purposes.",
            "Summary": "This bill makes several budgetary and technical changes to provisions under Medicare and Medicaid. The bill continues to exempt Medicare from sequestration until December 31, 2021. (Sequestration is a process of automatic, usually across-the-board spending reductions under which budgetary resources are permanently cancelled to enforce specific budget policy goals.)The bill also specifically applies certain modified payment limits to rural health clinics that temporarily enrolled in Medicare during the public health emergency relating to COVID-19 (i.e., coronavirus disease 2019) or that applied to enroll by December 31, 2020; and preserves higher Medicaid disproportionate-share hospital payments for public hospitals in California under forthcoming payment methodology changes.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "S. 497 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Not Voting",
            "Bill Number.1": "S. 497 (117th)",
            "Bill Name": "American Fisheries Advisory Committee Act",
            "Summary": "This bill directs the National Oceanic and Atmospheric Administration (NOAA)to establish the American Fisheries Advisory Committee. The committee must provide advice to NOAA on an existing program that awards grants for fisheries research and development projects, such as projects concerning fisheries science or recreational fishing. Specifically, the committee must (1)identify the needs of the fishing community, (2) develop the request for proposals for the grant program, (3)review grant applications, and (4)provide NOAA with grant applications for approval.NOAA must establish six regions within the committee.In addition, NOAA must select members that represent the regions as well as at-large members that represent certain sectors of the fishing industry.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "S.Amdt. 110 (Marshall) to H.R. 3746",
            "First Name": "Ted Budd",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3746",
            "Bill Name": "Fiscal Responsibility Act of 2023",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "S.Amdt. 91 (Braun) to H.R. 3746",
            "First Name": "Ted Budd",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3746",
            "Bill Name": "Fiscal Responsibility Act of 2023",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "S.Amdt. 107 (Paul) to H.R. 3746",
            "First Name": "Ted Budd",
            "Vote": "Nay",
            "Bill Number.1": "H.R. 3746",
            "Bill Name": "Fiscal Responsibility Act of 2023",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 7276 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 7276 (117th)",
            "Bill Name": "Ukraine Invasion War Crimes Deterrence and Accountability Act",
            "Summary": "This bill requires the President to report to Congress on atrocities committed during Russia's invasion of Ukraine since February 24, 2022.Specifically, the report must describe in detail (1) U.S. government efforts to collect, analyze, and preserve evidence related to war crimes and other atrocities committed during the invasion; (2) media, public diplomacy, and information operations to make the Russian people, including their military and political leaders, aware of efforts to identify and prosecute those responsible for such atrocities; and (3) the process for a domestic, foreign, or international court or tribunal to obtain information from the U.S. government related to such atrocities.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1652 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Nay",
            "Bill Number.1": "H.R. 1652 (117th)",
            "Bill Name": "VOCA Fix to Sustain the Crime Victims Fund Act of 2021",
            "Summary": "This bill adds a new source of revenue for the Crime Victims Fund and makes changes to formula grants supported by the fund.Specifically, the bill directs revenues collected from deferred prosecution and non-prosecution agreements to be deposited into the Crime Victims Fund. Currently, such revenues are deposited into the general fund of the Treasury.Additionally, the bill increases the percentage—from 60% to 75%—of state compensation payments to crime victims in the prior fiscal year used to calculate formula grants for state victim compensation programs.Finally, the bill directs states to waive the matching requirement for recipients of state victim assistance formula grants during and for one year after a pandemic-related national emergency. It also allows states to waive the matching requirement pursuant to a policy established by the state.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1085 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1085 (117th)",
            "Bill Name": "To award three congressional gold medals to the United States Capitol Police and those who protected the U.S. Capitol on January 6, 2021.",
            "Summary": "This bill directs the Speaker of the House and the President pro tempore of the Senate to arrange for the award of three Congressional Gold Medals to the U.S. Capitol Police (USCP) and other law enforcement agencies that protected the U.S. Capitol on January 6, 2021.Following the award of these medals, one medal shall be given to the USCP, one medal shall be given to the Metropolitan Police Department of the District of Columbia, and one medal shall be given to the Smithsonian Institution and displayed with a plaque listing all law enforcement agencies that participated in protecting the Capitol on January 6, 2021.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1651 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Nay",
            "Bill Number.1": "H.R. 1651 (117th)",
            "Bill Name": "COVID-19 Bankruptcy Relief Extension Act of 2021",
            "Summary": "This bill extends existing provisions that provide relief to debtors in bankruptcy, including those related to the COVID-19 (i.e., coronavirus disease 2019) pandemic.These provisions (1) exclude certain COVID-19 aid payments from income for the purposes of bankruptcy, and (2) increase the debt eligibility threshold for businesses qualifying for certain types of Chapter 11 reorganization bankruptcy. Currently, these provisions expire March 27, 2021. The bill extends these provisions for one year.The bill also allows for modification of a Chapter 13 repayment plan for plans confirmed before the date of enactment of this bill if the debtor is experiencing material financial hardship due to COVID-19. Currently, such a modification is only available for plans confirmed before March 27, 2020.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1799 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1799 (117th)",
            "Bill Name": "PPP Extension Act of 2021",
            "Summary": "This bill extends the Paycheck Protection Program, established to support small businesses in response to COVID-19 (i.e., coronavirus disease 2019), through June 30, 2021. Currently, the program is set to expire on March 31, 2021.For the final 30 days of the program (i.e., from June 1 until June 30), the Small Business Administration may only process applications submitted prior to June 1, and it may not accept any new loan applications.The bill excludes the budgetary effects of this bill from PAYGO scorecards under the Statutory Pay-As-You-Go Act of 2010 and from Senate PAYGO scorecards.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1218 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1218 (117th)",
            "Bill Name": "Data Mapping to Save Moms\\u2019 Lives Act",
            "Summary": "This bill directs the Federal Communications Commission (FCC) to include data on certain maternal health outcomes in its broadband health mapping tool. This is an online platform that allows users to visualize, overlay, and analyze broadband and health data at national, state, and county levels.The FCC must consult with the Centers for Disease Control and Prevention to determine which maternal health outcomes should be incorporated.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1319 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Nay",
            "Bill Number.1": "H.R. 1319 (117th)",
            "Bill Name": "American Rescue Plan Act of 2021",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 6833 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Nay",
            "Bill Number.1": "H.R. 6833 (117th)",
            "Bill Name": "Continuing Appropriations and Ukraine Supplemental Appropriations Act, 2023",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "S. 2126 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Yea",
            "Bill Number.1": "S. 2126 (117th)",
            "Bill Name": "A bill to designate the Federal Office Building located at 308 W. 21st Street in Cheyenne, Wyoming, as the \\u201cLouisa Swain Federal Office Building\\u201d, and for other purposes.",
            "Summary": "This bill designates the federal building located at 308 West 21st Street in Cheyenne, Wyoming, as the Louisa Swain Federal Office Building.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "S. 1226 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Nay",
            "Bill Number.1": "S. 1226 (117th)",
            "Bill Name": "A bill to designate the United States courthouse located at 1501 North 6th Street in Harrisburg, Pennsylvania, as the \\u201cSylvia H. Rambo United States Courthouse\\u201d, and for other purposes.",
            "Summary": "This bill designates the U.S. courthouse at 1501 North 6th Street in Harrisburg, Pennsylvania, as the Sylvia H. Rambo United States Courthouse.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "S. 400 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Yea",
            "Bill Number.1": "S. 400 (117th)",
            "Bill Name": "William T. Coleman, Jr. and Norman Y. Mineta Department of Transportation Headquarters Act",
            "Summary": "This bill designates the headquarters building of the Department of Transportation located at 1200 New Jersey Avenue, SE, in Washington, DC, as the William T. Coleman, Jr. and Norman Y. Mineta Federal Building.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 2954 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 2954 (117th)",
            "Bill Name": "Securing a Strong Retirement Act of 2021",
            "Summary": "This bill makes various changes with respect to employer-sponsored retirement plans, including providing for the automatic enrollment of employees in certain plans and increasing the age at which participants are required to begin receiving mandatory distributions.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3359 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3359 (117th)",
            "Bill Name": "Homicide Victims\\u2019 Families\\u2019 Rights Act of 2021",
            "Summary": "This bill establishes a framework for immediate family members of a victim of murder under federal law to request a review of the victim's case file if the murder was committed more than three years prior, the murder was investigated by a federal law enforcement entity, all probative investigative leads have been exhausted, and no likely perpetrator has been identified.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3197 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3197 (117th)",
            "Bill Name": "Save the Liberty Theatre Act of 2021",
            "Summary": NaN,
            "Status": NaN
        },
        {
            "Bill Number": "H.R. 3113 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Not Voting",
            "Bill Number.1": "H.R. 3113 (117th)",
            "Bill Name": "Modernizing Access to Our Public Land Act",
            "Summary": "This bill directs the Department of the Interior, the Forest Service, and the U.S. Army Corps of Engineers to jointly develop and adopt interagency standards to ensure compatibility and interoperability among federal databases for the collection and dissemination of outdoor recreation data related to federal lands and used to depict locations at which recreation uses are available to the public.Interior, the Forest Service, and the Corps of Engineers must digitize and publish geographic information system data that includes federal interests, including easements and rights-of-way, in private land; status information as to whether roads and trails are open or closed; the dates on which roads and trails are seasonally opened and closed; the types of vehicles and recreational uses that are allowed on each segment of roads and trails; and the boundaries of areas where hunting or recreational shooting is permanently restricted or closed. Interior, the Forest Service, and the Corps of Engineers may work with the U.S. Geological Survey to collect, digitize, standardize, or publish data to meet the requirements of this bill.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1319 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Nay",
            "Bill Number.1": "H.R. 1319 (117th)",
            "Bill Name": "American Rescue Plan Act of 2021",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1192 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1192 (117th)",
            "Bill Name": "PRRADA",
            "Summary": "This bill requires professionals employed in debt adjustment cases involving Puerto Rico to file verified statements disclosing their connections with interested parties before seeking compensation for their services.The Financial Oversight and Management Board for Puerto Rico must establish a list of such interested parties, which shall include the debtor, creditors, any attorney or accountant of the debtor or creditors, persons employed by the U.S. Trustee Program, persons employed by the board, and any other interested party.Compensation may be denied to such a professional if these disclosures are not filed, are inadequate, or if the professional is found to have certain conflicts of interest.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 2471 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Nay",
            "Bill Number.1": "H.R. 2471 (117th)",
            "Bill Name": "Consolidated Appropriations Act, 2022",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 2471 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 2471 (117th)",
            "Bill Name": "Consolidated Appropriations Act, 2022",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 208 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 208 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 500 West Main Street, Suite 102 in Tupelo, Mississippi, as the Colonel Carlyle Smitty Harris Post Office.",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "S. 658 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Yea",
            "Bill Number.1": "S. 658 (117th)",
            "Bill Name": "National Cybersecurity Preparedness Consortium Act of 2021",
            "Summary": "This bill allows the Department of Homeland Security to work with one or more consortia composed of nonprofit entities to develop, update, and deliver cybersecurity training in support of homeland security.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 55 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 55 (117th)",
            "Bill Name": "Emmett Till Antilynching Act",
            "Summary": "This bill makes lynching a federal hate crime offense.Specifically, the bill imposes criminal penalties—a fine, a prison term of up to 30 years, or both—on an individual who conspires to commit a hate crime offense that results in death or serious bodily injury or that includes kidnapping or an attempt to kidnap, aggravated sexual abuse or an attempt to commit aggravated sexual abuse, or an attempt to kill.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "S. 321 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Yea",
            "Bill Number.1": "S. 321 (117th)",
            "Bill Name": "\\u201cSix Triple Eight\\u201d Congressional Gold Medal Act of 2021",
            "Summary": "This bill provides for the award of a Congressional Gold Medal to the women of the 6888th Central Postal Directory Battalion (commonly known as the Six Triple Eight) in recognition of their pioneering military service, devotion to duty, and contributions to increase the morale of personnel stationed in the European theater of operations during World War II.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3539 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3539 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 223 West Chalan Santo Papa in Hagatna, Guam, as the \\u201cAtanasio Taitano Perez Post Office\\u201d.",
            "Summary": "This bill designates the facility of the United States Postal Service located at 223 West Chalan Santo Papa in Hagatna, Guam, as the Atanasio Taitano Perez Post Office.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 735 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 735 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 502 East Cotati Avenue in Cotati, California, as the \\u201cArturo L. Ibleto Post Office Building\\u201d.",
            "Summary": "This bill designates the facility of the United States Postal Service located at 502 East Cotati Avenue in Cotati, California, as the Arturo L. Ibleto Post Office Building.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3076 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3076 (117th)",
            "Bill Name": "Postal Service Reform Act of 2022",
            "Summary": "This bill addresses the finances and operations of the U.S. Postal Service (USPS).The bill requires the Office of Personnel Management (OPM) to establish the Postal Service Health Benefits Program within the Federal Employees Health Benefits Program under which OPM may contract with carriers to offer health benefits plans for USPS employees and retirees.The bill provides for coordinated enrollment of retirees under this program and Medicare.The bill repeals the requirement that the USPS annually prepay future retirement health benefits.Additionally, the USPS may establish a program to enter into agreements with an agency of any state government, local government, or tribal government, and with other government agencies, to provide certain nonpostal products and services that reasonably contribute to the costs of the USPS and meet other specified criteria.The USPS must develop and maintain a publicly available dashboard to track service performance and must report regularly on its operations and financial condition.The Postal Regulatory Commission must annually submit to the USPS a budget of its expenses. It must also conduct a study to identify the causes and effects of postal inefficiencies relating to flats (e.g., large envelopes).The USPS Office of Inspector General shall perform oversight of the Postal Regulatory Commission.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "S. 566 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Yea",
            "Bill Number.1": "S. 566 (117th)",
            "Bill Name": "A bill to designate the facility of the United States Postal Service located at 42 Main Street in Slatersville, Rhode Island, as the \\u201cSpecialist Matthew R. Turcotte Post Office\\u201d.",
            "Summary": "This bill designates the facility of the United States Postal Service located at 42 Main Street in Slatersville, Rhode Island, as the Specialist Matthew R. Turcotte Post Office.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 2324 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 2324 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 2800 South Adams Street in Tallahassee, Florida, as the \\u201cD. Edwina Stephens Post Office\\u201d.",
            "Summary": "This bill designates the facility of the United States Postal Service located at 2800 South Adams Street in Tallahassee, Florida, as the D. Edwina Stephens Post Office.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "S. 583 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Yea",
            "Bill Number.1": "S. 583 (117th)",
            "Bill Name": "PRICE Act of 2021",
            "Summary": "This bill directs the Management Directorate of the Department of Homeland Security (DHS) to publish an annual report on a DHS website on projects that have used innovative procurement techniques within DHS to accomplish specified goals.Such goals are improving or encouraging better competition, reducing time to award, achieving cost savings, achieving better mission outcomes, or meeting the goals for contracts awarded to small business concerns. The Management Directorate shall (1) develop and disseminate guidance and offer training for specified personnel concerning when and how to use such techniques, and (2) share best practices across DHS and make available to other federal agencies information to improve procurement methods and training.The Office of Federal Procurement Policy shall convene a Chief Acquisition Officers Council to examine best practices for acquisition innovation in contracting in the federal government.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 335 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Nay",
            "Bill Number.1": "H.R. 335 (117th)",
            "Bill Name": "To provide for an exception to a limitation against appointment of persons as Secretary of Defense within seven years of relief from active duty as a regular commissioned officer of the Armed Forces.",
            "Summary": "This bill allows the first person nominated and appointed as Secretary of Defense after 12 p.m. (Eastern Standard Time) on January 20, 2021, to be a person who is, on the date of appointment, at least four years after relief from active duty as a commissioned officer of a regular component of the Armed Forces. Under current law, an individual may not be appointed as Secretary of Defense within seven years after relief from such active duty.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 22 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 22 (117th)",
            "Bill Name": "Congressional Budget Justification Transparency Act of 2021",
            "Summary": "This bill requires federal agencies to make budget justification materials available to the public on a website. The bill also requires the Office of Management and Budget to make certain details regarding the materials available to the public, including a list of the agencies that submit budget justification materials to Congress, the dates that the materials are submitted to Congress and posted online, and links to the materials.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 5577 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Not Voting",
            "Bill Number.1": "H.R. 5577 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 3900 Crown Road Southwest in Atlanta, Georgia, as the \\u201cJohn R. Lewis Post Office Building\\u201d.",
            "Summary": "This bill designates the facility of the United States Postal Service located at 3900 Crown Road Southwest in Atlanta, Georgia, as the John R. Lewis Post Office Building.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "S. 452 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Not Voting",
            "Bill Number.1": "S. 452",
            "Bill Name": "Nuclear Fuel Security Act of 2023",
            "Summary": "This bill establishes new programs and expands existing programs to increase domestic supplies of certain types of low-enriched uranium (LEU) for nuclear energy and establishes related requirements. Specifically, the Department of Energy (DOE) must establish a program to increase the production of certain types of LEU, including high-assay low-enriched uranium (HALEU) used by advanced reactors, by U.S. nuclear energy companies. DOE must also establish a demonstration program to make HALEU available from its inventories or stockpiles and allied countries to meet the needs and schedules of advanced nuclear reactor developers until such time that commercial enrichment and deconversion capability for the uranium exists in the United States at a scale sufficient to meet future needs.In addition, DOE must expand the existing American Assured Fuel Supply Program to ensure the availability of uranium, including HALEU, from domestic sources or allies in the event of a supply disruption. Under the expansion, DOE must merge its Uranium Reserve Program with the American Assured Fuel Supply Program. Under the expanded program, DOE must utilize only uranium produced, converted, enriched, deconverted, and reduced in the United States or an allied country. DOE must also maintain a limited reserve of uranium.The bill also expands DOE's Advanced Nuclear Technologies Federal Research, Development, and Demonstration Program established under the CHIPS and Science Act of 2022 to include financial assistance for the deployment of advanced nuclear reactors and associated supply chain infrastructure.It also revises and reauthorizes through FY2027 DOE's nuclear traineeship subprogram.Finally, the bill modifies the USEC Privatization Act to (1) limit the amount of LEU that may be imported into the United States through 2027, and (2) prohibit the importation of unirradiated LEU (i.e., uranium that has not been in a reactor) that is produced in Russia or by a Russian entity. It also prohibits importing LEU obtained in a manner designed to circumvent such prohibition. DOE may waive such prohibitions if it is in the national interest or there is no alternative viable source of LEU available to sustain the continued operation of a nuclear reactor or a U.S. nuclear energy company. Any waiver issued must terminate by January 1, 2028. The modifications to such act do not apply to imports for national security or nonproliferation purposes, or of non-uranium isotopes. The modifications no longer apply after December 31, 2040.",
            "Status": "Enacted"
        }
    ],
    "CosponsoredBills": [
        {
            "Bill Number": "S. 305",
            "First Name": "Ted  Budd",
            "Last Name": "cosponsor",
            "Role": "S. 305",
            "Bill Name": "250th Anniversary of the United States Marine Corps Commemorative Coin Act",
            "Subject Areas": "Military personnel and dependents",
            "Summary": "This bill directs the Department of the Treasury to mint and issue not more than 50,000 $5 gold coins, 400,000 $1 silver coins, and 750,000 half-dollar clad coins emblematic of the 250th anniversary of the United States Marine Corps.All surcharges received by Treasury from the sale of such coins must be paid to the Marine Corps Heritage Foundation and shall only be used for the purposes of supporting the mission of the Marine Corps Heritage Center."
        },
        {
            "Bill Number": "S. 452",
            "First Name": "Ted  Budd",
            "Last Name": "cosponsor",
            "Role": "S. 452",
            "Bill Name": "Nuclear Fuel Security Act of 2023",
            "Subject Areas": "Energy, Advanced technology and technological innovations, Electric power generation and transmission, Employment and training programs, Energy research, Energy storage, supplies, demand, Higher education, Infrastructure development, Licensing and registrations, Nuclear power, Research administration and funding",
            "Summary": "This bill establishes new programs and expands existing programs to increase domestic supplies of certain types of low-enriched uranium (LEU) for nuclear energy and establishes related requirements. Specifically, the Department of Energy (DOE) must establish a program to increase the production of certain types of LEU, including high-assay low-enriched uranium (HALEU) used by advanced reactors, by U.S. nuclear energy companies. DOE must also establish a demonstration program to make HALEU available from its inventories or stockpiles and allied countries to meet the needs and schedules of advanced nuclear reactor developers until such time that commercial enrichment and deconversion capability for the uranium exists in the United States at a scale sufficient to meet future needs.In addition, DOE must expand the existing American Assured Fuel Supply Program to ensure the availability of uranium, including HALEU, from domestic sources or allies in the event of a supply disruption. Under the expansion, DOE must merge its Uranium Reserve Program with the American Assured Fuel Supply Program. Under the expanded program, DOE must utilize only uranium produced, converted, enriched, deconverted, and reduced in the United States or an allied country. DOE must also maintain a limited reserve of uranium.The bill also expands DOE's Advanced Nuclear Technologies Federal Research, Development, and Demonstration Program established under the CHIPS and Science Act of 2022 to include financial assistance for the deployment of advanced nuclear reactors and associated supply chain infrastructure.It also revises and reauthorizes through FY2027 DOE's nuclear traineeship subprogram.Finally, the bill modifies the USEC Privatization Act to (1) limit the amount of LEU that may be imported into the United States through 2027, and (2) prohibit the importation of unirradiated LEU (i.e., uranium that has not been in a reactor) that is produced in Russia or by a Russian entity. It also prohibits importing LEU obtained in a manner designed to circumvent such prohibition. DOE may waive such prohibitions if it is in the national interest or there is no alternative viable source of LEU available to sustain the continued operation of a nuclear reactor or a U.S. nuclear energy company. Any waiver issued must terminate by January 1, 2028. The modifications to such act do not apply to imports for national security or nonproliferation purposes, or of non-uranium isotopes. The modifications no longer apply after December 31, 2040."
        },
        {
            "Bill Number": "S.J.Res. 12",
            "First Name": "Ted  Budd",
            "Last Name": "cosponsor",
            "Role": "S.J.Res. 12",
            "Bill Name": "A joint resolution disapproving the action of the District of Columbia Council in approving the Revised Criminal Code Act of 2022.",
            "Subject Areas": "Government Operations and Politics, Congressional oversight, Criminal procedure and sentencing, District of Columbia, Due process and equal protection, State and local government operations, Violent crime",
            "Summary": NaN
        },
        {
            "Bill Number": "H.R. 310 (117th)",
            "First Name": "Ted  Budd",
            "Last Name": "cosponsor",
            "Role": "H.R. 310 (117th)",
            "Bill Name": "To posthumously award the Congressional Gold Medal, collectively, to Glen Doherty, Tyrone Woods, J. Christopher Stevens, and Sean Smith, in recognition of their contributions to the Nation.",
            "Subject Areas": "Intelligence activities, surveillance, classified information, Law enforcement officers, Libya, Middle East, Terrorism, Veterans' organizations and recognition",
            "Summary": NaN
        },
        {
            "Bill Number": "H.R. 5481 (117th)",
            "First Name": "Ted  Budd",
            "Last Name": "cosponsor",
            "Role": "H.R. 5481 (117th)",
            "Bill Name": "To name the Department of Veterans Affairs community-based outpatient clinic in Forest City,   North Carolina, as the \\u201cMaster Sergeant Jerry K. Crump VA Clinic\\u201d.",
            "Subject Areas": NaN,
            "Summary": NaN
        },
        {
            "Bill Number": "H.R. 3630 (117th)",
            "First Name": "Ted  Budd",
            "Last Name": "cosponsor",
            "Role": "H.R. 3630 (117th)",
            "Bill Name": "Lymphedema Treatment Act",
            "Subject Areas": "Health, Labor and Employment, Cardiovascular and respiratory health, Health care coverage and access, Immunology and vaccination, Medicare",
            "Summary": "This bill provides for Medicare coverage of lymphedema compression treatment items. Specifically, the bill provides for coverage of standard and custom fitted gradient compression garments and other approved items that are prescribed by a physician or other specified health care professional to treat lymphedema."
        },
        {
            "Bill Number": "H.R. 8656 (117th)",
            "First Name": "Ted  Budd",
            "Last Name": "cosponsor",
            "Role": "H.R. 8656 (117th)",
            "Bill Name": "To designate the clinic of the Department of Veterans Affairs in Mishawaka, Indiana, as the \\u201cJackie Walorski VA Clinic\\u201d.",
            "Subject Areas": "Armed Forces and National Security, Congressional tributes, Department of Veterans Affairs, Government buildings, facilities, and property, Health facilities and institutions, Indiana, Veterans' medical care",
            "Summary": NaN
        },
        {
            "Bill Number": "H.R. 1057 (117th)",
            "First Name": "Ted  Budd",
            "Last Name": "cosponsor",
            "Role": "H.R. 1057 (117th)",
            "Bill Name": "Greatest Generation Commemorative Coin Act",
            "Subject Areas": "Finance and Financial Sector, Conflicts and wars, Currency, Military history, Monuments and memorials, U.S. history, Veterans' organizations and recognition",
            "Summary": "This bill directs the Department of the Treasury to mint and issue up to 50,000 $5 coins, 400,000 $1 silver coins, and 750,000 half-dollar clad coins in commemoration of the National World War II Memorial in the District of Columbia.The design of the coins shall be emblematic of the memorial and the service and sacrifice of American soldiers and civilians during World War II.All surcharges received from the sale of such coins shall be paid to the Friends of the National World War II Memorial to support the National Park Service in maintaining and repairing the memorial, and for educational and commemorative programs."
        },
        {
            "Bill Number": "H.R. 6891 (117th)",
            "First Name": "Ted  Budd",
            "Last Name": "cosponsor",
            "Role": "H.R. 6891 (117th)",
            "Bill Name": "Isolate Russian Government Officials Act of 2022",
            "Subject Areas": "International Affairs, Conflicts and wars, Diplomacy, foreign officials, Americans abroad, Europe, International monetary system and foreign exchange, International organizations and cooperation, Military operations and strategy, Multilateral development programs, Russia, Sovereignty, recognition, national governance and status, Ukraine",
            "Summary": "This bill requires the Department of the Treasury, the Securities and Exchange Commission, and the Board of Governors of the Federal Reserve System to take all necessary steps to exclude Russian government officials, to the maximum extent practicable, from certain international meetings, including the activities of the Group of 20, the Basel Committee for Banking Standards, and the Bank for International Settlements.This requirement shall be in effect until the earlier of five years after the bill's enactment or 30 days after the President reports to Congress that Russia's government has ceased activities to destabilize Ukraine's sovereignty and territorial integrity. The President may also waive this requirement upon reporting to Congress that doing so is in the national interest of the United States."
        },
        {
            "Bill Number": "H.R. 5142 (117th)",
            "First Name": "Ted  Budd",
            "Last Name": "cosponsor",
            "Role": "H.R. 5142 (117th)",
            "Bill Name": "To award posthumously a Congressional Gold Medal, in commemoration to the servicemembers who perished in Afghanistan on August 26, 2021, during the evacuation of citizens of the United States and Afghan allies at Hamid Karzai Internati",
            "Subject Areas": "Armed Forces and National Security, International Affairs, Afghanistan, Asia, Conflicts and wars, Congressional tributes, Emergency planning and evacuation, Military operations and strategy, Military personnel and dependents, Museums, exhibitions, cultural centers, Smithsonian Institution, Terrorism",
            "Summary": "This bill posthumously provides for the award of a Congressional Gold Medal in commemoration of the 13 service members who died on August 26, 2021, while stationed at Hamid Karzai International Airport in Afghanistan."
        },
        {
            "Bill Number": "H.R. 1448 (117th)",
            "First Name": "Ted  Budd",
            "Last Name": "cosponsor",
            "Role": "H.R. 1448 (117th)",
            "Bill Name": "PAWS for Veterans Therapy Act",
            "Subject Areas": "Armed Forces and National Security, Animal protection and human-animal relationships, Congressional oversight, Disability assistance, Government information and archives, Government studies and investigations, Health programs administration and funding, Mammals, Mental health, Neurological disorders, Service animals, Veterans' education, employment, rehabilitation, Veterans' medical care",
            "Summary": "This bill implements a program and a policy related to service dog therapy for veterans. Specifically, the bill requires the Department of Veterans Affairs (VA) to implement a five-year pilot program to provide canine training to eligible veterans diagnosed with post-traumatic stress disorder as an element of a complementary and integrative health program. Eligible veterans are those who are enrolled in the VA health care system and have been recommended for participation by a qualified mental health care provider or clinical team.The VA must seek to enter agreements containing specified elements with accredited nongovernmental entities that have demonstrated ability to provide canine training.Veterans who participate in the program are authorized to adopt the dog they assisted in training if their health provider determines it is in the best interest of the veteran.The VA must establish processes to document and track the progress of participating veterans with respect to health benefits and improvements. The Government Accountability Office must brief Congress and submit a report on the program.The bill also authorizes the VA to provide service dogs to veterans with mental illnesses, regardless of whether they have a mobility impairment."
        },
        {
            "Bill Number": "H.R. 3642 (117th)",
            "First Name": "Ted  Budd",
            "Last Name": "cosponsor",
            "Role": "H.R. 3642 (117th)",
            "Bill Name": "Harlem Hellfighters Congressional Gold Medal Act",
            "Subject Areas": "Armed Forces and National Security, Conflicts and wars, Congressional tributes, Military history, Military personnel and dependents, Museums, exhibitions, cultural centers, New York State, Racial and ethnic relations, Smithsonian Institution, Veterans' organizations and recognition",
            "Summary": "This bill provides for the award of a Congressional Gold Medal to the 369th Infantry Regiment, commonly known as the Harlem Hellfighters, in recognition of their bravery and outstanding service during World War I."
        },
        {
            "Bill Number": "H.R. 4493 (117th)",
            "First Name": "Ted  Budd",
            "Last Name": "cosponsor",
            "Role": "H.R. 4493 (117th)",
            "Bill Name": "Promoting Secure 5G Act of 2021",
            "Subject Areas": "Science, Technology, Communications",
            "Summary": "This bill requires the Department of the Treasury to instruct the U.S. Executive Director at each international financial institution (e.g., the International Monetary Fund or the International Finance Corporation) that it is U.S. policy to support institutional assistance with advanced wireless technologies only if they provide appropriate security for users, encourage assistance with infrastructure or policy reforms that facilitate the use of secure advanced wireless technologies, and cooperate with institutional member states to strengthen international support for such technologies."
        },
        {
            "Bill Number": "H.R. 3577 (117th)",
            "First Name": "Ted  Budd",
            "Last Name": "cosponsor",
            "Role": "H.R. 3577 (117th)",
            "Bill Name": "United States Army Rangers Veterans of World War II Congressional Gold Medal Act",
            "Subject Areas": "Armed Forces and National Security, Conflicts and wars, Congressional tributes, Military history, Museums, exhibitions, cultural centers, Smithsonian Institution, Veterans' organizations and recognition",
            "Summary": "This bill provides for the award of a single Congressional Gold Medal to the U.S. Army Rangers Veterans of World War II in recognition of their dedicated service during World War II."
        },
        {
            "Bill Number": "H.R. 2746 (117th)",
            "First Name": "Ted  Budd",
            "Last Name": "cosponsor",
            "Role": "H.R. 2746 (117th)",
            "Bill Name": "To amend title 28, United States Code, to redefine the eastern and middle judicial districts of North Carolina.",
            "Subject Areas": "Law, Federal district courts, North Carolina",
            "Summary": "This bill moves portions of four counties encompassing the Fort Bragg Military Reservation and Camp Mackall from the Middle District to the Eastern District of North Carolina."
        },
        {
            "Bill Number": "H.R. 707 (117th)",
            "First Name": "Ted  Budd",
            "Last Name": "cosponsor",
            "Role": "H.R. 707 (117th)",
            "Bill Name": "Ghost Army Congressional Gold Medal Act",
            "Subject Areas": "Military operations and strategy, Military personnel and dependents, Museums, exhibitions, cultural centers, Smithsonian Institution",
            "Summary": "This bill directs the Speaker of the House of Representatives and the President pro tempore of the Senate to award a Congressional Gold Medal to the 23rd Headquarters Special Troops and the 3133rd Signal Service Company, known as the Ghost Army, collectively, in recognition of its service during World War II."
        },
        {
            "Bill Number": "H.R. 2566 (117th)",
            "First Name": "Ted  Budd",
            "Last Name": "cosponsor",
            "Role": "H.R. 2566 (117th)",
            "Bill Name": "No TikTok on Government Devices Act",
            "Subject Areas": "Government employee pay, benefits, personnel management, Internet and video services",
            "Summary": "This bill requires the social media video application TikTok to be removed from the information technology of federal agencies.Specifically, the bill requires the Office of Management and Budget to develop standards for executive agencies that require TikTok and any successor application from the developer to be removed from agency information technology (e.g., devices). Such standards must include exceptions for law enforcement activities, national security interests, and security researchers."
        },
        {
            "Bill Number": "H.R. 2137 (117th)",
            "First Name": "Ted  Budd",
            "Last Name": "cosponsor",
            "Role": "H.R. 2137 (117th)",
            "Bill Name": "Jaime Zapata and Victor Avila Federal Law Enforcement Protection Act",
            "Subject Areas": "Government employee pay, benefits, personnel management, Jurisdiction and venue, Law enforcement officers, Protection of officials, Violent crime",
            "Summary": "This bill explicitly grants extraterritorial jurisdiction over criminal conduct involving the killing (or attempted killing) of a federal officer or employee. The United States may prosecute such conduct that occurs outside the United States."
        },
        {
            "Bill Number": "H.R. 1085 (117th)",
            "First Name": "Ted  Budd",
            "Last Name": "cosponsor",
            "Role": "H.R. 1085 (117th)",
            "Bill Name": "To award three congressional gold medals to the United States Capitol Police and those who protected the U.S. Capitol on January 6, 2021.",
            "Subject Areas": "Assault and harassment offenses, Congress, Congressional tributes, Crimes against property, District of Columbia, Government buildings, facilities, and property, Law enforcement officers, Museums, exhibitions, cultural centers, Protest and dissent, Smithsonian Institution, Subversive activities, Terrorism, U.S. Capitol, Violent crime",
            "Summary": "This bill directs the Speaker of the House and the President pro tempore of the Senate to arrange for the award of three Congressional Gold Medals to the U.S. Capitol Police (USCP) and other law enforcement agencies that protected the U.S. Capitol on January 6, 2021.Following the award of these medals, one medal shall be given to the USCP, one medal shall be given to the Metropolitan Police Department of the District of Columbia, and one medal shall be given to the Smithsonian Institution and displayed with a plaque listing all law enforcement agencies that participated in protecting the Capitol on January 6, 2021."
        },
        {
            "Bill Number": "H.R. 1799 (117th)",
            "First Name": "Ted  Budd",
            "Last Name": "cosponsor",
            "Role": "H.R. 1799 (117th)",
            "Bill Name": "PPP Extension Act of 2021",
            "Subject Areas": "Commerce, Business expenses, Cardiovascular and respiratory health, Emergency medical services and trauma care, Government lending and loan guarantees, Infectious and parasitic diseases, Small business, Wages and earnings",
            "Summary": "This bill extends the Paycheck Protection Program, established to support small businesses in response to COVID-19 (i.e., coronavirus disease 2019), through June 30, 2021. Currently, the program is set to expire on March 31, 2021.For the final 30 days of the program (i.e., from June 1 until June 30), the Small Business Administration may only process applications submitted prior to June 1, and it may not accept any new loan applications.The bill excludes the budgetary effects of this bill from PAYGO scorecards under the Statutory Pay-As-You-Go Act of 2010 and from Senate PAYGO scorecards."
        },
        {
            "Bill Number": "H.R. 1179 (117th)",
            "First Name": "Ted  Budd",
            "Last Name": "cosponsor",
            "Role": "H.R. 1179 (117th)",
            "Bill Name": "Iran Hostages Congressional Gold Medal Act",
            "Subject Areas": "International Affairs, Congressional tributes, Detention of persons, Diplomacy, foreign officials, Americans abroad, Iran, Middle East, Museums, exhibitions, cultural centers, Smithsonian Institution",
            "Summary": "This bill requires the Speaker of the House of Representatives and the President pro tempore of the Senate to arrange for the award of a Congressional Gold Medal commemorating the bravery and endurance of the 53 hostages of the Iran Hostage Crisis.Following its award, the medal shall be given to the National Museum of American History of the Smithsonian Institution for display and research.The Department of the Treasury must strike duplicate medals in silver for presentation to a hostage (or the personal representative of a deceased hostage), and Treasury may also strike and sell duplicate medals in bronze."
        },
        {
            "Bill Number": "H.R. 611 (117th)",
            "First Name": "Ted  Budd",
            "Last Name": "cosponsor",
            "Role": "H.R. 611 (117th)",
            "Bill Name": "ROCKS Act",
            "Subject Areas": "Transportation and Public Works, Advisory bodies, Congressional oversight, Environmental assessment, monitoring, research, Government studies and investigations, Infrastructure development, Materials, Regional and metropolitan planning, Transportation costs",
            "Summary": "This bill directs the Department of Transportation to establish a working group of stakeholders (e.g., state, tribal, and local transportation and planning agencies) with knowledge and expertise in the production and transportation of materials used in the construction and maintenance of transportation infrastructure projects to conduct a study on access to such materials, including access to stone, sand, and gravel."
        },
        {
            "Bill Number": "H.R. 217 (117th)",
            "First Name": "Ted  Budd",
            "Last Name": "cosponsor",
            "Role": "H.R. 217 (117th)",
            "Bill Name": "Improving Confidence in Veterans\\u2019 Care Act",
            "Subject Areas": "Armed Forces and National Security, Accounting and auditing, Administrative remedies, Congressional oversight, Department of Veterans Affairs, Drug trafficking and controlled substances, Drug, alcohol, tobacco use, Employee hiring, Employee performance, Employment and training programs, Government employee pay, benefits, personnel management, Government studies and investigations, Health care quality, Health facilities and institutions, Health personnel, Licensing and registrations, Medical ethics, Personnel records, Prescription drugs, Public contracts and procurement, Veterans' medical care",
            "Summary": "This bill prescribes oversight requirements for the Department of Veterans Affairs (VA) regarding health care professionals at VA medical centers.Specifically, the bill requires the VA to ensure each VA medical center consistently compiles, verifies, and reviews specified documentation for each VA health care professional (including contractors).The VA shall ensure that specified health care professionals hold an active Drug Enforcement Administration registration.Each VA medical center must implement (1) monitoring of the performance and quality of the health care delivered by each health care professional at the center, and (2) reviews of such care if an individual notifies the VA of any potential concerns relating to a failure to meet generally accepted standards of clinical practice.The bill imposes notification requirements in situations where the VA substantiates a concern relating to the clinical competency of, or quality of care delivered by, a current or former VA health care professional.The VA is prohibited from entering into a settlement agreement relating to an adverse action against a VA health care professional if such agreement includes terms that require the VA to conceal certain information from the employee's personnel file. Such prohibition does not apply to adverse actions determined to be prohibited personnel practices.The VA must provide mandatory training, at least biannually, to employees of each medical center who are responsible for specified tasks (e.g., those who are responsible for compiling, validating, or reviewing the credentials of VA health care professionals)."
        }
    ],
    "SponsoredBills": [
        {
            "Bill Number": "H.R. 2720 (117th)",
            "First Name": "Ted  Budd",
            "Last Name": "sponsor",
            "Role": "H.R. 2720 (117th)",
            "Bill Name": "Make PPE in America Act",
            "Subject Areas": "Emergency medical services and trauma care, Health promotion and preventive care, Health technology, devices, supplies, Infectious and parasitic diseases, Manufacturing, Public contracts and procurement, Strategic materials and reserves, Worker safety and health",
            "Summary": "This bill requires procurement contracts for personal protective equipment (PPE) to be long-term and for domestically manufactured PPE.Specifically, contracts entered into by the Departments of Homeland Security, Health and Human Services, Defense, Education, or Veterans Affairs for the procurement of PPE must be for a duration of at least three years, including a base period and all option periods, to incentivize investment in the production of PPE, and materials and components of PPE, in the United States.The bill provides exceptions (1) where a nonavailability determination has been made, (2) where a sufficient quantity of a satisfactory quality cannot be procured as and when needed at U.S. market prices, and (3) where the department certifies every 120 days that it is necessary to procure PPE under alternate procedures to respond to the immediate needs of a public health emergency.Such departments may transfer to the Strategic National Stockpile any excess PPE acquired under a contract."
        }
    ],
    "VotingRecord": [
        {
            "Bill Number": "S. 189 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Yea",
            "Bill Number.1": "S. 189 (117th)",
            "Bill Name": "Veterans\\u2019 Compensation Cost-of-Living Adjustment Act of 2021",
            "Summary": "This bill requires the Department of Veterans Affairs (VA) to increase the amounts payable for wartime disability compensation, additional compensation for dependents, the clothing allowance for certain disabled veterans, and dependency and indemnity compensation for surviving spouses and children. Specifically, the VA must increase the amounts by the same percentage as the cost-of-living increase in benefits for Social Security recipients that is effective on December 1, 2021. The bill requires the VA to publish the amounts payable, as increased, in the Federal Register.The VA is authorized to make a similar adjustment to the rates of disability compensation payable to persons who have not received compensation for service-connected disability or death.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "S. 958 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Yea",
            "Bill Number.1": "S. 958 (117th)",
            "Bill Name": "Maximizing Outcomes through Better Investments in Lifesaving Equipment for (MOBILE) Health Care Act",
            "Summary": "This bill allows a health center that currently receives funding through a Health Resources & Services Administration Health Center Program grant to use a New Access Point grant to set up a mobile unit regardless of whether the health center also establishes a permanent health care delivery site.New Access Point grants help health centers establish new delivery sites to provide comprehensive primary care to medically underserved populations. Under current law, health centers may only use the grants to set up a mobile unit if they also establish a permanent site.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "S. 516 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Not Voting",
            "Bill Number.1": "S. 516 (117th)",
            "Bill Name": "Advanced Air Mobility Coordination and Leadership Act",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "S. 144 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Yea",
            "Bill Number.1": "S. 144 (117th)",
            "Bill Name": "Desert Sage Youth Wellness Center Access Improvement Act",
            "Summary": "This bill authorizes the Indian Health Service (IHS) to purchase certain private land in Hemet, California, at fair market value and then construct a paved road on that land to facilitate access to the Desert Sage Youth Wellness Center. The IHS shall maintain the road or enter an agreement with Riverside County, California, to maintain the road.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "S. 3499 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Yea",
            "Bill Number.1": "S. 3499",
            "Bill Name": "A bill to provide emergency acquisition authority for purposes of replenishing United States stockpiles.",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1664 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Not Voting",
            "Bill Number.1": "H.R. 1664 (117th)",
            "Bill Name": "To authorize the National Medal of Honor Museum Foundation to establish a commemorative work in the District of Columbia and its environs, and for other purposes.",
            "Summary": "This bill authorizes the National Medal of Honor Museum Foundation to establish a commemorative work on federal land in the District of Columbia in honor of the extraordinary acts of valor, selfless service, and sacrifice displayed by Medal of Honor recipients.The foundation shall be solely responsible for the acceptance of contributions for, and the payment of expenses of, the establishment of the commemorative work.Federal funds may not be used to pay any expenses for the establishment of the commemorative work.The establishment of the commemorative work shall be in accordance with the Commemorative Works Act.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "S. 4834 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Yea",
            "Bill Number.1": "S. 4834 (117th)",
            "Bill Name": "PROTECT Our Children Act of 2022",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "S.Amdt. 1296 (Cruz) to H.R. 4366",
            "First Name": "Ted Budd",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 4366",
            "Bill Name": "Consolidated Appropriations Act, 2024",
            "Summary": "This bill provides FY2024 appropriations for several federal departments and agencies. It also extends various expiring programs and authorities, including several public health programs.Specifically, the bill includes 6 of the 12 regular FY2024 appropriations bills: the Military Construction, Veterans Affairs, and Related Agencies Appropriations Act, 2024; the Agriculture, Rural Development, Food and Drug Administration, and Related Agencies Appropriations Act, 2024; the Commerce, Justice, Science, and Related Agencies Appropriations Act, 2024; the Energy and Water Development and Related Agencies Appropriations Act, 2024; the Department of the Interior, Environment, and Related Agencies Appropriations Act, 2024; and the Transportation, Housing and Urban Development, and Related Agencies Appropriations Act, 2024. The departments, agencies, and activities funded in the bill include Department of Defense military construction and family housing activities, the Department of Veterans Affairs, the Department of Agriculture, the Food and Drug Administration, the Department of Commerce, the Department of Justice, the science agencies, the Department of Energy, the U.S. Army Corps of Engineers, the Department of the Interior, the Environmental Protection Agency, the Department of Transportation, the Department of Housing and Urban Development, and several related and independent agencies. In addition, the bill includes several provisions that extend or otherwise modify various programs and authorities, including several public health programs.The bill also modifies the Compacts of Free Association that govern the relationship between the United States and the Republic of the Marshall Islands, the Federated States of Micronesia, and the Republic of Palau.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "S. 5087 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Yea",
            "Bill Number.1": "S. 5087 (117th)",
            "Bill Name": "A bill to amend the Not Invisible Act of 2019 to extend, and provide additional support for, the activities of the Department of the Interior and the Department of Justice Joint Commission on Reducing Violent Crime Against Indians, and f",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "S.Amdt. 1232 (Lankford) to H.R. 4366",
            "First Name": "Ted Budd",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 4366",
            "Bill Name": "Consolidated Appropriations Act, 2024",
            "Summary": "This bill provides FY2024 appropriations for several federal departments and agencies. It also extends various expiring programs and authorities, including several public health programs.Specifically, the bill includes 6 of the 12 regular FY2024 appropriations bills: the Military Construction, Veterans Affairs, and Related Agencies Appropriations Act, 2024; the Agriculture, Rural Development, Food and Drug Administration, and Related Agencies Appropriations Act, 2024; the Commerce, Justice, Science, and Related Agencies Appropriations Act, 2024; the Energy and Water Development and Related Agencies Appropriations Act, 2024; the Department of the Interior, Environment, and Related Agencies Appropriations Act, 2024; and the Transportation, Housing and Urban Development, and Related Agencies Appropriations Act, 2024. The departments, agencies, and activities funded in the bill include Department of Defense military construction and family housing activities, the Department of Veterans Affairs, the Department of Agriculture, the Food and Drug Administration, the Department of Commerce, the Department of Justice, the science agencies, the Department of Energy, the U.S. Army Corps of Engineers, the Department of the Interior, the Environmental Protection Agency, the Department of Transportation, the Department of Housing and Urban Development, and several related and independent agencies. In addition, the bill includes several provisions that extend or otherwise modify various programs and authorities, including several public health programs.The bill also modifies the Compacts of Free Association that govern the relationship between the United States and the Republic of the Marshall Islands, the Federated States of Micronesia, and the Republic of Palau.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 203 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 203 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 4020 Broadway Street in Houston, Texas, as the Benny C. Martinez Post Office Building.",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3630 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3630 (117th)",
            "Bill Name": "Lymphedema Treatment Act",
            "Summary": "This bill provides for Medicare coverage of lymphedema compression treatment items. Specifically, the bill provides for coverage of standard and custom fitted gradient compression garments and other approved items that are prescribed by a physician or other specified health care professional to treat lymphedema.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 2278 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 2278 (117th)",
            "Bill Name": "To designate the September 11th National Memorial Trail Route, and for other purposes.",
            "Summary": "This bill designates a trail route, to be known as the September 11th National Memorial Trail Route, to link the National 9/11 Memorial and Museum in New York, New York, the National 9/11 Pentagon Memorial in Arlington, Virginia, and the Flight 93 National Memorial in Somerset County, Pennsylvania.The September 11th National Memorial Trail Route shall provide for a tribute to the family members and loved ones who were victims of the attack and the heroes of September 11th, including the first responders in the days, weeks, and months after the attack; be a trail of remembrance to honor the fallen in a tangible way that keeps their memories alive and reaffirms the exceptionalism of our country; and be a celebration of our nation's resilience and perseverance since September 11, 2001. The September 11th National Memorial Trail Route shall be administered by the National Park Service but not be considered to be a unit of the National Park System or a part of the National Trail System.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "S. 4003 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Yea",
            "Bill Number.1": "S. 4003 (117th)",
            "Bill Name": "Law Enforcement De-Escalation Training Act of 2022",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3843 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3843 (117th)",
            "Bill Name": "Merger Filing Fee Modernization Act of 2022",
            "Summary": "This bill modifies and expands the schedule for graduated merger filing fees and requires that such fees be adjusted each year based on the Consumer Price Index. It also (1) requires parties to disclose in their premerger notification filings any subsidy received from a foreign entity of concern, (2) modifies the venue rules for multi-district antitrust litigation, and (3) establishes various reporting requirements.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 2670",
            "First Name": "Ted Budd",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 2670",
            "Bill Name": "National Defense Authorization Act for Fiscal Year 2024",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 2882",
            "First Name": "Ted Budd",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 2882",
            "Bill Name": "Further Consolidated Appropriations Act, 2024",
            "Summary": "This bill provides FY2024 appropriations for several federal departments and agencies. It also extends various expiring programs and authorities. Specifically, the bill includes 6 of the 12 regular FY2024 appropriations bills: the Department of Defense Appropriations Act, 2024; the Financial Services and General Government Appropriations Act, 2024; the Department of Homeland Security Appropriations Act, 2024; the Departments of Labor, Health and Human Services, and Education, and Related Agencies Appropriations Act, 2024; the Legislative Branch Appropriations Act, 2024; and the Department of State, Foreign Operations, and Related Programs Appropriations Act, 2024. The departments, agencies, and activities funded in the bill include the military activities of the Department of Defense, the Department of the Treasury, the Executive Office of the President, the judiciary, federal payments to the District of Columbia, the Department of Homeland Security, the Department of Labor, the Department of Health and Human Services, the Department of Education, Congress and the agencies that serve Congress, the Department of State, and several related and independent agencies. In addition, the bill extends various programs and authorities, including the National Flood Insurance Program, the Morris K. Udall and Stewart L. Udall Foundation Trust Fund, and several authorities and programs related to immigration.The bill also prohibits State Department funds from being used to make payments to the U.N. Relief and Works Agency until March 25, 2025.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "S. 4926 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Yea",
            "Bill Number.1": "S. 4926 (117th)",
            "Bill Name": "Respect for Child Survivors Act",
            "Summary": "This bill requires the Federal Bureau of Investigation (FBI) to use a multidisciplinary approach with any investigation of child sexual exploitation or abuse, the production of child sexual abuse material, or child trafficking. The FBI must also use a trained child adolescent forensic interviewer in these investigations if practicable and consistent with applicable federal law.In implementing a multidisciplinary approach, the bill requires the FBI to use and coordinate with multidisciplinary teams based at children's advocacy centers.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3237 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3237 (117th)",
            "Bill Name": "Emergency Security Supplemental Appropriations Act, 2021",
            "Summary": "This bill provides FY2021 supplemental appropriations for federal agencies to respond to the events at the U.S. Capitol Complex on January 6, 2021, and assist Afghan refugees.It also provides supplemental appropriations for the legislative branch to address COVID-19 and modifies requirements for certain programs that provide special immigrant status to eligible nationals of Afghanistan or Iraq,TITLE I--DEPARTMENT OF DEFENSEThis title provides appropriations for the National Guard to respond to the events at the U.S. Capitol Complex on January 6, 2021, and for related purposes.The title also provides appropriations to the Department of Defense for overseas humanitarian, disaster, and civic aid.TITLE II--DEPARTMENT OF HEALTH AND HUMAN SERVICESThis title provides appropriations to the Administration for Children and Families for refugee and entrance assistance activities.The funding must be used for activities for Afghan individuals within the United States who have been granted special immigrant status.TITLE III--LEGISLATIVE BRANCHThis title provides appropriations for the legislative branch to respond to the events at the U.S. Capitol Complex on January 6, 2021, and address COVID-19.Specifically, the title provides appropriations for the Senate, the House of Representatives, the U.S. Capitol Police, U.S. Capitol Police Mutual Aid Reimbursements, and the Architect of the Capitol (AOC). The title also provides appropriations for payments to the widows and heirs of deceased Members of Congress, including (1) Susan M. Wright, widow of the late Representative Ronald Wright; and (2) the heirs of the late Representative Alcee Hastings.(Sec. 301) This section designates the wellness program of the U.S. Capitol Police as the Howard C. Liebengood Center for Wellness.(Sec. 302) This section modifies the salary cap for the U.S. Capitol Police during 2021. (Sec. 310) This section prohibits funds from being used to install permanent, above-ground fencing around the perimeter, or any portion thereof, of the U.S. Capitol Grounds.(Sec. 311) With congressional approval, the AOC may accept contributions of, and incur obligations and make expenditures out of available appropriations for, supplies, products, and services necessary to respond to an emergency involving the safety of human life or the protection of property, as determined or declared by the Capitol Police Board.TITLE IV--BILATERAL ECONOMIC ASSISTANCEThis title provides appropriations to the Department of State for migration and refugee assistance to address humanitarian needs in Afghanistan and to assist Afghan refugees. The title also provides appropriations to the State Department for the United States Emergency Refugee and Migration Assistance Fund.(Sec. 401) This section increases the number of special immigrant visas available to qualified Afghan nationals who worked for the U.S. government or a North Atlantic Treaty Organization (NATO) mission in Afghanistan, extends the deadline for applying for such visas, and relaxes certain qualifications.All applicants for such a visa must establish that the applicant was employed with the U.S. government or a NATO mission for one year, where currently some applicants must prove two years of employment. This section also eliminates a requirement that the applicant faces an ongoing serious threat in Afghanistan due to such employment.Furthermore, for an applicant qualifying for a visa by performing duties for U.S. military personnel stationed with a NATO mission, this section eliminates a requirement that the duties performed qualify as sensitive and trusted duties.This section also relaxes limits to appealing rejections for applications for such visas.(Sec. 402) This bill authorizes the State Department and the Department of Homeland Security (DHS) to jointly postpone the medical exam requirement for individuals seeking entry into the United States under the program described in Section 401.If an individual receives such a postponement, DHS shall ensure to the greatest extent possible that individual undergoes a medical exam no later than 30 days after admission into the United States. Such an individual's status as a lawful permanent resident shall be conditional until the individual undergoes the required medical exam.(Sec. 403) This section modifies the immigration benefits of the surviving family members of certain deceased individuals.The surviving spouse or child of a U.S. government employee abroad shall qualify as a special immigrant if that employee performed at least 15 years of faithful service or was killed in the line of duty.This section also expands surviving family member benefits for certain programs that provide special immigrant status to eligible nationals of Afghanistan or Iraq, including the program described in Section 401. Specifically, if an individual submitted an application to the Chief of Mission that included an accompanying spouse or child and that application would have been approved but for the individual's death, the surviving spouse or child shall remain eligible to receive a visa under the respective program. Currently, such survivor rights only apply if the deceased individual's petition was approved.(Sec. 404) If an individual has an approved petition under a program that provided special immigrant status to translators who worked for the Armed Forces in Afghanistan or Iraq but a visa is not immediately available, the State Department or DHS may convert that petition to an approved petition under another program which provides special immigrant status to certain Iraqi nationals, if there are visas available under that second program. (DHS and the State Department currently only have the authority to convert petitions filed before October 1, 2008.)TITLE V--DEPARTMENT OF JUSTICEThis title provides appropriations to the Department of Justice (DOJ) for state and local law enforcement assistance.DOJ must use the funds for restoring funds that were used for extraordinary law enforcement and related costs directly associated with protection of the President-elect from November 4, 2020, until the inauguration of the President-elect as President.TITLE VI--GENERAL PROVISIONS--THIS ACT(Sec. 601) This section specifies that the funds provided by this bill are in addition to funds otherwise appropriated for the fiscal year involved.(Sec. 602) Funds provided by this bill may not remain available beyond the current fiscal year, unless this bill provides otherwise.(Sec. 603) Unless otherwise specified by this bill, the funds provided by this bill are subject to the authorities and conditions that apply to the applicable appropriations account for FY2021.(Sec. 604) This section specifies that funding provided by this bill may only be used for the purposes specifically described in the bill. The section includes an exception for funds used to restore amounts for obligations incurred prior to the date of the enactment of this bill.(Sec. 605) This section specifies that the term coronavirus in this bill means SARS-CoV-2 or another coronavirus with pandemic potential.(Sec. 606) This section provides that amounts designated by this bill as emergency requirements are only available (or rescinded or transferred, if applicable) if the President subsequently designates the amounts and transmits the designations to Congress.(Sec. 607) This section specifies that the emergency funds that are transferred pursuant to this bill retain the emergency designation.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "S.J.Res. 14 (117th)",
            "First Name": "Ted Budd",
            "Vote": "Nay",
            "Bill Number.1": "S.J.Res. 14 (117th)",
            "Bill Name": "A joint resolution providing for congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the Environmental Protection Agency relating to \\u201cOil and Natural Gas Sector: Emission Standards for N",
            "Summary": NaN,
            "Status": "Enacted"
        }
    ]
}