{
    "Name": "Troy Carter",
    "Profile": {
        "Public Office": {
            "Member of the U.S. House of Representativesfrom Louisiana's 2nd district": {
                "Incumbent": "Incumbent",
                "Assumed office": "May 11, 2021",
                "Preceded by": "Cedric Richmond",
                "District Info": {
                    "Median householdincome": "$65,197",
                    "Distribution": "86.02% urban,13.98% rural",
                    "Population": "775,969",
                    "Ethnicity": "72.9% ,White,13.3% ,Black,8.4% ,Hispanic,2.3% ,Asian,1.7% ,Two or more races,1.4% other"
                }
            },
            "Minority Leader of the Louisiana Senate": {
                "In office": "January 11, 2016 – May 10, 2021",
                "Preceded by": "Eric LaFleur",
                "Succeeded by": "Gerald Boudreaux"
            },
            "Member of the Louisiana Senatefrom the 7th district": {
                "In office": "January 11, 2016 – May 10, 2021",
                "Preceded by": "David Heitmeier",
                "Succeeded by": "Gary Carter Jr."
            },
            "Member of the New Orleans City Councilfrom District C": {
                "In office": "1994–2002",
                "Preceded by": "Jackie Clarkson",
                "Succeeded by": "Jackie Clarkson"
            },
            "Member of the Louisiana House of Representativesfrom the 102nd district": {
                "In office": "January 1992 – January 1994",
                "Preceded by": "Francis C. Heitmeier",
                "Succeeded by": "Jackie Clarkson"
            }
        },
        "Personal Details": {
            "Personal details": {
                "Born": "Troy Anthony Carter, (,1963-10-26,) ,October 26, 1963, (age 59),New Orleans,, ,Louisiana,, U.S.",
                "Political party": "Democratic",
                "Spouse": "Andreé Navarro",
                "Children": "2",
                "Education": "Xavier University of Louisiana, (,BA,)",
                "Website": "House website"
            }
        }
    },
    "UnusedVotingRecords": [
        {
            "Bill Number": "H.R. 567 (117th)",
            "First Name": "Troy Carter",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 567 (117th)",
            "Bill Name": "Trans-Sahara Counterterrorism Partnership Program Act of 2021",
            "Summary": "This bill provides statutory authority for the Trans-Sahara Counterterrorism Partnership Program, an interagency program launched in 2005 to partner with countries in the Sahel and Maghreb regions of Africa to counter terrorism and violent extremism.The Department of State, in consultation with the Department of Defense and the U.S. Agency for International Development, shall establish the partnership program, which must coordinate all U.S. programs in North and West Africa related to various counterterrorism activities, such as building foreign-military capacity, enhancing border security, promoting youth employment, and supporting independent media to counter terrorist propaganda.The State Department must submit comprehensive, five-year strategies that include specified activities for the Sahel and Maghreb regions and for program counterterrorism efforts. Further, program activities must, among other things (1) be carried out in countries where there is an adequate level of partner country committment, and (2) have clearly defined outcomes and specific plans with indicators to regularly monitor and evaluate outcomes and impact. Such activities must also take into account the counterterrorism and development strategies of partner countries and align with such strategies to the extent possible.The State Department shall notify Congress before obligating funds for such programs, and must submit annual reports about program activities.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 2225 (117th)",
            "First Name": "Troy Carter",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 2225 (117th)",
            "Bill Name": "National Science Foundation for the Future Act",
            "Summary": "This bill reauthorizes the National Science Foundation (NSF) through FY2026 and authorizes programs and activities at the NSF.The bill establishes requirements for the NSF, including to enter into a contract with the National Academies of Science, Engineering, and Medicine to assess the status and opportunities for Pre-K through 12 science, technology, engineering, and mathematics, including computer science, (STEM) education research; award grants to establish no fewer than three multidisciplinary Centers for Transformative Education Research and Translation to support research and development of STEM education innovations; provide grants for research on programming that engages students in grades Pre-K through 8, including underrepresented and rural students, in STEM in order to prepare such students to pursue degrees or careers in STEM; award grants to support research and development activities to encourage greater collaboration and coordination between institutions of higher education and industry to enhance education, foster hands-on learning experiences, and improve alignment with workforce needs; award grants to establish a network of centers for science and technical education; award grants to advance research on the nature of learning and teaching at community colleges; award grants to establish traineeship programs for graduate students who pursue artificial intelligence-related research leading to a masters or doctorate degree; award grants to carry out research on the cyber workforce; establish a cybersecurity workforce data initiative; carry out a national initiative to facilitate the development of networks and partnerships to broaden participation in STEM studies and careers of groups historically underrepresented in such studies and careers; maintain a Research Security and Policy office to coordinate all research security policy issues across the NSF; award grants to support research to improve our understanding of the climate system and related human and environmental systems; support research to significantly advance our understanding of the food-energy-water system; award grants to advance knowledge of risk assessment and predictability to improve our ability to predict extreme events and natural hazards, including pandemics; and award grants to support basic research that will accelerate innovation to advance critical minerals mining strategies and technologies. The bill also establishes within the NSF a Directorate for Science and Engineering Solutions to advance research and development solutions to address societal and national challenges.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3593 (117th)",
            "First Name": "Troy Carter",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3593 (117th)",
            "Bill Name": "Department of Energy Science for the Future Act",
            "Summary": "This bill supports specified research and development activities of the Department of Energy (DOE) Office of Science.The bill establishes various programs, including a basic energy sciences research and development program; a program of research and development for the application of advanced computing practices to foundational and emerging research problems in chemistry and materials science; a web-based platform to develop and provide access to a database of computed information on known and predicted materials properties and computational tools to accelerate breakthroughs in materials discovery and design; a biological systems science and climate and environmental science research and development program; research and development activities in biomolecular characterization and imaging science; earth and environmental systems science research; a coastal zone research initiative; an initiative focused on the development of engineered ecosystems; a program to implement a strategy for achieving computing systems with capabilities beyond exascale computing systems; a program of fundamental research and development of energy efficient computing and data center technologies relevant to advanced computing applications; a Quantum User Expansion for Science and Technology program or QUEST program; a collaborative research and development program of fusion energy technologies; a research program in elementary particle physics and advanced technology research and development to improve the understanding of the fundamental properties of the universe, including constituents of matter and energy and the nature of space and time; research activities on the nature of the primary contents of the universe, including the nature of dark energy and dark matter; a research program to discover and understand various forms of nuclear matter; a program across the DOE for the production of isotopes, including the development of techniques to produce isotopes, that the DOE determines are needed for research, medical, industrial, or related purposes; a midscale instrumentation program to enable the development and acquisition of novel, state-of-the-art instruments ranging in cost from $1 million to $20 million each that would significantly accelerate scientific breakthroughs at user facilities; and a high intensity laser research initiative. The DOE Office of Science shall continue to leverage U.S. participation in the Large Hadron Collider and prioritize expanding international partnerships and investments in the Long-Baseline Neutrino Facility and Deep Underground Neutrino Experiment.DOE shall support construction of a Facility for Rare Isotope Beams to advance the understanding of rare nuclear isotopes and the evolution of the cosmos.DOE shall expand opportunities to increase the number, diversity, equity, and inclusion of highly skilled science, technology, engineering, and mathematics (STEM) professionals working in DOE mission-relevant disciplines and broaden the recruitment pool to increase diversity, including expanded partnerships with Historically Black Colleges, Tribal Colleges, Minority Serving Institutions, emerging research institutions, and scientific societies.DOE shall establish within the DOE Office of Science, a cross-cutting research initiative to leverage the federal government's innovative analytical resources and tools, user facilities, and advanced computational and networking capabilities in order to prevent, prepare for, and respond to emerging infectious diseases, including COVID-19.DOE may not carry out gain-of-function research of concern.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 2724 (117th)",
            "First Name": "Troy Carter",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 2724 (117th)",
            "Bill Name": "VA Peer Support Enhancement for MST Survivors Act",
            "Summary": "This bill requires the Department of Veterans Affairs to ensure that each individual who files a claim relating to military sexual trauma is assigned a peer support specialist during the claims process, unless the individual elects to not have such support.Under the bill, a peer support specialist must be trained as a victim advocate and may not be responsible for any part of adjudicating the individual's claim.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 2992 (117th)",
            "First Name": "Troy Carter",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 2992 (117th)",
            "Bill Name": "Traumatic Brain Injury and Post-Traumatic Stress Disorder Law Enforcement Training Act",
            "Summary": "This bill requires the Bureau of Justice Assistance (BJA) to consult with relevant agencies to establish crisis intervention training tools for first responders to address individuals with traumatic brain injuries, acquired brain injuries, and post-traumatic stress disorder. The BJA must ensure that at least one police department designated as a Law Enforcement Mental Health Learning Site utilizes the tools and that such tools are part of the Police-Mental Health Collaboration Toolkit.Additionally, the bill requires the Centers for Disease Control and Prevention to study and report about the prevalence and incidence of concussions among first responders.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 7335 (117th)",
            "First Name": "Troy Carter",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 7335 (117th)",
            "Bill Name": "MST Claims Coordination Act",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3325 (117th)",
            "First Name": "Troy Carter",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3325 (117th)",
            "Bill Name": "To award four congressional gold medals to the United States Capitol Police and those who protected the U.S. Capitol on January 6, 2021.",
            "Summary": "This bill provides for the award of Congressional Gold Medals to the U.S. Capitol Police and the Metropolitan Police Department of the District of Columbia in recognition of the law enforcement agencies that protected the U.S. Capitol on January 6, 2021.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 2670",
            "First Name": "Troy Carter",
            "Vote": "Nay",
            "Bill Number.1": "H.R. 2670",
            "Bill Name": "National Defense Authorization Act for Fiscal Year 2024",
            "Summary": NaN,
            "Status": "Enacted",
            "Democrat_Yea": 0.7652582159624414,
            "Democrat_Nay": 0.2112676056338028,
            "Republican_Yea": 0.665158371040724,
            "Republican_Nay": 0.3303167420814479
        },
        {
            "Bill Number": "H.R. 6604 (117th)",
            "First Name": "Troy Carter",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 6604 (117th)",
            "Bill Name": "Veterans Eligible to Transfer School (VETS) Credit Act",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 6868 (117th)",
            "First Name": "Troy Carter",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 6868 (117th)",
            "Bill Name": "Cybersecurity Grants for Schools Act of 2022",
            "Summary": "This bill allows the Cybersecurity and Infrastructure Security Agency (CISA) to award grants or other financial assistance for cybersecurity and infrastructure security education and training programs at the elementary and secondary education levels. Entities eligible for the assistance include states, localities, institutions of higher education, and nonprofits. Additionally, CISA must include information about how the grants and assistance enhance cybersecurity education for underserved populations or communities in annual briefings.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3237 (117th)",
            "First Name": "Troy Carter",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3237 (117th)",
            "Bill Name": "Emergency Security Supplemental Appropriations Act, 2021",
            "Summary": "This bill provides FY2021 supplemental appropriations for federal agencies to respond to the events at the U.S. Capitol Complex on January 6, 2021, and assist Afghan refugees.It also provides supplemental appropriations for the legislative branch to address COVID-19 and modifies requirements for certain programs that provide special immigrant status to eligible nationals of Afghanistan or Iraq,TITLE I--DEPARTMENT OF DEFENSEThis title provides appropriations for the National Guard to respond to the events at the U.S. Capitol Complex on January 6, 2021, and for related purposes.The title also provides appropriations to the Department of Defense for overseas humanitarian, disaster, and civic aid.TITLE II--DEPARTMENT OF HEALTH AND HUMAN SERVICESThis title provides appropriations to the Administration for Children and Families for refugee and entrance assistance activities.The funding must be used for activities for Afghan individuals within the United States who have been granted special immigrant status.TITLE III--LEGISLATIVE BRANCHThis title provides appropriations for the legislative branch to respond to the events at the U.S. Capitol Complex on January 6, 2021, and address COVID-19.Specifically, the title provides appropriations for the Senate, the House of Representatives, the U.S. Capitol Police, U.S. Capitol Police Mutual Aid Reimbursements, and the Architect of the Capitol (AOC). The title also provides appropriations for payments to the widows and heirs of deceased Members of Congress, including (1) Susan M. Wright, widow of the late Representative Ronald Wright; and (2) the heirs of the late Representative Alcee Hastings.(Sec. 301) This section designates the wellness program of the U.S. Capitol Police as the Howard C. Liebengood Center for Wellness.(Sec. 302) This section modifies the salary cap for the U.S. Capitol Police during 2021. (Sec. 310) This section prohibits funds from being used to install permanent, above-ground fencing around the perimeter, or any portion thereof, of the U.S. Capitol Grounds.(Sec. 311) With congressional approval, the AOC may accept contributions of, and incur obligations and make expenditures out of available appropriations for, supplies, products, and services necessary to respond to an emergency involving the safety of human life or the protection of property, as determined or declared by the Capitol Police Board.TITLE IV--BILATERAL ECONOMIC ASSISTANCEThis title provides appropriations to the Department of State for migration and refugee assistance to address humanitarian needs in Afghanistan and to assist Afghan refugees. The title also provides appropriations to the State Department for the United States Emergency Refugee and Migration Assistance Fund.(Sec. 401) This section increases the number of special immigrant visas available to qualified Afghan nationals who worked for the U.S. government or a North Atlantic Treaty Organization (NATO) mission in Afghanistan, extends the deadline for applying for such visas, and relaxes certain qualifications.All applicants for such a visa must establish that the applicant was employed with the U.S. government or a NATO mission for one year, where currently some applicants must prove two years of employment. This section also eliminates a requirement that the applicant faces an ongoing serious threat in Afghanistan due to such employment.Furthermore, for an applicant qualifying for a visa by performing duties for U.S. military personnel stationed with a NATO mission, this section eliminates a requirement that the duties performed qualify as sensitive and trusted duties.This section also relaxes limits to appealing rejections for applications for such visas.(Sec. 402) This bill authorizes the State Department and the Department of Homeland Security (DHS) to jointly postpone the medical exam requirement for individuals seeking entry into the United States under the program described in Section 401.If an individual receives such a postponement, DHS shall ensure to the greatest extent possible that individual undergoes a medical exam no later than 30 days after admission into the United States. Such an individual's status as a lawful permanent resident shall be conditional until the individual undergoes the required medical exam.(Sec. 403) This section modifies the immigration benefits of the surviving family members of certain deceased individuals.The surviving spouse or child of a U.S. government employee abroad shall qualify as a special immigrant if that employee performed at least 15 years of faithful service or was killed in the line of duty.This section also expands surviving family member benefits for certain programs that provide special immigrant status to eligible nationals of Afghanistan or Iraq, including the program described in Section 401. Specifically, if an individual submitted an application to the Chief of Mission that included an accompanying spouse or child and that application would have been approved but for the individual's death, the surviving spouse or child shall remain eligible to receive a visa under the respective program. Currently, such survivor rights only apply if the deceased individual's petition was approved.(Sec. 404) If an individual has an approved petition under a program that provided special immigrant status to translators who worked for the Armed Forces in Afghanistan or Iraq but a visa is not immediately available, the State Department or DHS may convert that petition to an approved petition under another program which provides special immigrant status to certain Iraqi nationals, if there are visas available under that second program. (DHS and the State Department currently only have the authority to convert petitions filed before October 1, 2008.)TITLE V--DEPARTMENT OF JUSTICEThis title provides appropriations to the Department of Justice (DOJ) for state and local law enforcement assistance.DOJ must use the funds for restoring funds that were used for extraordinary law enforcement and related costs directly associated with protection of the President-elect from November 4, 2020, until the inauguration of the President-elect as President.TITLE VI--GENERAL PROVISIONS--THIS ACT(Sec. 601) This section specifies that the funds provided by this bill are in addition to funds otherwise appropriated for the fiscal year involved.(Sec. 602) Funds provided by this bill may not remain available beyond the current fiscal year, unless this bill provides otherwise.(Sec. 603) Unless otherwise specified by this bill, the funds provided by this bill are subject to the authorities and conditions that apply to the applicable appropriations account for FY2021.(Sec. 604) This section specifies that funding provided by this bill may only be used for the purposes specifically described in the bill. The section includes an exception for funds used to restore amounts for obligations incurred prior to the date of the enactment of this bill.(Sec. 605) This section specifies that the term coronavirus in this bill means SARS-CoV-2 or another coronavirus with pandemic potential.(Sec. 606) This section provides that amounts designated by this bill as emergency requirements are only available (or rescinded or transferred, if applicable) if the President subsequently designates the amounts and transmits the designations to Congress.(Sec. 607) This section specifies that the emergency funds that are transferred pursuant to this bill retain the emergency designation.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3508 (117th)",
            "First Name": "Troy Carter",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3508 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 39 West Main Street, in Honeoye Falls, New York, as the \\u201cCW4 Christian J. Koch Memorial Post Office\\u201d.",
            "Summary": "This bill designates the facility of the United States Postal Service located at 39 West Main Street, in Honeoye Falls, New York, as the CW4 Christian J. Koch Memorial Post Office.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 2911 (117th)",
            "First Name": "Troy Carter",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 2911 (117th)",
            "Bill Name": "VA Transparency & Trust Act of 2021",
            "Summary": "This bill requires the Department of Veterans Affairs (VA) to submit a plan for obligating and expending covered funds, which are funds made available to the VA for response to the COVID-19 pandemic.The bill requires the VA to submit biweekly reports regarding obligations, expenditures, and planned uses of the funds until seven days after the VA has expended all covered funds.The Inspector General of the VA must submit reports examining the obligations and expenditures made using covered funds during the specified reporting period.Finally, the Government Accountability Office must submit an interim report and final report containing a review of obligations and expenditures made using covered funds.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 92 (117th)",
            "First Name": "Troy Carter",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 92 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 110 Johnson Street in Pickens, South Carolina, as the \\u201cSpecialist Four Charles Johnson Post Office\\u201d.",
            "Summary": "This bill designates the facility of the United States Postal Service located at 110 Johnson Street in Pickens, South Carolina, as the Specialist Four Charles Johnson Post Office.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 91 (117th)",
            "First Name": "Troy Carter",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 91 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 810 South Pendleton Street in Easley, South Carolina, as the \\u201cPrivate First Class Barrett Lyle Austin Post Office Building\\u201d.",
            "Summary": "This bill designates the facility of the United States Postal Service located at 810 South Pendleton Street in Easley, South Carolina, as the Private First Class Barrett Lyle Austin Post Office Building.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1096",
            "First Name": "Troy Carter",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1096",
            "Bill Name": "250th Anniversary of the United States Marine Corps Commemorative Coin Act",
            "Summary": "This bill directs the Department of the Treasury to mint and issue not more than 50,000 $5 gold coins, 400,000 $1 silver coins, and 750,000 half-dollar clad coins emblematic of the 250th anniversary of the United States Marine Corps.All surcharges received by Treasury from the sale of such coins must be paid to the Marine Corps Heritage Foundation and shall only be used for the purposes of supporting the mission of the Marine Corps Heritage Center.",
            "Status": "Enacted",
            "Democrat_Yea": 0.9528301886792452,
            "Democrat_Nay": 0.0,
            "Republican_Yea": 0.9366515837104072,
            "Republican_Nay": 0.004524886877828
        },
        {
            "Bill Number": "H.R. 6386 (117th)",
            "First Name": "Troy Carter",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 6386 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 450 West Schaumburg Road in Schaumburg, Illinois, as the \\u201cVeterans of Iraq and Afghanistan Memorial Post Office Building\\u201d.",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 700 (117th)",
            "First Name": "Troy Carter",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 700 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 303 East Mississippi Avenue in Elwood, Illinois, as the \\u201cLawrence M. \\u2018Larry\\u2019 Walsh Sr. Post Office\\u201d.",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 5900 (117th)",
            "First Name": "Troy Carter",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 5900 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 2016 East 1st Street in Los Angeles, California, as the \\u201cMarine Corps Reserve PVT Jacob Cruz Post Office\\u201d.",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 224 (117th)",
            "First Name": "Troy Carter",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 224 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 5302 Galveston Road in Houston, Texas, as the Vanessa Guill\\u00e9n Post Office Building.",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1437 (117th)",
            "First Name": "Troy Carter",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1437 (117th)",
            "Bill Name": "Further Continuing Appropriations and Extensions Act, 2023",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 7077 (117th)",
            "First Name": "Troy Carter",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 7077 (117th)",
            "Bill Name": "Empowering the U.S. Fire Administration Act",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 935 (117th)",
            "First Name": "Troy Carter",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 935 (117th)",
            "Bill Name": "Small Business Mergers, Acquisitions, Sales, and Brokerage Simplification Act of 2021",
            "Summary": "This bill exempts from securities registration requirements certain merger-and-acquisition brokers that facilitate transfer of ownership in privately held companies with earnings or revenues under a specified threshold. However, this exemption shall not apply to certain brokers, including those that provide financing related to the transfer of ownership, engage on behalf of any party in a transaction involving specified shell companies, or have been barred or suspended from association with a broker or dealer.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3672",
            "First Name": "Troy Carter",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3672",
            "Bill Name": "To designate the clinic of the Department of Veterans Affairs in Indian River, Michigan, as the \\u201cPfc. Justin T. Paton Department of Veterans Affairs Clinic\\u201d.",
            "Summary": NaN,
            "Status": "Enacted",
            "Democrat_Yea": 0.9386792452830188,
            "Democrat_Nay": 0.0,
            "Republican_Yea": 0.9502262443438914,
            "Republican_Nay": 0.0
        },
        {
            "Bill Number": "H.R. 3746",
            "First Name": "Troy Carter",
            "Vote": "Aye",
            "Bill Number.1": "H.R. 3746",
            "Bill Name": "Fiscal Responsibility Act of 2023",
            "Summary": NaN,
            "Status": "Enacted",
            "Democrat_Yea": 0.9166666666666666,
            "Democrat_Nay": 0.0833333333333333,
            "Republican_Yea": 0.3469387755102041,
            "Republican_Nay": 0.6326530612244898
        },
        {
            "Bill Number": "H.R. 7276 (117th)",
            "First Name": "Troy Carter",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 7276 (117th)",
            "Bill Name": "Ukraine Invasion War Crimes Deterrence and Accountability Act",
            "Summary": "This bill requires the President to report to Congress on atrocities committed during Russia's invasion of Ukraine since February 24, 2022.Specifically, the report must describe in detail (1) U.S. government efforts to collect, analyze, and preserve evidence related to war crimes and other atrocities committed during the invasion; (2) media, public diplomacy, and information operations to make the Russian people, including their military and political leaders, aware of efforts to identify and prosecute those responsible for such atrocities; and (3) the process for a domestic, foreign, or international court or tribunal to obtain information from the U.S. government related to such atrocities.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1218 (117th)",
            "First Name": "Troy Carter",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1218 (117th)",
            "Bill Name": "Data Mapping to Save Moms\\u2019 Lives Act",
            "Summary": "This bill directs the Federal Communications Commission (FCC) to include data on certain maternal health outcomes in its broadband health mapping tool. This is an online platform that allows users to visualize, overlay, and analyze broadband and health data at national, state, and county levels.The FCC must consult with the Centers for Disease Control and Prevention to determine which maternal health outcomes should be incorporated.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 6833 (117th)",
            "First Name": "Troy Carter",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 6833 (117th)",
            "Bill Name": "Continuing Appropriations and Ukraine Supplemental Appropriations Act, 2023",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1734",
            "First Name": "Troy Carter",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1734",
            "Bill Name": "TRANQ Research Act of 2023",
            "Summary": "This bill requires the National Institute of Standards and Technology (NIST) to support research and other activities related to identifying xylazine (a compound used in veterinary medicine as a nonopioid tranquilizer), novel synthetic opioids, and other new psychoactive substances.In particular, NIST must support basic measurement science and research; near-real time spectrometry capabilities (i.e., a technique for rapidly identifying the chemical composition of a substance); strategies and voluntary best practices for handling, transporting, and analyzing such substances; and collaboration with other government agencies, institutions of higher education, and the private sector to enhance relevant narcotic and opioid detection and analysis capabilities. Additionally, the Government Accountability Office must conduct a study on the capabilities of the federal government to detect, identify, and otherwise respond to threats of new psychoactive substances, such as xylazine.",
            "Status": "Enacted",
            "Democrat_Yea": 0.9671361502347418,
            "Democrat_Nay": 0.0,
            "Republican_Yea": 0.9864864864864864,
            "Republican_Nay": 0.0
        },
        {
            "Bill Number": "H.R. 2954 (117th)",
            "First Name": "Troy Carter",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 2954 (117th)",
            "Bill Name": "Securing a Strong Retirement Act of 2021",
            "Summary": "This bill makes various changes with respect to employer-sponsored retirement plans, including providing for the automatic enrollment of employees in certain plans and increasing the age at which participants are required to begin receiving mandatory distributions.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3359 (117th)",
            "First Name": "Troy Carter",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3359 (117th)",
            "Bill Name": "Homicide Victims\\u2019 Families\\u2019 Rights Act of 2021",
            "Summary": "This bill establishes a framework for immediate family members of a victim of murder under federal law to request a review of the victim's case file if the murder was committed more than three years prior, the murder was investigated by a federal law enforcement entity, all probative investigative leads have been exhausted, and no likely perpetrator has been identified.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3197 (117th)",
            "First Name": "Troy Carter",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3197 (117th)",
            "Bill Name": "Save the Liberty Theatre Act of 2021",
            "Summary": NaN,
            "Status": NaN
        },
        {
            "Bill Number": "H.R. 3113 (117th)",
            "First Name": "Troy Carter",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3113 (117th)",
            "Bill Name": "Modernizing Access to Our Public Land Act",
            "Summary": "This bill directs the Department of the Interior, the Forest Service, and the U.S. Army Corps of Engineers to jointly develop and adopt interagency standards to ensure compatibility and interoperability among federal databases for the collection and dissemination of outdoor recreation data related to federal lands and used to depict locations at which recreation uses are available to the public.Interior, the Forest Service, and the Corps of Engineers must digitize and publish geographic information system data that includes federal interests, including easements and rights-of-way, in private land; status information as to whether roads and trails are open or closed; the dates on which roads and trails are seasonally opened and closed; the types of vehicles and recreational uses that are allowed on each segment of roads and trails; and the boundaries of areas where hunting or recreational shooting is permanently restricted or closed. Interior, the Forest Service, and the Corps of Engineers may work with the U.S. Geological Survey to collect, digitize, standardize, or publish data to meet the requirements of this bill.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 2471 (117th)",
            "First Name": "Troy Carter",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 2471 (117th)",
            "Bill Name": "Consolidated Appropriations Act, 2022",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 2471 (117th)",
            "First Name": "Troy Carter",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 2471 (117th)",
            "Bill Name": "Consolidated Appropriations Act, 2022",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 55 (117th)",
            "First Name": "Troy Carter",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 55 (117th)",
            "Bill Name": "Emmett Till Antilynching Act",
            "Summary": "This bill makes lynching a federal hate crime offense.Specifically, the bill imposes criminal penalties—a fine, a prison term of up to 30 years, or both—on an individual who conspires to commit a hate crime offense that results in death or serious bodily injury or that includes kidnapping or an attempt to kidnap, aggravated sexual abuse or an attempt to commit aggravated sexual abuse, or an attempt to kill.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3539 (117th)",
            "First Name": "Troy Carter",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3539 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 223 West Chalan Santo Papa in Hagatna, Guam, as the \\u201cAtanasio Taitano Perez Post Office\\u201d.",
            "Summary": "This bill designates the facility of the United States Postal Service located at 223 West Chalan Santo Papa in Hagatna, Guam, as the Atanasio Taitano Perez Post Office.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 735 (117th)",
            "First Name": "Troy Carter",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 735 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 502 East Cotati Avenue in Cotati, California, as the \\u201cArturo L. Ibleto Post Office Building\\u201d.",
            "Summary": "This bill designates the facility of the United States Postal Service located at 502 East Cotati Avenue in Cotati, California, as the Arturo L. Ibleto Post Office Building.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3076 (117th)",
            "First Name": "Troy Carter",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3076 (117th)",
            "Bill Name": "Postal Service Reform Act of 2022",
            "Summary": "This bill addresses the finances and operations of the U.S. Postal Service (USPS).The bill requires the Office of Personnel Management (OPM) to establish the Postal Service Health Benefits Program within the Federal Employees Health Benefits Program under which OPM may contract with carriers to offer health benefits plans for USPS employees and retirees.The bill provides for coordinated enrollment of retirees under this program and Medicare.The bill repeals the requirement that the USPS annually prepay future retirement health benefits.Additionally, the USPS may establish a program to enter into agreements with an agency of any state government, local government, or tribal government, and with other government agencies, to provide certain nonpostal products and services that reasonably contribute to the costs of the USPS and meet other specified criteria.The USPS must develop and maintain a publicly available dashboard to track service performance and must report regularly on its operations and financial condition.The Postal Regulatory Commission must annually submit to the USPS a budget of its expenses. It must also conduct a study to identify the causes and effects of postal inefficiencies relating to flats (e.g., large envelopes).The USPS Office of Inspector General shall perform oversight of the Postal Regulatory Commission.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 2324 (117th)",
            "First Name": "Troy Carter",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 2324 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 2800 South Adams Street in Tallahassee, Florida, as the \\u201cD. Edwina Stephens Post Office\\u201d.",
            "Summary": "This bill designates the facility of the United States Postal Service located at 2800 South Adams Street in Tallahassee, Florida, as the D. Edwina Stephens Post Office.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1226",
            "First Name": "Troy Carter",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1226",
            "Bill Name": "Wounded Warrior Access Act",
            "Summary": NaN,
            "Status": "Enacted",
            "Democrat_Yea": 0.9575471698113208,
            "Democrat_Nay": 0.0,
            "Republican_Yea": 0.9864864864864864,
            "Republican_Nay": 0.0
        },
        {
            "Bill Number": "H.R. 5577 (117th)",
            "First Name": "Troy Carter",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 5577 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 3900 Crown Road Southwest in Atlanta, Georgia, as the \\u201cJohn R. Lewis Post Office Building\\u201d.",
            "Summary": "This bill designates the facility of the United States Postal Service located at 3900 Crown Road Southwest in Atlanta, Georgia, as the John R. Lewis Post Office Building.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 346",
            "First Name": "Troy Carter",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 346",
            "Bill Name": "NOTAM Improvement Act of 2023",
            "Summary": "This bill directs the Federal Aviation Administration (FAA) to establish the FAA Task Force on NOTAM (notice to air missions required by international or domestic law) Improvement and requires the FAA to implement a federal NOTAM system. A NOTAM is a notice containing information essential to personnel concerned with flight operations but not known far enough in advance to be publicized by other means. It states the abnormal status of a component of the National Airspace System.Specifically, the task force must (1) review existing methods for publishing NOTAMs and flight operations information for pilots; (2) review regulations, policies, systems, and international standards relating to NOTAMs, including their content and presentation to pilots; (3) evaluate and determine best practices to organize, prioritize, and present flight operations information in a manner that optimizes pilot review and retention of relevant information; (4) provide recommendations to improve the publication and delivery of NOTAM information; and (5) report to Congress on its reviews and evaluations.By September 30, 2024, the FAA must (1) complete implementation of a federal NOTAM system and implement a back-up system, and (2) brief Congress on a plan to enhance information delivery through this federal system to promote further global harmonization and provide users of the National Airspace System a consistent format for domestic and international operations.",
            "Status": "Enacted",
            "Democrat_Yea": 0.9764150943396226,
            "Democrat_Nay": 0.0,
            "Republican_Yea": 0.9774774774774776,
            "Republican_Nay": 0.018018018018018
        }
    ],
    "CosponsoredBills": [
        {
            "Bill Number": "H.R. 1096",
            "First Name": "Troy  Carter",
            "Last Name": "cosponsor",
            "Role": "H.R. 1096",
            "Bill Name": "250th Anniversary of the United States Marine Corps Commemorative Coin Act",
            "Subject Areas": "Military personnel and dependents",
            "Summary": "This bill directs the Department of the Treasury to mint and issue not more than 50,000 $5 gold coins, 400,000 $1 silver coins, and 750,000 half-dollar clad coins emblematic of the 250th anniversary of the United States Marine Corps.All surcharges received by Treasury from the sale of such coins must be paid to the Marine Corps Heritage Foundation and shall only be used for the purposes of supporting the mission of the Marine Corps Heritage Center."
        },
        {
            "Bill Number": "H.R. 263 (117th)",
            "First Name": "Troy  Carter",
            "Last Name": "cosponsor",
            "Role": "H.R. 263 (117th)",
            "Bill Name": "Big Cat Public Safety Act",
            "Subject Areas": "Animals, Animal protection and human-animal relationships, Civil actions and liability, Crimes against animals and natural resources, Mammals, Museums, exhibitions, cultural centers, Trade restrictions, Wildlife conservation and habitat protection",
            "Summary": "This bill revises requirements governing the trade of big cats (i.e., species of lion, tiger, leopard, cheetah, jaguar, or cougar or any hybrid of such species). Specifically, it revises restrictions on the possession and exhibition of big cats, including to restrict direct contact between the public and big cats."
        },
        {
            "Bill Number": "H.R. 8404 (117th)",
            "First Name": "Troy  Carter",
            "Last Name": "cosponsor",
            "Role": "H.R. 8404 (117th)",
            "Bill Name": "Respect for Marriage Act",
            "Subject Areas": "Civil Rights and Liberties, Minority Issues, Civil actions and liability, Due process and equal protection, Family relationships, Marriage and family status, Racial and ethnic relations, Sex, gender, sexual orientation discrimination",
            "Summary": NaN
        },
        {
            "Bill Number": "H.R. 3630 (117th)",
            "First Name": "Troy  Carter",
            "Last Name": "cosponsor",
            "Role": "H.R. 3630 (117th)",
            "Bill Name": "Lymphedema Treatment Act",
            "Subject Areas": "Health, Labor and Employment, Cardiovascular and respiratory health, Health care coverage and access, Immunology and vaccination, Medicare",
            "Summary": "This bill provides for Medicare coverage of lymphedema compression treatment items. Specifically, the bill provides for coverage of standard and custom fitted gradient compression garments and other approved items that are prescribed by a physician or other specified health care professional to treat lymphedema."
        },
        {
            "Bill Number": "H.R. 5577 (117th)",
            "First Name": "Troy  Carter",
            "Last Name": "cosponsor",
            "Role": "H.R. 5577 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 3900 Crown Road Southwest in Atlanta, Georgia, as the \\u201cJohn R. Lewis Post Office Building\\u201d.",
            "Subject Areas": "Government Operations and Politics, Congressional tributes, Georgia, Government buildings, facilities, and property, Postal service",
            "Summary": "This bill designates the facility of the United States Postal Service located at 3900 Crown Road Southwest in Atlanta, Georgia, as the John R. Lewis Post Office Building."
        },
        {
            "Bill Number": "H.R. 6833 (117th)",
            "First Name": "Troy  Carter",
            "Last Name": "cosponsor",
            "Role": "H.R. 6833 (117th)",
            "Bill Name": "Continuing Appropriations and Ukraine Supplemental Appropriations Act, 2023",
            "Subject Areas": "Economics and Public Finance, Digestive and metabolic diseases, Drug therapy, Employee benefits and pensions, Health care costs and insurance, Health care coverage and access, Medicare, Prescription drugs",
            "Summary": NaN
        },
        {
            "Bill Number": "H.R. 7791 (117th)",
            "First Name": "Troy  Carter",
            "Last Name": "cosponsor",
            "Role": "H.R. 7791 (117th)",
            "Bill Name": "Access to Baby Formula Act of 2022",
            "Subject Areas": NaN,
            "Summary": "This bill authorizes the Department of Agriculture (USDA) to take certain actions to address emergencies, disasters, and supply chain disruptions (particularly the shortage of infant formula in the United States) affecting participants of the Special Supplemental Nutrition Program for Women, Infants, and Children (WIC).The bill directs USDA to require each infant formula cost containment contract to include remedies in the event of an infant formula recall, including how an infant formula manufacturer would protect against disruption to WIC participants in the state.USDA must, within 30 days, ensure there is a memorandum of understanding with the Department of Health and Human Services that includes procedures for coordination and information sharing regarding any supply chain disruption, including a supplemental food recall.The bill also authorizes USDA to waive or modify any WIC qualified administrative requirement during emergencies, disasters, and supply chain disruptions. Specifically, USDA may waive or modify such a requirement for one or more state agencies if (1) the requirement cannot be met by state agencies during the emergency, disaster, or disruption; and (2) the modification or waiver is necessary to provide assistance to WIC participants and does not substantially weaken the nutritional quality of supplemental foods. For example, USDA may waive the maximum monthly allowance for infant formula.The bill establishes notification requirements for USDA and state agencies related to supply chain disruptions."
        },
        {
            "Bill Number": "H.R. 6015 (117th)",
            "First Name": "Troy  Carter",
            "Last Name": "cosponsor",
            "Role": "H.R. 6015 (117th)",
            "Bill Name": "Benjamin Berell Ferencz Congressional Gold Medal Act",
            "Subject Areas": "International Affairs, Congressional tributes, Criminal investigation, prosecution, interrogation, Europe, Germany, International law and treaties, Lawyers and legal services, Museums, exhibitions, cultural centers, War crimes, genocide, crimes against humanity",
            "Summary": "This bill provides for the award of a Congressional Gold Medal to Benjamin Berell Ferencz in recognition of his service to the United States and the international community during the post-World War II Nuremberg trials and his lifelong advocacy for international criminal justice and the rule of law."
        },
        {
            "Bill Number": "H.R. 7630 (117th)",
            "First Name": "Troy  Carter",
            "Last Name": "cosponsor",
            "Role": "H.R. 7630 (117th)",
            "Bill Name": "Childhood Cancer STAR Reauthorization Act of 2022",
            "Subject Areas": "Health, Cancer, Child health, Computers and information technology, Congressional oversight, Government studies and investigations, Health programs administration and funding, Health technology, devices, supplies, Medical research, Research administration and funding, Research and development",
            "Summary": "This bill reauthorizes through FY2028 and modifies pediatric cancer research and related programs, including to expand collection of and access to relevant biospecimens and to support the transition of pediatric cancer survivors to primary care."
        },
        {
            "Bill Number": "H.R. 7073 (117th)",
            "First Name": "Troy  Carter",
            "Last Name": "cosponsor",
            "Role": "H.R. 7073 (117th)",
            "Bill Name": "Into the Light for MMH and SUD Act of 2022",
            "Subject Areas": NaN,
            "Summary": "This bill reauthorizes through FY2028 a program that addresses maternal depression and, among other changes, expands its scope to include mental health and substance use disorders. It also requires the Department of Health and Human Services to maintain a national hotline to provide mental health and substance use disorder resources to pregnant and postpartum women and their families."
        },
        {
            "Bill Number": "H.R. 1842 (117th)",
            "First Name": "Troy  Carter",
            "Last Name": "cosponsor",
            "Role": "H.R. 1842 (117th)",
            "Bill Name": "Harriet Tubman Bicentennial Commemorative Coin Act",
            "Subject Areas": "U.S. history, Women's rights",
            "Summary": "This bill directs the Department of the Treasury to mint and issue 50,000 $5 gold coins, 400,000 $1 silver coins, and 750,000 half-dollar clad coins emblematic of the legacy of Harriet Tubman as an abolitionist.The Secretary may issue coins under this bill only during the period of January 1, 2024, through December 31, 2024.All surcharges received by Treasury from the sale of such coins must be paid equally to the National Underground Railroad Freedom Center in Cincinnati, Ohio, and The Harriet Tubman Home, Inc. in Auburn, New York, for the purpose of accomplishing and advancing their missions."
        },
        {
            "Bill Number": "H.R. 3642 (117th)",
            "First Name": "Troy  Carter",
            "Last Name": "cosponsor",
            "Role": "H.R. 3642 (117th)",
            "Bill Name": "Harlem Hellfighters Congressional Gold Medal Act",
            "Subject Areas": "Armed Forces and National Security, Conflicts and wars, Congressional tributes, Military history, Military personnel and dependents, Museums, exhibitions, cultural centers, New York State, Racial and ethnic relations, Smithsonian Institution, Veterans' organizations and recognition",
            "Summary": "This bill provides for the award of a Congressional Gold Medal to the 369th Infantry Regiment, commonly known as the Harlem Hellfighters, in recognition of their bravery and outstanding service during World War I."
        },
        {
            "Bill Number": "H.R. 3537 (117th)",
            "First Name": "Troy  Carter",
            "Last Name": "cosponsor",
            "Role": "H.R. 3537 (117th)",
            "Bill Name": "Accelerating Access to Critical Therapies for ALS Act",
            "Subject Areas": "Health, Drug safety, medical device, and laboratory regulation, Drug therapy, Government information and archives, Health care coverage and access, Health programs administration and funding, Health promotion and preventive care, Higher education, Medical research, Medical tests and diagnostic methods, Neurological disorders, Prescription drugs, Public-private cooperation, Research administration and funding, Research and development, Social work, volunteer service, charitable organizations",
            "Summary": "This bill establishes grant programs to address neurodegenerative diseases, such as amyotrophic lateral sclerosis (also known as ALS or Lou Gehrig's disease), and contains other related provisions.The Department of Health and Human Services (HHS) shall award grants to eligible entities for scientific research utilizing data from expanded access to investigational ALS treatments for individuals who are not otherwise eligible for clinical trials. The Food and Drug Administration (FDA) shall award grants to public and private entities to cover the costs of research and development of drugs that diagnose or treat ALS and other rare neurodegenerative diseases.HHS shall also establish the Public-Private Partnership for Neurodegenerative Diseases between the National Institutes of Health, the FDA, and at least one eligible entity (generally, an institution of higher education or a nonprofit organization). The partnership shall support the development and regulatory review of drugs that address ALS and other rare neurodegenerative diseases.The FDA shall publish on its website a five-year action plan for fostering the development of drugs that improve or extend the lives of people living with rare neurodegenerative diseases.The Government Accountability Office must report to Congress about the grants provided under this bill, including an analysis of the impact of such grants on research and development of treatments for ALS."
        },
        {
            "Bill Number": "H.R. 2923 (117th)",
            "First Name": "Troy  Carter",
            "Last Name": "cosponsor",
            "Role": "H.R. 2923 (117th)",
            "Bill Name": "Energy Security and Lightering Independence Act of 2021",
            "Subject Areas": "Immigration, Energy storage, supplies, demand, Immigration status and procedures, Marine and inland water transportation, Transportation employees, Visas and passports",
            "Summary": "This bill authorizes an alien crewman to obtain a permit to land in the United States for up to 180 days if, during this period, the crewman will perform ship-to-ship liquid cargo transfer operations involving a vessel engaged in foreign trade. Currently, an alien crewman may obtain a permit to land for up to 29 days.Under this bill, an alien passing in transit through the United States to board a vessel to perform the above-described liquid cargo transfer operations may qualify as a nonimmigrant in transit. (A qualifying nonimmigrant in transit may obtain a transit visa.)"
        },
        {
            "Bill Number": "H.R. 2252 (117th)",
            "First Name": "Troy  Carter",
            "Last Name": "cosponsor",
            "Role": "H.R. 2252 (117th)",
            "Bill Name": "Emmett Till and Mamie Till-Mobley Congressional Gold Medal Act of 2021",
            "Subject Areas": "Racial and ethnic relations, Smithsonian Institution, U.S. history",
            "Summary": "This bill provides for the posthumous presentation of a Congressional Gold Medal in commemoration of Emmett Till and Mamie Till-Mobley.After the award the medal shall be given to the National Museum of African American History and Culture."
        },
        {
            "Bill Number": "H.R. 1179 (117th)",
            "First Name": "Troy  Carter",
            "Last Name": "cosponsor",
            "Role": "H.R. 1179 (117th)",
            "Bill Name": "Iran Hostages Congressional Gold Medal Act",
            "Subject Areas": "International Affairs, Congressional tributes, Detention of persons, Diplomacy, foreign officials, Americans abroad, Iran, Middle East, Museums, exhibitions, cultural centers, Smithsonian Institution",
            "Summary": "This bill requires the Speaker of the House of Representatives and the President pro tempore of the Senate to arrange for the award of a Congressional Gold Medal commemorating the bravery and endurance of the 53 hostages of the Iran Hostage Crisis.Following its award, the medal shall be given to the National Museum of American History of the Smithsonian Institution for display and research.The Department of the Treasury must strike duplicate medals in silver for presentation to a hostage (or the personal representative of a deceased hostage), and Treasury may also strike and sell duplicate medals in bronze."
        },
        {
            "Bill Number": "H.R. 1012 (117th)",
            "First Name": "Troy  Carter",
            "Last Name": "cosponsor",
            "Role": "H.R. 1012 (117th)",
            "Bill Name": "\\u2018Six Triple Eight\\u2019 Congressional Gold Medal Act of 2021",
            "Subject Areas": "Military history, Military personnel and dependents, Minority employment, Museums, exhibitions, cultural centers, Postal service, Smithsonian Institution, Women's employment",
            "Summary": "This bill directs the Speaker of the House of Representatives and the President pro tempore of the Senate to arrange for the award of a Congressional Gold Medal in honor of the women of the 6888th Central Postal Directory Battalion (commonly known as the Six Triple Eight) in recognition of their pioneering military service, devotion to duty, and contributions to increase the morale of personnel stationed in the European theater of operations during World War II. The medal shall be given to the Smithsonian Institution and made available for display and research."
        },
        {
            "Bill Number": "H.R. 5141 (117th)",
            "First Name": "Troy  Carter",
            "Last Name": "cosponsor",
            "Role": "H.R. 5141 (117th)",
            "Bill Name": "Maximizing Outcomes through Better Investments in Lifesaving Equipment for (MOBILE) Health Care Act",
            "Subject Areas": "Health, Building construction, Dental care, Health care coverage and access, Health facilities and institutions, Health programs administration and funding, Health promotion and preventive care, Health technology, devices, supplies, Motor vehicles",
            "Summary": "This bill allows a health center that currently receives funding through a Health Resources & Services Administration Health Center Program grant to use a New Access Point grant to set up a mobile unit regardless of whether the health center also establishes a permanent health care delivery site.New Access Point grants help health centers establish new delivery sites to provide comprehensive primary care to medically underserved populations. Under current law, health centers may only use the grants to set up a mobile unit if they also establish a permanent site."
        }
    ],
    "SponsoredBills": [
        {
            "Bill Number": "H.R. 7863 (117th)",
            "First Name": "Troy  Carter",
            "Last Name": "sponsor",
            "Role": "H.R. 7863 (117th)",
            "Bill Name": "Disaster Resiliency Planning Act",
            "Subject Areas": "Emergency Management",
            "Summary": "This bill requires the Office of Management and Budget to establish guidance that requires federal agencies to incorporate natural disaster resilience into real property asset management and investment decisions. Specifically, the guidance must direct each agency to incorporate assessments of natural disaster risk information conducted by the agency, such as from vulnerability and other risk assessments, into real property asset management and investment decisions."
        }
    ],
    "VotingRecord": [
        {
            "Bill Number": "H.R. 7777 (117th)",
            "First Name": "Troy Carter",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 7777 (117th)",
            "Bill Name": "Industrial Control Systems Cybersecurity Training Act",
            "Summary": "This bill establishes within the Cybersecurity and Infrastructure Security Agency an initiative to provide the cybersecurity workforce with no-cost training related to securing industrial control systems. These are information systems used to control industrial processes, such as manufacturing, product handling, production, and distribution.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3537 (117th)",
            "First Name": "Troy Carter",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3537 (117th)",
            "Bill Name": "Accelerating Access to Critical Therapies for ALS Act",
            "Summary": "This bill establishes grant programs to address neurodegenerative diseases, such as amyotrophic lateral sclerosis (also known as ALS or Lou Gehrig's disease), and contains other related provisions.The Department of Health and Human Services (HHS) shall award grants to eligible entities for scientific research utilizing data from expanded access to investigational ALS treatments for individuals who are not otherwise eligible for clinical trials. The Food and Drug Administration (FDA) shall award grants to public and private entities to cover the costs of research and development of drugs that diagnose or treat ALS and other rare neurodegenerative diseases.HHS shall also establish the Public-Private Partnership for Neurodegenerative Diseases between the National Institutes of Health, the FDA, and at least one eligible entity (generally, an institution of higher education or a nonprofit organization). The partnership shall support the development and regulatory review of drugs that address ALS and other rare neurodegenerative diseases.The FDA shall publish on its website a five-year action plan for fostering the development of drugs that improve or extend the lives of people living with rare neurodegenerative diseases.The Government Accountability Office must report to Congress about the grants provided under this bill, including an analysis of the impact of such grants on research and development of treatments for ALS.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 4250 (117th)",
            "First Name": "Troy Carter",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 4250 (117th)",
            "Bill Name": "War Crimes Rewards Expansion Act",
            "Summary": "This bill expands the Department of State's rewards program to authorize rewards for providing information leading to the arrest, conviction, or transfer of a foreign national accused of war crimes, crimes against humanity, or genocide as such crimes are defined under the law of an international criminal tribunal, the applicable country, or the United States. Currently, rewards are authorized for information leading to the arrest, conviction, or transfer of a foreign national accused of such crimes only as defined under the statutes of the relevant tribunal.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 5574 (117th)",
            "First Name": "Troy Carter",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 5574 (117th)",
            "Bill Name": "TRANSLATE ACT",
            "Summary": "This bill directs the Transportation Security Administration (TSA) to develop a plan to ensure that TSA material disseminated in major airports is better understood by people accessing such airports, including by foreign language speakers and people with vision or hearing impairments.In developing the plan, the TSA must take into consideration data regarding international enplanement and local populations surrounding major airports.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1917 (117th)",
            "First Name": "Troy Carter",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1917 (117th)",
            "Bill Name": "Hazard Eligibility and Local Projects Act",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1154 (117th)",
            "First Name": "Troy Carter",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1154 (117th)",
            "Bill Name": "Great Dismal Swamp National Heritage Area Act",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 7776 (117th)",
            "First Name": "Troy Carter",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 7776 (117th)",
            "Bill Name": "James M. Inhofe National Defense Authorization Act for Fiscal Year 2023",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 1339 (117th)",
            "First Name": "Troy Carter",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 1339 (117th)",
            "Bill Name": "Advanced Air Mobility Coordination and Leadership Act",
            "Summary": "This bill directs the Department of Transportation to establish an Advanced Air Mobility (AAM) interagency working group to plan and coordinate efforts related to the safety, operations, infrastructure, physical security, cybersecurity, and federal investment necessary to bolster the AAM ecosystem in the United States. Advanced Air Mobility refers to a transportation system that transports people and property by air between two points in the United States using aircraft, including electric aircraft or electric vertical take-off and landing aircraft, in both controlled and uncontrolled airspace.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 4665",
            "First Name": "Troy Carter",
            "Vote": "Nay",
            "Bill Number.1": "H.R. 4665",
            "Bill Name": "Department of State, Foreign Operations, and Related Programs Appropriations Act, 2024",
            "Summary": "This bill provides FY2024 appropriations for the Department of State, foreign operations, and related programs.The bill provides appropriations to the State Department for Administration of Foreign Affairs, International Organizations, and International Commissions. The bill provides appropriations for related agencies and programs, including the U.S. Agency for Global Media, the Asia Foundation, the U.S. Institute of Peace, the Center for Middle Eastern-Western Dialogue Trust Fund, the Eisenhower Exchange Fellowship Program, the Israeli Arab Scholarship Program, the East-West Center, and the National Endowment for Democracy. The bill provides appropriations for other commissions, including the Commission for the Preservation of America's Heritage Abroad, the U.S. Commission on International Religious Freedom, the Commission on Security and Cooperation in Europe, the Congressional-Executive Commission on the People's Republic of China, and the U.S.-China Economic and Security Review Commission. The bill provides appropriations to the U.S. Agency for International Development (USAID), the State Department and the President for International Security Assistance, and International Financial Institutions for Multilateral Assistance. The bill provides appropriations for bilateral economic assistance, including programs and activities conducted by the President; the State Department; Independent Agencies, including the Peace Corps, the Millennium Challenge Corporation, the Inter-American Foundation, and the U.S. African Development Foundation; and the Department of the Treasury. The bill provides appropriations for export and investment assistance to the Export-Import Bank of the United States, the U.S. International Development Finance Corporation, and the U.S. Trade and Development Agency. The bill sets forth requirements and restrictions for using funds provided by this and other appropriations acts.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3616 (117th)",
            "First Name": "Troy Carter",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3616 (117th)",
            "Bill Name": "Bear River National Heritage Area Study Act",
            "Summary": "This bill directs the Department of the Interior to conduct a study to assess the suitability and feasibility of designating the study area, including areas in Utah and Idaho that are within the main drainage area of the Bear River, as a National Heritage Area, to be known as the Bear River National Heritage Area.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 2278 (117th)",
            "First Name": "Troy Carter",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 2278 (117th)",
            "Bill Name": "To designate the September 11th National Memorial Trail Route, and for other purposes.",
            "Summary": "This bill designates a trail route, to be known as the September 11th National Memorial Trail Route, to link the National 9/11 Memorial and Museum in New York, New York, the National 9/11 Pentagon Memorial in Arlington, Virginia, and the Flight 93 National Memorial in Somerset County, Pennsylvania.The September 11th National Memorial Trail Route shall provide for a tribute to the family members and loved ones who were victims of the attack and the heroes of September 11th, including the first responders in the days, weeks, and months after the attack; be a trail of remembrance to honor the fallen in a tangible way that keeps their memories alive and reaffirms the exceptionalism of our country; and be a celebration of our nation's resilience and perseverance since September 11, 2001. The September 11th National Memorial Trail Route shall be administered by the National Park Service but not be considered to be a unit of the National Park System or a part of the National Trail System.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 2872",
            "First Name": "Troy Carter",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 2872",
            "Bill Name": "Further Additional Continuing Appropriations and Other Extensions Act, 2024",
            "Summary": "This bill provides continuing FY2024 appropriations for federal agencies. The bill also extends several expiring programs and authorities, including several public health programs.DIVISION A--FURTHER ADDITIONAL CONTINUING APPROPRIATIONS ACT, 2024Further Additional Continuing Appropriations Act, 2024 (Sec. 101) This section provides continuing FY2024 appropriations for federal agencies. It is known as a continuing resolution (CR) and prevents a government shutdown that would otherwise occur if the FY2024 appropriations bills have not been enacted when the existing CR expires.The CR provides funding through March 1, 2024, for agencies and programs that were funded in the following four FY2023 appropriations acts: the Agriculture, Rural Development, Food and Drug Administration, and Related Agencies Appropriations Act, 2023; the Energy and Water Development and Related Agencies Appropriations Act, 2023; the Military Construction, Veterans Affairs, and Related Agencies Appropriations Act, 2023; and the Transportation, Housing and Urban Development, and Related Agencies Appropriations Act, 2023. (Under the current CR, these agencies and programs are funded through January 19, 2024.)For most other federal agencies and programs, the CR provides funding through March 8, 2024. (Under the current CR, these agencies and programs are funded through February 2, 2024.)The CR generally funds most programs and activities at the FY2023 levels with several exceptions that provide funding flexibility and additional appropriations for various programs. For example, the CR includes exceptions for the National Nuclear Security Administration and the Federal Aviation Administration.In addition, the CR allows the Department of Defense to obligate specified funds from the Shipbuilding and Conversion, Navy account for the procurement of one Columbia Class Submarine.The CR also extends the authority for the U.S. Parole Commission.DIVISION B--OTHER MATTERS TITLE I--HEALTH AND HUMAN SERVICESSubtitle A--Public Health Extenders(Sec. 101) This section extends through March 8, 2024, funding for the Teaching Health Center Graduate Medical Education Program, the Community Health Center Fund, and the National Health Services Corps. (The program supports education and training of medical students in primary care residency programs in community-based ambulatory patient care centers. The fund supports (1) grants for outpatient health care facilities that serve medically underserved populations; and (2) the National Health Service Corps, which provides scholarships and student loan repayment awards to health care providers who agree to work in areas with health care provider shortages.)(Sec. 102) This section extends funding through March 8, 2024, for the Special Diabetes Program for Type I Diabetes and the Special Diabetes Program for Indians. (The Special Diabetes Program for Type I Diabetes supports research on the prevention and cure of Type I diabetes, and the Special Diabetes Program for Indians supports diabetes treatment and prevention for tribal populations.)(Sec. 103) This section extends through March 8, 2024, the authority that allows states and tribes to request the temporary reassignment of state and local health department personnel who are funded through certain federal programs to immediately address a public health emergency.It also extends through March 8, 2024, provisions that prohibit the disclosure of information about Department of Health and Human Services (HHS) programs that could compromise national security (e.g., information regarding biomedical threats).The section extends provisions that authorize HHS to engage with developers of medical countermeasures, and that provide for related antitrust exemptions, for the purpose of furthering product development.Additionally, the section extends through March 8, 2024, the National Advisory Committee on Children and Disasters, the National Advisory Committee on Seniors and Disasters, and the National Advisory Committee on Individuals with Disabilities and Disasters.It also extends through March 8, 2024, the authority of HHS to directly appoint candidates to positions within the National Disaster Medical System if HHS determines the number of personnel in the system is insufficient to address a public health emergency or potential public health emergency.(The National Disaster Medical System is a partnership between HHS, the Department of Defense, and other federal departments that responds to public health and other emergencies, including by deploying medical response teams.)Subtitle B--Medicaid(Sec. 121) This section delays reductions to Medicaid disproportionate-share hospital (DSH) allotments until March 9, 2024. (DSHs are hospitals that receive additional payments under Medicaid for treating a large share of low-income patients.)(Sec. 122) This section reduces the amount of funding available to the Medicaid Improvement Fund for activities relating to mechanized claims systems beginning in FY2028.Subtitle C--Medicare(Sec. 131) This section extends through March 8, 2024, certain minimum adjustments to the work geographic index with respect to payments for physician services under Medicare.(Sec. 132) This section reduces funding for the Medicare Improvement Fund.Subtitle D--Human Services(Sec. 141) This section funds through March 8, 2024, programs that support child welfare services and activities. Specifically, it funds the (1) Stephanie Tubbs Jones Child Welfare Service Program, which provides grants to states and Indian tribes to support preventive interventions and other activities to keep families together; and (2) the MaryLee Allen Promoting Safe and Stable Families Program, which supports efforts to prevent the unnecessary separation of children from their families, improve quality of care and services to children and their families, and ensure permanent living arrangements for children (e.g., parental reunification or adoption).(Sec. 142) This section extends funding through March 8, 2024, for the Sexual Risk Avoidance Education Program. This program supports projects to implement sexual risk avoidance education that teaches participants to voluntarily refrain from nonmarital sexual activities.(Sec. 143) This section extends funding through March 8, 2024, for the Personal Responsibility Education Program. This program provides grants to states to educate young people about abstinence and contraception for prevention of pregnancy and sexually transmitted infections. The program also supports pregnant and parenting youth TITLE II--COMPACTS(Sec. 201) This section extends through March 8, 2024, provisions that provide grants and other financial assistance to the Federated States of Micronesia and the Republic of the Marshall Islands.TITLE III--COUNTER-UAS AUTHORITIES(Sec. 301) This section extends through March 8, 2024, the authority of the Department of Homeland Security and the Department of Justice to take certain actions to mitigate a credible threat to certain facilities or assets from an unmanned aircraft system (UAS). These include certain facilities that are located in the United States and identified as high-risk and a potential target for unlawful UAS activity.TITLE IV--BUDGETARY EFFECTS(Sec. 401) This section exempts the budgetary effects of this division from (1) the Statutory Pay-As-You-Go Act of 2010 (PAYGO Act), (2) the Senate PAYGO rule, and (3) certain budget scorekeeping rules.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3599 (117th)",
            "First Name": "Troy Carter",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3599 (117th)",
            "Bill Name": "Federal Rotational Cyber Workforce Program Act of 2021",
            "Summary": "This bill establishes a rotational cyber workforce program under which certain federal employees may be detailed among rotational cyber workforce positions at other agencies.This bill authorizes an agency to determine whether a workforce position involving information technology, cybersecurity, or other cyber-related functions in that agency is eligible for the program.Additionally, the bill requires the Office of Personnel Management to issue a Federal Rotational Cyber Workforce Program operation plan providing policies, processes, and procedures for detailing employees among rotational cyber workforce positions at agencies.The Government Accountability Office must assess the operation and effectiveness of the rotational cyber workforce program by addressing the extent to which agencies have participated in the program and the experiences of employees serving in the program.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 3531 (117th)",
            "First Name": "Troy Carter",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 3531 (117th)",
            "Bill Name": "Women Who Worked on the Home Front World War II Memorial Act",
            "Summary": "This bill authorizes the Women Who Worked on the Home Front Foundation to establish a commemorative work on federal land in the District of Columbia in commemoration of the commitment and service represented by women who worked on the home front during World War II.The foundation shall be solely responsible for the acceptance of contributions for, and payment of the expenses of, establishing the commemorative work.The establishment of the commemorative work shall be in accordance with the Commemorative Works Act.The bill prohibits federal funds from being used to pay any expense for the establishment of the commemorative work.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 2617 (117th)",
            "First Name": "Troy Carter",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 2617 (117th)",
            "Bill Name": "Consolidated Appropriations Act, 2023",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 4367",
            "First Name": "Troy Carter",
            "Vote": "Nay",
            "Bill Number.1": "H.R. 4367",
            "Bill Name": "Department of Homeland Security Appropriations Act, 2024",
            "Summary": "This bill provides FY2024 appropriations for the Department of Homeland Security (DHS).Specifically, the bill provides appropriations to DHS for Departmental Management, Intelligence, Situational Awareness, and Oversight, including the Office of the Secretary and Executive Management; the Management Directorate; Intelligence, Analysis, and Situational Awareness; and the Office of the Inspector General. In addition, the bill provides appropriations for Security, Enforcement, and Investigations, including U.S. Customs and Border Protection, U.S. Immigration and Customs Enforcement, the Transportation Security Administration, the U.S. Coast Guard, and the U.S. Secret Service. The bill provides appropriations for Protection, Preparedness, Response, and Recovery, including the Cybersecurity and Infrastructure Security Agency, and the Federal Emergency Management Agency (FEMA). The bill provides appropriations for Research, Development, Training, and Services, including U.S. Citizenship and Immigration Services, the Federal Law Enforcement Training Centers, the Science and Technology Directorate, and the Countering Weapons of Mass Destruction Office. The bill also sets forth requirements and restrictions for using funds provided by this and other appropriations acts.",
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 203 (117th)",
            "First Name": "Troy Carter",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 203 (117th)",
            "Bill Name": "To designate the facility of the United States Postal Service located at 4020 Broadway Street in Houston, Texas, as the Benny C. Martinez Post Office Building.",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 897 (117th)",
            "First Name": "Troy Carter",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 897 (117th)",
            "Bill Name": "Agua Caliente Land Exchange Fee to Trust Confirmation Act",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 2930 (117th)",
            "First Name": "Troy Carter",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 2930 (117th)",
            "Bill Name": "Safeguard Tribal Objects of Patrimony Act of 2021",
            "Summary": NaN,
            "Status": "Enacted"
        },
        {
            "Bill Number": "H.R. 5677 (117th)",
            "First Name": "Troy Carter",
            "Vote": "Yea",
            "Bill Number.1": "H.R. 5677",
            "Bill Name": "5G SALE Act",
            "Summary": "This bill temporarily authorizes the Federal Communications Commission (FCC) to process applications for licenses or permits for the use of specified bands of the electromagnetic spectrum that were auctioned on or before March 9, 2023. The authorization terminates 90 days after the enactment of the bill.The FCC has not processed the licenses or permits for the previously auctioned spectrum because its authority to conduct auctions lapsed on March 9, 2023.",
            "Status": "Enacted"
        }
    ]
}